FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ------------------------------  GPDMA0_CH_CFGH  ----------------------------- */
#define GPDMA0_CH_CFGH_FCMODE_Pos          0                                                       /*!< GPDMA0_CH0_1 CFGH: FCMODE Position      */
#define GPDMA0_CH_CFGH_FCMODE_Msk          (0x01UL << GPDMA0_CH_CFGH_FCMODE_Pos)                /*!< GPDMA0_CH0_1 CFGH: FCMODE Mask          */
#define GPDMA0_CH_CFGH_FIFO_MODE_Pos       1                                                       /*!< GPDMA0_CH0_1 CFGH: FIFO_MODE Position   */
#define GPDMA0_CH_CFGH_FIFO_MODE_Msk       (0x01UL << GPDMA0_CH_CFGH_FIFO_MODE_Pos)             /*!< GPDMA0_CH0_1 CFGH: FIFO_MODE Mask       */
#define GPDMA0_CH_CFGH_PROTCTL_Pos         2                                                       /*!< GPDMA0_CH0_1 CFGH: PROTCTL Position     */
#define GPDMA0_CH_CFGH_PROTCTL_Msk         (0x07UL << GPDMA0_CH_CFGH_PROTCTL_Pos)               /*!< GPDMA0_CH0_1 CFGH: PROTCTL Mask         */
#define GPDMA0_CH_CFGH_DS_UPD_EN_Pos       5                                                       /*!< GPDMA0_CH0_1 CFGH: DS_UPD_EN Position   */
#define GPDMA0_CH_CFGH_DS_UPD_EN_Msk       (0x01UL << GPDMA0_CH_CFGH_DS_UPD_EN_Pos)             /*!< GPDMA0_CH0_1 CFGH: DS_UPD_EN Mask       */
#define GPDMA0_CH_CFGH_SS_UPD_EN_Pos       6                                                       /*!< GPDMA0_CH0_1 CFGH: SS_UPD_EN Position   */
#define GPDMA0_CH_CFGH_SS_UPD_EN_Msk       (0x01UL << GPDMA0_CH_CFGH_SS_UPD_EN_Pos)             /*!< GPDMA0_CH0_1 CFGH: SS_UPD_EN Mask       */
#define GPDMA0_CH_CFGH_SRC_PER_Pos         7                                                       /*!< GPDMA0_CH0_1 CFGH: SRC_PER Position     */
#define GPDMA0_CH_CFGH_SRC_PER_Msk         (0x0fUL << GPDMA0_CH_CFGH_SRC_PER_Pos)               /*!< GPDMA0_CH0_1 CFGH: SRC_PER Mask         */
#define GPDMA0_CH_CFGH_DEST_PER_Pos        11                                                      /*!< GPDMA0_CH0_1 CFGH: DEST_PER Position    */
#define GPDMA0_CH_CFGH_DEST_PER_Msk        (0x0fUL << GPDMA0_CH_CFGH_DEST_PER_Pos)              /*!< GPDMA0_CH0_1 CFGH: DEST_PER Mask        */

/* ------------------------------  GPDMA0_CH_SGR  ------------------------------ */
#define GPDMA0_CH_SGR_SGI_Pos              0                                                       /*!< GPDMA0_CH0_1 SGR: SGI Position          */
#define GPDMA0_CH_SGR_SGI_Msk              (0x000fffffUL << GPDMA0_CH_SGR_SGI_Pos)              /*!< GPDMA0_CH0_1 SGR: SGI Mask              */
#define GPDMA0_CH_SGR_SGC_Pos              20                                                      /*!< GPDMA0_CH0_1 SGR: SGC Position          */
#define GPDMA0_CH_SGR_SGC_Msk              (0x00000fffUL << GPDMA0_CH_SGR_SGC_Pos)              /*!< GPDMA0_CH0_1 SGR: SGC Mask              */

/* ------------------------------  GPDMA0_CH_DSR  ------------------------------ */
#define GPDMA0_CH_DSR_DSI_Pos              0                                                       /*!< GPDMA0_CH0_1 DSR: DSI Position          */
#define GPDMA0_CH_DSR_DSI_Msk              (0x000fffffUL << GPDMA0_CH_DSR_DSI_Pos)              /*!< GPDMA0_CH0_1 DSR: DSI Mask              */
#define GPDMA0_CH_DSR_DSC_Pos              20                                                      /*!< GPDMA0_CH0_1 DSR: DSC Position          */
#define GPDMA0_CH_DSR_DSC_Msk              (0x00000fffUL << GPDMA0_CH_DSR_DSC_Pos)              /*!< GPDMA0_CH0_1 DSR: DSC Mask              */


/* ================================================================================ */
/* ================         struct 'GPDMA1' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  GPDMA1_RAWTFR  ------------------------------- */
#define GPDMA1_RAWTFR_CH0_Pos                 0                                                       /*!< GPDMA1 RAWTFR: CH0 Position             */
#define GPDMA1_RAWTFR_CH0_Msk                 (0x01UL << GPDMA1_RAWTFR_CH0_Pos)                       /*!< GPDMA1 RAWTFR: CH0 Mask                 */
#define GPDMA1_RAWTFR_CH1_Pos                 1                                                       /*!< GPDMA1 RAWTFR: CH1 Position             */
#define GPDMA1_RAWTFR_CH1_Msk                 (0x01UL << GPDMA1_RAWTFR_CH1_Pos)                       /*!< GPDMA1 RAWTFR: CH1 Mask                 */
#define GPDMA1_RAWTFR_CH2_Pos                 2                                                       /*!< GPDMA1 RAWTFR: CH2 Position             */
#define GPDMA1_RAWTFR_CH2_Msk                 (0x01UL << GPDMA1_RAWTFR_CH2_Pos)                       /*!< GPDMA1 RAWTFR: CH2 Mask                 */
#define GPDMA1_RAWTFR_CH3_Pos                 3                                                       /*!< GPDMA1 RAWTFR: CH3 Position             */
#define GPDMA1_RAWTFR_CH3_Msk                 (0x01UL << GPDMA1_RAWTFR_CH3_Pos)                       /*!< GPDMA1 RAWTFR: CH3 Mask                 */

/* -------------------------------  GPDMA1_RAWBLOCK  ------------------------------ */
#define GPDMA1_RAWBLOCK_CH0_Pos               0                                                       /*!< GPDMA1 RAWBLOCK: CH0 Position           */
#define GPDMA1_RAWBLOCK_CH0_Msk               (0x01UL << GPDMA1_RAWBLOCK_CH0_Pos)                     /*!< GPDMA1 RAWBLOCK: CH0 Mask               */
#define GPDMA1_RAWBLOCK_CH1_Pos               1                                                       /*!< GPDMA1 RAWBLOCK: CH1 Position           */
#define GPDMA1_RAWBLOCK_CH1_Msk               (0x01UL << GPDMA1_RAWBLOCK_CH1_Pos)                     /*!< GPDMA1 RAWBLOCK: CH1 Mask               */
#define GPDMA1_RAWBLOCK_CH2_Pos               2                                                       /*!< GPDMA1 RAWBLOCK: CH2 Position           */
#define GPDMA1_RAWBLOCK_CH2_Msk               (0x01UL << GPDMA1_RAWBLOCK_CH2_Pos)                     /*!< GPDMA1 RAWBLOCK: CH2 Mask               */
#define GPDMA1_RAWBLOCK_CH3_Pos               3                                                       /*!< GPDMA1 RAWBLOCK: CH3 Position           */
#define GPDMA1_RAWBLOCK_CH3_Msk               (0x01UL << GPDMA1_RAWBLOCK_CH3_Pos)                     /*!< GPDMA1 RAWBLOCK: CH3 Mask               */

/* ------------------------------  GPDMA1_RAWSRCTRAN  ----------------------------- */
#define GPDMA1_RAWSRCTRAN_CH0_Pos             0                                                       /*!< GPDMA1 RAWSRCTRAN: CH0 Position         */
#define GPDMA1_RAWSRCTRAN_CH0_Msk             (0x01UL << GPDMA1_RAWSRCTRAN_CH0_Pos)                   /*!< GPDMA1 RAWSRCTRAN: CH0 Mask             */
#define GPDMA1_RAWSRCTRAN_CH1_Pos             1                                                       /*!< GPDMA1 RAWSRCTRAN: CH1 Position         */
#define GPDMA1_RAWSRCTRAN_CH1_Msk             (0x01UL << GPDMA1_RAWSRCTRAN_CH1_Pos)                   /*!< GPDMA1 RAWSRCTRAN: CH1 Mask             */
#define GPDMA1_RAWSRCTRAN_CH2_Pos             2                                                       /*!< GPDMA1 RAWSRCTRAN: CH2 Position         */
#define GPDMA1_RAWSRCTRAN_CH2_Msk             (0x01UL << GPDMA1_RAWSRCTRAN_CH2_Pos)                   /*!< GPDMA1 RAWSRCTRAN: CH2 Mask             */
#define GPDMA1_RAWSRCTRAN_CH3_Pos             3                                                       /*!< GPDMA1 RAWSRCTRAN: CH3 Position         */
#define GPDMA1_RAWSRCTRAN_CH3_Msk             (0x01UL << GPDMA1_RAWSRCTRAN_CH3_Pos)                   /*!< GPDMA1 RAWSRCTRAN: CH3 Mask             */

