FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ------------------------------  GPDMA1_RAWDSTTRAN  ----------------------------- */
#define GPDMA1_RAWDSTTRAN_CH0_Pos             0                                                       /*!< GPDMA1 RAWDSTTRAN: CH0 Position         */
#define GPDMA1_RAWDSTTRAN_CH0_Msk             (0x01UL << GPDMA1_RAWDSTTRAN_CH0_Pos)                   /*!< GPDMA1 RAWDSTTRAN: CH0 Mask             */
#define GPDMA1_RAWDSTTRAN_CH1_Pos             1                                                       /*!< GPDMA1 RAWDSTTRAN: CH1 Position         */
#define GPDMA1_RAWDSTTRAN_CH1_Msk             (0x01UL << GPDMA1_RAWDSTTRAN_CH1_Pos)                   /*!< GPDMA1 RAWDSTTRAN: CH1 Mask             */
#define GPDMA1_RAWDSTTRAN_CH2_Pos             2                                                       /*!< GPDMA1 RAWDSTTRAN: CH2 Position         */
#define GPDMA1_RAWDSTTRAN_CH2_Msk             (0x01UL << GPDMA1_RAWDSTTRAN_CH2_Pos)                   /*!< GPDMA1 RAWDSTTRAN: CH2 Mask             */
#define GPDMA1_RAWDSTTRAN_CH3_Pos             3                                                       /*!< GPDMA1 RAWDSTTRAN: CH3 Position         */
#define GPDMA1_RAWDSTTRAN_CH3_Msk             (0x01UL << GPDMA1_RAWDSTTRAN_CH3_Pos)                   /*!< GPDMA1 RAWDSTTRAN: CH3 Mask             */

/* --------------------------------  GPDMA1_RAWERR  ------------------------------- */
#define GPDMA1_RAWERR_CH0_Pos                 0                                                       /*!< GPDMA1 RAWERR: CH0 Position             */
#define GPDMA1_RAWERR_CH0_Msk                 (0x01UL << GPDMA1_RAWERR_CH0_Pos)                       /*!< GPDMA1 RAWERR: CH0 Mask                 */
#define GPDMA1_RAWERR_CH1_Pos                 1                                                       /*!< GPDMA1 RAWERR: CH1 Position             */
#define GPDMA1_RAWERR_CH1_Msk                 (0x01UL << GPDMA1_RAWERR_CH1_Pos)                       /*!< GPDMA1 RAWERR: CH1 Mask                 */
#define GPDMA1_RAWERR_CH2_Pos                 2                                                       /*!< GPDMA1 RAWERR: CH2 Position             */
#define GPDMA1_RAWERR_CH2_Msk                 (0x01UL << GPDMA1_RAWERR_CH2_Pos)                       /*!< GPDMA1 RAWERR: CH2 Mask                 */
#define GPDMA1_RAWERR_CH3_Pos                 3                                                       /*!< GPDMA1 RAWERR: CH3 Position             */
#define GPDMA1_RAWERR_CH3_Msk                 (0x01UL << GPDMA1_RAWERR_CH3_Pos)                       /*!< GPDMA1 RAWERR: CH3 Mask                 */

/* ------------------------------  GPDMA1_STATUSTFR  ------------------------------ */
#define GPDMA1_STATUSTFR_CH0_Pos              0                                                       /*!< GPDMA1 STATUSTFR: CH0 Position          */
#define GPDMA1_STATUSTFR_CH0_Msk              (0x01UL << GPDMA1_STATUSTFR_CH0_Pos)                    /*!< GPDMA1 STATUSTFR: CH0 Mask              */
#define GPDMA1_STATUSTFR_CH1_Pos              1                                                       /*!< GPDMA1 STATUSTFR: CH1 Position          */
#define GPDMA1_STATUSTFR_CH1_Msk              (0x01UL << GPDMA1_STATUSTFR_CH1_Pos)                    /*!< GPDMA1 STATUSTFR: CH1 Mask              */
#define GPDMA1_STATUSTFR_CH2_Pos              2                                                       /*!< GPDMA1 STATUSTFR: CH2 Position          */
#define GPDMA1_STATUSTFR_CH2_Msk              (0x01UL << GPDMA1_STATUSTFR_CH2_Pos)                    /*!< GPDMA1 STATUSTFR: CH2 Mask              */
#define GPDMA1_STATUSTFR_CH3_Pos              3                                                       /*!< GPDMA1 STATUSTFR: CH3 Position          */
#define GPDMA1_STATUSTFR_CH3_Msk              (0x01UL << GPDMA1_STATUSTFR_CH3_Pos)                    /*!< GPDMA1 STATUSTFR: CH3 Mask              */

/* -----------------------------  GPDMA1_STATUSBLOCK  ----------------------------- */
#define GPDMA1_STATUSBLOCK_CH0_Pos            0                                                       /*!< GPDMA1 STATUSBLOCK: CH0 Position        */
#define GPDMA1_STATUSBLOCK_CH0_Msk            (0x01UL << GPDMA1_STATUSBLOCK_CH0_Pos)                  /*!< GPDMA1 STATUSBLOCK: CH0 Mask            */
#define GPDMA1_STATUSBLOCK_CH1_Pos            1                                                       /*!< GPDMA1 STATUSBLOCK: CH1 Position        */
#define GPDMA1_STATUSBLOCK_CH1_Msk            (0x01UL << GPDMA1_STATUSBLOCK_CH1_Pos)                  /*!< GPDMA1 STATUSBLOCK: CH1 Mask            */
#define GPDMA1_STATUSBLOCK_CH2_Pos            2                                                       /*!< GPDMA1 STATUSBLOCK: CH2 Position        */
#define GPDMA1_STATUSBLOCK_CH2_Msk            (0x01UL << GPDMA1_STATUSBLOCK_CH2_Pos)                  /*!< GPDMA1 STATUSBLOCK: CH2 Mask            */
#define GPDMA1_STATUSBLOCK_CH3_Pos            3                                                       /*!< GPDMA1 STATUSBLOCK: CH3 Position        */
#define GPDMA1_STATUSBLOCK_CH3_Msk            (0x01UL << GPDMA1_STATUSBLOCK_CH3_Pos)                  /*!< GPDMA1 STATUSBLOCK: CH3 Mask            */

/* ----------------------------  GPDMA1_STATUSSRCTRAN  ---------------------------- */
#define GPDMA1_STATUSSRCTRAN_CH0_Pos          0                                                       /*!< GPDMA1 STATUSSRCTRAN: CH0 Position      */
#define GPDMA1_STATUSSRCTRAN_CH0_Msk          (0x01UL << GPDMA1_STATUSSRCTRAN_CH0_Pos)                /*!< GPDMA1 STATUSSRCTRAN: CH0 Mask          */
#define GPDMA1_STATUSSRCTRAN_CH1_Pos          1                                                       /*!< GPDMA1 STATUSSRCTRAN: CH1 Position      */
#define GPDMA1_STATUSSRCTRAN_CH1_Msk          (0x01UL << GPDMA1_STATUSSRCTRAN_CH1_Pos)                /*!< GPDMA1 STATUSSRCTRAN: CH1 Mask          */
#define GPDMA1_STATUSSRCTRAN_CH2_Pos          2                                                       /*!< GPDMA1 STATUSSRCTRAN: CH2 Position      */
#define GPDMA1_STATUSSRCTRAN_CH2_Msk          (0x01UL << GPDMA1_STATUSSRCTRAN_CH2_Pos)                /*!< GPDMA1 STATUSSRCTRAN: CH2 Mask          */
#define GPDMA1_STATUSSRCTRAN_CH3_Pos          3                                                       /*!< GPDMA1 STATUSSRCTRAN: CH3 Position      */
#define GPDMA1_STATUSSRCTRAN_CH3_Msk          (0x01UL << GPDMA1_STATUSSRCTRAN_CH3_Pos)                /*!< GPDMA1 STATUSSRCTRAN: CH3 Mask          */

/* ----------------------------  GPDMA1_STATUSDSTTRAN  ---------------------------- */
#define GPDMA1_STATUSDSTTRAN_CH0_Pos          0                                                       /*!< GPDMA1 STATUSDSTTRAN: CH0 Position      */
#define GPDMA1_STATUSDSTTRAN_CH0_Msk          (0x01UL << GPDMA1_STATUSDSTTRAN_CH0_Pos)                /*!< GPDMA1 STATUSDSTTRAN: CH0 Mask          */
#define GPDMA1_STATUSDSTTRAN_CH1_Pos          1                                                       /*!< GPDMA1 STATUSDSTTRAN: CH1 Position      */
#define GPDMA1_STATUSDSTTRAN_CH1_Msk          (0x01UL << GPDMA1_STATUSDSTTRAN_CH1_Pos)                /*!< GPDMA1 STATUSDSTTRAN: CH1 Mask          */
#define GPDMA1_STATUSDSTTRAN_CH2_Pos          2                                                       /*!< GPDMA1 STATUSDSTTRAN: CH2 Position      */
#define GPDMA1_STATUSDSTTRAN_CH2_Msk          (0x01UL << GPDMA1_STATUSDSTTRAN_CH2_Pos)                /*!< GPDMA1 STATUSDSTTRAN: CH2 Mask          */
#define GPDMA1_STATUSDSTTRAN_CH3_Pos          3                                                       /*!< GPDMA1 STATUSDSTTRAN: CH3 Position      */
#define GPDMA1_STATUSDSTTRAN_CH3_Msk          (0x01UL << GPDMA1_STATUSDSTTRAN_CH3_Pos)                /*!< GPDMA1 STATUSDSTTRAN: CH3 Mask          */

/* ------------------------------  GPDMA1_STATUSERR  ------------------------------ */
#define GPDMA1_STATUSERR_CH0_Pos              0                                                       /*!< GPDMA1 STATUSERR: CH0 Position          */
#define GPDMA1_STATUSERR_CH0_Msk              (0x01UL << GPDMA1_STATUSERR_CH0_Pos)                    /*!< GPDMA1 STATUSERR: CH0 Mask              */
#define GPDMA1_STATUSERR_CH1_Pos              1                                                       /*!< GPDMA1 STATUSERR: CH1 Position          */
#define GPDMA1_STATUSERR_CH1_Msk              (0x01UL << GPDMA1_STATUSERR_CH1_Pos)                    /*!< GPDMA1 STATUSERR: CH1 Mask              */
#define GPDMA1_STATUSERR_CH2_Pos              2                                                       /*!< GPDMA1 STATUSERR: CH2 Position          */
#define GPDMA1_STATUSERR_CH2_Msk              (0x01UL << GPDMA1_STATUSERR_CH2_Pos)                    /*!< GPDMA1 STATUSERR: CH2 Mask              */
#define GPDMA1_STATUSERR_CH3_Pos              3                                                       /*!< GPDMA1 STATUSERR: CH3 Position          */
#define GPDMA1_STATUSERR_CH3_Msk              (0x01UL << GPDMA1_STATUSERR_CH3_Pos)                    /*!< GPDMA1 STATUSERR: CH3 Mask              */

/* -------------------------------  GPDMA1_MASKTFR  ------------------------------- */
#define GPDMA1_MASKTFR_CH0_Pos                0                                                       /*!< GPDMA1 MASKTFR: CH0 Position            */
#define GPDMA1_MASKTFR_CH0_Msk                (0x01UL << GPDMA1_MASKTFR_CH0_Pos)                      /*!< GPDMA1 MASKTFR: CH0 Mask                */
#define GPDMA1_MASKTFR_CH1_Pos                1                                                       /*!< GPDMA1 MASKTFR: CH1 Position            */
#define GPDMA1_MASKTFR_CH1_Msk                (0x01UL << GPDMA1_MASKTFR_CH1_Pos)                      /*!< GPDMA1 MASKTFR: CH1 Mask                */
#define GPDMA1_MASKTFR_CH2_Pos                2                                                       /*!< GPDMA1 MASKTFR: CH2 Position            */
#define GPDMA1_MASKTFR_CH2_Msk                (0x01UL << GPDMA1_MASKTFR_CH2_Pos)                      /*!< GPDMA1 MASKTFR: CH2 Mask                */
#define GPDMA1_MASKTFR_CH3_Pos                3                                                       /*!< GPDMA1 MASKTFR: CH3 Position            */
#define GPDMA1_MASKTFR_CH3_Msk                (0x01UL << GPDMA1_MASKTFR_CH3_Pos)                      /*!< GPDMA1 MASKTFR: CH3 Mask                */
#define GPDMA1_MASKTFR_WE_CH0_Pos             8                                                       /*!< GPDMA1 MASKTFR: WE_CH0 Position         */
#define GPDMA1_MASKTFR_WE_CH0_Msk             (0x01UL << GPDMA1_MASKTFR_WE_CH0_Pos)                   /*!< GPDMA1 MASKTFR: WE_CH0 Mask             */
#define GPDMA1_MASKTFR_WE_CH1_Pos             9                                                       /*!< GPDMA1 MASKTFR: WE_CH1 Position         */
#define GPDMA1_MASKTFR_WE_CH1_Msk             (0x01UL << GPDMA1_MASKTFR_WE_CH1_Pos)                   /*!< GPDMA1 MASKTFR: WE_CH1 Mask             */
#define GPDMA1_MASKTFR_WE_CH2_Pos             10                                                      /*!< GPDMA1 MASKTFR: WE_CH2 Position         */
#define GPDMA1_MASKTFR_WE_CH2_Msk             (0x01UL << GPDMA1_MASKTFR_WE_CH2_Pos)                   /*!< GPDMA1 MASKTFR: WE_CH2 Mask             */
#define GPDMA1_MASKTFR_WE_CH3_Pos             11                                                      /*!< GPDMA1 MASKTFR: WE_CH3 Position         */
#define GPDMA1_MASKTFR_WE_CH3_Msk             (0x01UL << GPDMA1_MASKTFR_WE_CH3_Pos)                   /*!< GPDMA1 MASKTFR: WE_CH3 Mask             */

/* ------------------------------  GPDMA1_MASKBLOCK  ------------------------------ */
#define GPDMA1_MASKBLOCK_CH0_Pos              0                                                       /*!< GPDMA1 MASKBLOCK: CH0 Position          */
#define GPDMA1_MASKBLOCK_CH0_Msk              (0x01UL << GPDMA1_MASKBLOCK_CH0_Pos)                    /*!< GPDMA1 MASKBLOCK: CH0 Mask              */
#define GPDMA1_MASKBLOCK_CH1_Pos              1                                                       /*!< GPDMA1 MASKBLOCK: CH1 Position          */
#define GPDMA1_MASKBLOCK_CH1_Msk              (0x01UL << GPDMA1_MASKBLOCK_CH1_Pos)                    /*!< GPDMA1 MASKBLOCK: CH1 Mask              */
#define GPDMA1_MASKBLOCK_CH2_Pos              2                                                       /*!< GPDMA1 MASKBLOCK: CH2 Position          */
#define GPDMA1_MASKBLOCK_CH2_Msk              (0x01UL << GPDMA1_MASKBLOCK_CH2_Pos)                    /*!< GPDMA1 MASKBLOCK: CH2 Mask              */
#define GPDMA1_MASKBLOCK_CH3_Pos              3                                                       /*!< GPDMA1 MASKBLOCK: CH3 Position          */
#define GPDMA1_MASKBLOCK_CH3_Msk              (0x01UL << GPDMA1_MASKBLOCK_CH3_Pos)                    /*!< GPDMA1 MASKBLOCK: CH3 Mask              */
#define GPDMA1_MASKBLOCK_WE_CH0_Pos           8                                                       /*!< GPDMA1 MASKBLOCK: WE_CH0 Position       */
#define GPDMA1_MASKBLOCK_WE_CH0_Msk           (0x01UL << GPDMA1_MASKBLOCK_WE_CH0_Pos)                 /*!< GPDMA1 MASKBLOCK: WE_CH0 Mask           */
#define GPDMA1_MASKBLOCK_WE_CH1_Pos           9                                                       /*!< GPDMA1 MASKBLOCK: WE_CH1 Position       */
#define GPDMA1_MASKBLOCK_WE_CH1_Msk           (0x01UL << GPDMA1_MASKBLOCK_WE_CH1_Pos)                 /*!< GPDMA1 MASKBLOCK: WE_CH1 Mask           */
#define GPDMA1_MASKBLOCK_WE_CH2_Pos           10                                                      /*!< GPDMA1 MASKBLOCK: WE_CH2 Position       */
#define GPDMA1_MASKBLOCK_WE_CH2_Msk           (0x01UL << GPDMA1_MASKBLOCK_WE_CH2_Pos)                 /*!< GPDMA1 MASKBLOCK: WE_CH2 Mask           */
#define GPDMA1_MASKBLOCK_WE_CH3_Pos           11                                                      /*!< GPDMA1 MASKBLOCK: WE_CH3 Position       */
#define GPDMA1_MASKBLOCK_WE_CH3_Msk           (0x01UL << GPDMA1_MASKBLOCK_WE_CH3_Pos)                 /*!< GPDMA1 MASKBLOCK: WE_CH3 Mask           */

/* -----------------------------  GPDMA1_MASKSRCTRAN  ----------------------------- */
#define GPDMA1_MASKSRCTRAN_CH0_Pos            0                                                       /*!< GPDMA1 MASKSRCTRAN: CH0 Position        */
#define GPDMA1_MASKSRCTRAN_CH0_Msk            (0x01UL << GPDMA1_MASKSRCTRAN_CH0_Pos)                  /*!< GPDMA1 MASKSRCTRAN: CH0 Mask            */
#define GPDMA1_MASKSRCTRAN_CH1_Pos            1                                                       /*!< GPDMA1 MASKSRCTRAN: CH1 Position        */
#define GPDMA1_MASKSRCTRAN_CH1_Msk            (0x01UL << GPDMA1_MASKSRCTRAN_CH1_Pos)                  /*!< GPDMA1 MASKSRCTRAN: CH1 Mask            */
#define GPDMA1_MASKSRCTRAN_CH2_Pos            2                                                       /*!< GPDMA1 MASKSRCTRAN: CH2 Position        */
#define GPDMA1_MASKSRCTRAN_CH2_Msk            (0x01UL << GPDMA1_MASKSRCTRAN_CH2_Pos)                  /*!< GPDMA1 MASKSRCTRAN: CH2 Mask            */
#define GPDMA1_MASKSRCTRAN_CH3_Pos            3                                                       /*!< GPDMA1 MASKSRCTRAN: CH3 Position        */
#define GPDMA1_MASKSRCTRAN_CH3_Msk            (0x01UL << GPDMA1_MASKSRCTRAN_CH3_Pos)                  /*!< GPDMA1 MASKSRCTRAN: CH3 Mask            */
#define GPDMA1_MASKSRCTRAN_WE_CH0_Pos         8                                                       /*!< GPDMA1 MASKSRCTRAN: WE_CH0 Position     */
#define GPDMA1_MASKSRCTRAN_WE_CH0_Msk         (0x01UL << GPDMA1_MASKSRCTRAN_WE_CH0_Pos)               /*!< GPDMA1 MASKSRCTRAN: WE_CH0 Mask         */
#define GPDMA1_MASKSRCTRAN_WE_CH1_Pos         9                                                       /*!< GPDMA1 MASKSRCTRAN: WE_CH1 Position     */
#define GPDMA1_MASKSRCTRAN_WE_CH1_Msk         (0x01UL << GPDMA1_MASKSRCTRAN_WE_CH1_Pos)               /*!< GPDMA1 MASKSRCTRAN: WE_CH1 Mask         */
#define GPDMA1_MASKSRCTRAN_WE_CH2_Pos         10                                                      /*!< GPDMA1 MASKSRCTRAN: WE_CH2 Position     */
#define GPDMA1_MASKSRCTRAN_WE_CH2_Msk         (0x01UL << GPDMA1_MASKSRCTRAN_WE_CH2_Pos)               /*!< GPDMA1 MASKSRCTRAN: WE_CH2 Mask         */
#define GPDMA1_MASKSRCTRAN_WE_CH3_Pos         11                                                      /*!< GPDMA1 MASKSRCTRAN: WE_CH3 Position     */
#define GPDMA1_MASKSRCTRAN_WE_CH3_Msk         (0x01UL << GPDMA1_MASKSRCTRAN_WE_CH3_Pos)               /*!< GPDMA1 MASKSRCTRAN: WE_CH3 Mask         */

/* -----------------------------  GPDMA1_MASKDSTTRAN  ----------------------------- */
#define GPDMA1_MASKDSTTRAN_CH0_Pos            0                                                       /*!< GPDMA1 MASKDSTTRAN: CH0 Position        */
#define GPDMA1_MASKDSTTRAN_CH0_Msk            (0x01UL << GPDMA1_MASKDSTTRAN_CH0_Pos)                  /*!< GPDMA1 MASKDSTTRAN: CH0 Mask            */
#define GPDMA1_MASKDSTTRAN_CH1_Pos            1                                                       /*!< GPDMA1 MASKDSTTRAN: CH1 Position        */
#define GPDMA1_MASKDSTTRAN_CH1_Msk            (0x01UL << GPDMA1_MASKDSTTRAN_CH1_Pos)                  /*!< GPDMA1 MASKDSTTRAN: CH1 Mask            */
#define GPDMA1_MASKDSTTRAN_CH2_Pos            2                                                       /*!< GPDMA1 MASKDSTTRAN: CH2 Position        */
#define GPDMA1_MASKDSTTRAN_CH2_Msk            (0x01UL << GPDMA1_MASKDSTTRAN_CH2_Pos)                  /*!< GPDMA1 MASKDSTTRAN: CH2 Mask            */
#define GPDMA1_MASKDSTTRAN_CH3_Pos            3                                                       /*!< GPDMA1 MASKDSTTRAN: CH3 Position        */
#define GPDMA1_MASKDSTTRAN_CH3_Msk            (0x01UL << GPDMA1_MASKDSTTRAN_CH3_Pos)                  /*!< GPDMA1 MASKDSTTRAN: CH3 Mask            */
#define GPDMA1_MASKDSTTRAN_WE_CH0_Pos         8                                                       /*!< GPDMA1 MASKDSTTRAN: WE_CH0 Position     */
#define GPDMA1_MASKDSTTRAN_WE_CH0_Msk         (0x01UL << GPDMA1_MASKDSTTRAN_WE_CH0_Pos)               /*!< GPDMA1 MASKDSTTRAN: WE_CH0 Mask         */
#define GPDMA1_MASKDSTTRAN_WE_CH1_Pos         9                                                       /*!< GPDMA1 MASKDSTTRAN: WE_CH1 Position     */
#define GPDMA1_MASKDSTTRAN_WE_CH1_Msk         (0x01UL << GPDMA1_MASKDSTTRAN_WE_CH1_Pos)               /*!< GPDMA1 MASKDSTTRAN: WE_CH1 Mask         */
#define GPDMA1_MASKDSTTRAN_WE_CH2_Pos         10                                                      /*!< GPDMA1 MASKDSTTRAN: WE_CH2 Position     */
#define GPDMA1_MASKDSTTRAN_WE_CH2_Msk         (0x01UL << GPDMA1_MASKDSTTRAN_WE_CH2_Pos)               /*!< GPDMA1 MASKDSTTRAN: WE_CH2 Mask         */
#define GPDMA1_MASKDSTTRAN_WE_CH3_Pos         11                                                      /*!< GPDMA1 MASKDSTTRAN: WE_CH3 Position     */
#define GPDMA1_MASKDSTTRAN_WE_CH3_Msk         (0x01UL << GPDMA1_MASKDSTTRAN_WE_CH3_Pos)               /*!< GPDMA1 MASKDSTTRAN: WE_CH3 Mask         */

/* -------------------------------  GPDMA1_MASKERR  ------------------------------- */
#define GPDMA1_MASKERR_CH0_Pos                0                                                       /*!< GPDMA1 MASKERR: CH0 Position            */
#define GPDMA1_MASKERR_CH0_Msk                (0x01UL << GPDMA1_MASKERR_CH0_Pos)                      /*!< GPDMA1 MASKERR: CH0 Mask                */
#define GPDMA1_MASKERR_CH1_Pos                1                                                       /*!< GPDMA1 MASKERR: CH1 Position            */
#define GPDMA1_MASKERR_CH1_Msk                (0x01UL << GPDMA1_MASKERR_CH1_Pos)                      /*!< GPDMA1 MASKERR: CH1 Mask                */
#define GPDMA1_MASKERR_CH2_Pos                2                                                       /*!< GPDMA1 MASKERR: CH2 Position            */
#define GPDMA1_MASKERR_CH2_Msk                (0x01UL << GPDMA1_MASKERR_CH2_Pos)                      /*!< GPDMA1 MASKERR: CH2 Mask                */
#define GPDMA1_MASKERR_CH3_Pos                3                                                       /*!< GPDMA1 MASKERR: CH3 Position            */
#define GPDMA1_MASKERR_CH3_Msk                (0x01UL << GPDMA1_MASKERR_CH3_Pos)                      /*!< GPDMA1 MASKERR: CH3 Mask                */
#define GPDMA1_MASKERR_WE_CH0_Pos             8                                                       /*!< GPDMA1 MASKERR: WE_CH0 Position         */
#define GPDMA1_MASKERR_WE_CH0_Msk             (0x01UL << GPDMA1_MASKERR_WE_CH0_Pos)                   /*!< GPDMA1 MASKERR: WE_CH0 Mask             */
#define GPDMA1_MASKERR_WE_CH1_Pos             9                                                       /*!< GPDMA1 MASKERR: WE_CH1 Position         */
#define GPDMA1_MASKERR_WE_CH1_Msk             (0x01UL << GPDMA1_MASKERR_WE_CH1_Pos)                   /*!< GPDMA1 MASKERR: WE_CH1 Mask             */
#define GPDMA1_MASKERR_WE_CH2_Pos             10                                                      /*!< GPDMA1 MASKERR: WE_CH2 Position         */
#define GPDMA1_MASKERR_WE_CH2_Msk             (0x01UL << GPDMA1_MASKERR_WE_CH2_Pos)                   /*!< GPDMA1 MASKERR: WE_CH2 Mask             */
#define GPDMA1_MASKERR_WE_CH3_Pos             11                                                      /*!< GPDMA1 MASKERR: WE_CH3 Position         */
#define GPDMA1_MASKERR_WE_CH3_Msk             (0x01UL << GPDMA1_MASKERR_WE_CH3_Pos)                   /*!< GPDMA1 MASKERR: WE_CH3 Mask             */

/* -------------------------------  GPDMA1_CLEARTFR  ------------------------------ */
#define GPDMA1_CLEARTFR_CH0_Pos               0                                                       /*!< GPDMA1 CLEARTFR: CH0 Position           */
#define GPDMA1_CLEARTFR_CH0_Msk               (0x01UL << GPDMA1_CLEARTFR_CH0_Pos)                     /*!< GPDMA1 CLEARTFR: CH0 Mask               */
#define GPDMA1_CLEARTFR_CH1_Pos               1                                                       /*!< GPDMA1 CLEARTFR: CH1 Position           */
#define GPDMA1_CLEARTFR_CH1_Msk               (0x01UL << GPDMA1_CLEARTFR_CH1_Pos)                     /*!< GPDMA1 CLEARTFR: CH1 Mask               */
#define GPDMA1_CLEARTFR_CH2_Pos               2                                                       /*!< GPDMA1 CLEARTFR: CH2 Position           */
#define GPDMA1_CLEARTFR_CH2_Msk               (0x01UL << GPDMA1_CLEARTFR_CH2_Pos)                     /*!< GPDMA1 CLEARTFR: CH2 Mask               */
#define GPDMA1_CLEARTFR_CH3_Pos               3                                                       /*!< GPDMA1 CLEARTFR: CH3 Position           */
#define GPDMA1_CLEARTFR_CH3_Msk               (0x01UL << GPDMA1_CLEARTFR_CH3_Pos)                     /*!< GPDMA1 CLEARTFR: CH3 Mask               */

