FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ------------------------------  GPDMA1_CLEARBLOCK  ----------------------------- */
#define GPDMA1_CLEARBLOCK_CH0_Pos             0                                                       /*!< GPDMA1 CLEARBLOCK: CH0 Position         */
#define GPDMA1_CLEARBLOCK_CH0_Msk             (0x01UL << GPDMA1_CLEARBLOCK_CH0_Pos)                   /*!< GPDMA1 CLEARBLOCK: CH0 Mask             */
#define GPDMA1_CLEARBLOCK_CH1_Pos             1                                                       /*!< GPDMA1 CLEARBLOCK: CH1 Position         */
#define GPDMA1_CLEARBLOCK_CH1_Msk             (0x01UL << GPDMA1_CLEARBLOCK_CH1_Pos)                   /*!< GPDMA1 CLEARBLOCK: CH1 Mask             */
#define GPDMA1_CLEARBLOCK_CH2_Pos             2                                                       /*!< GPDMA1 CLEARBLOCK: CH2 Position         */
#define GPDMA1_CLEARBLOCK_CH2_Msk             (0x01UL << GPDMA1_CLEARBLOCK_CH2_Pos)                   /*!< GPDMA1 CLEARBLOCK: CH2 Mask             */
#define GPDMA1_CLEARBLOCK_CH3_Pos             3                                                       /*!< GPDMA1 CLEARBLOCK: CH3 Position         */
#define GPDMA1_CLEARBLOCK_CH3_Msk             (0x01UL << GPDMA1_CLEARBLOCK_CH3_Pos)                   /*!< GPDMA1 CLEARBLOCK: CH3 Mask             */

/* -----------------------------  GPDMA1_CLEARSRCTRAN  ---------------------------- */
#define GPDMA1_CLEARSRCTRAN_CH0_Pos           0                                                       /*!< GPDMA1 CLEARSRCTRAN: CH0 Position       */
#define GPDMA1_CLEARSRCTRAN_CH0_Msk           (0x01UL << GPDMA1_CLEARSRCTRAN_CH0_Pos)                 /*!< GPDMA1 CLEARSRCTRAN: CH0 Mask           */
#define GPDMA1_CLEARSRCTRAN_CH1_Pos           1                                                       /*!< GPDMA1 CLEARSRCTRAN: CH1 Position       */
#define GPDMA1_CLEARSRCTRAN_CH1_Msk           (0x01UL << GPDMA1_CLEARSRCTRAN_CH1_Pos)                 /*!< GPDMA1 CLEARSRCTRAN: CH1 Mask           */
#define GPDMA1_CLEARSRCTRAN_CH2_Pos           2                                                       /*!< GPDMA1 CLEARSRCTRAN: CH2 Position       */
#define GPDMA1_CLEARSRCTRAN_CH2_Msk           (0x01UL << GPDMA1_CLEARSRCTRAN_CH2_Pos)                 /*!< GPDMA1 CLEARSRCTRAN: CH2 Mask           */
#define GPDMA1_CLEARSRCTRAN_CH3_Pos           3                                                       /*!< GPDMA1 CLEARSRCTRAN: CH3 Position       */
#define GPDMA1_CLEARSRCTRAN_CH3_Msk           (0x01UL << GPDMA1_CLEARSRCTRAN_CH3_Pos)                 /*!< GPDMA1 CLEARSRCTRAN: CH3 Mask           */

/* -----------------------------  GPDMA1_CLEARDSTTRAN  ---------------------------- */
#define GPDMA1_CLEARDSTTRAN_CH0_Pos           0                                                       /*!< GPDMA1 CLEARDSTTRAN: CH0 Position       */
#define GPDMA1_CLEARDSTTRAN_CH0_Msk           (0x01UL << GPDMA1_CLEARDSTTRAN_CH0_Pos)                 /*!< GPDMA1 CLEARDSTTRAN: CH0 Mask           */
#define GPDMA1_CLEARDSTTRAN_CH1_Pos           1                                                       /*!< GPDMA1 CLEARDSTTRAN: CH1 Position       */
#define GPDMA1_CLEARDSTTRAN_CH1_Msk           (0x01UL << GPDMA1_CLEARDSTTRAN_CH1_Pos)                 /*!< GPDMA1 CLEARDSTTRAN: CH1 Mask           */
#define GPDMA1_CLEARDSTTRAN_CH2_Pos           2                                                       /*!< GPDMA1 CLEARDSTTRAN: CH2 Position       */
#define GPDMA1_CLEARDSTTRAN_CH2_Msk           (0x01UL << GPDMA1_CLEARDSTTRAN_CH2_Pos)                 /*!< GPDMA1 CLEARDSTTRAN: CH2 Mask           */
#define GPDMA1_CLEARDSTTRAN_CH3_Pos           3                                                       /*!< GPDMA1 CLEARDSTTRAN: CH3 Position       */
#define GPDMA1_CLEARDSTTRAN_CH3_Msk           (0x01UL << GPDMA1_CLEARDSTTRAN_CH3_Pos)                 /*!< GPDMA1 CLEARDSTTRAN: CH3 Mask           */

/* -------------------------------  GPDMA1_CLEARERR  ------------------------------ */
#define GPDMA1_CLEARERR_CH0_Pos               0                                                       /*!< GPDMA1 CLEARERR: CH0 Position           */
#define GPDMA1_CLEARERR_CH0_Msk               (0x01UL << GPDMA1_CLEARERR_CH0_Pos)                     /*!< GPDMA1 CLEARERR: CH0 Mask               */
#define GPDMA1_CLEARERR_CH1_Pos               1                                                       /*!< GPDMA1 CLEARERR: CH1 Position           */
#define GPDMA1_CLEARERR_CH1_Msk               (0x01UL << GPDMA1_CLEARERR_CH1_Pos)                     /*!< GPDMA1 CLEARERR: CH1 Mask               */
#define GPDMA1_CLEARERR_CH2_Pos               2                                                       /*!< GPDMA1 CLEARERR: CH2 Position           */
#define GPDMA1_CLEARERR_CH2_Msk               (0x01UL << GPDMA1_CLEARERR_CH2_Pos)                     /*!< GPDMA1 CLEARERR: CH2 Mask               */
#define GPDMA1_CLEARERR_CH3_Pos               3                                                       /*!< GPDMA1 CLEARERR: CH3 Position           */
#define GPDMA1_CLEARERR_CH3_Msk               (0x01UL << GPDMA1_CLEARERR_CH3_Pos)                     /*!< GPDMA1 CLEARERR: CH3 Mask               */

/* ------------------------------  GPDMA1_STATUSINT  ------------------------------ */
#define GPDMA1_STATUSINT_TFR_Pos              0                                                       /*!< GPDMA1 STATUSINT: TFR Position          */
#define GPDMA1_STATUSINT_TFR_Msk              (0x01UL << GPDMA1_STATUSINT_TFR_Pos)                    /*!< GPDMA1 STATUSINT: TFR Mask              */
#define GPDMA1_STATUSINT_BLOCK_Pos            1                                                       /*!< GPDMA1 STATUSINT: BLOCK Position        */
#define GPDMA1_STATUSINT_BLOCK_Msk            (0x01UL << GPDMA1_STATUSINT_BLOCK_Pos)                  /*!< GPDMA1 STATUSINT: BLOCK Mask            */
#define GPDMA1_STATUSINT_SRCT_Pos             2                                                       /*!< GPDMA1 STATUSINT: SRCT Position         */
#define GPDMA1_STATUSINT_SRCT_Msk             (0x01UL << GPDMA1_STATUSINT_SRCT_Pos)                   /*!< GPDMA1 STATUSINT: SRCT Mask             */
#define GPDMA1_STATUSINT_DSTT_Pos             3                                                       /*!< GPDMA1 STATUSINT: DSTT Position         */
#define GPDMA1_STATUSINT_DSTT_Msk             (0x01UL << GPDMA1_STATUSINT_DSTT_Pos)                   /*!< GPDMA1 STATUSINT: DSTT Mask             */
#define GPDMA1_STATUSINT_ERR_Pos              4                                                       /*!< GPDMA1 STATUSINT: ERR Position          */
#define GPDMA1_STATUSINT_ERR_Msk              (0x01UL << GPDMA1_STATUSINT_ERR_Pos)                    /*!< GPDMA1 STATUSINT: ERR Mask              */

/* ------------------------------  GPDMA1_REQSRCREG  ------------------------------ */
#define GPDMA1_REQSRCREG_CH0_Pos              0                                                       /*!< GPDMA1 REQSRCREG: CH0 Position          */
#define GPDMA1_REQSRCREG_CH0_Msk              (0x01UL << GPDMA1_REQSRCREG_CH0_Pos)                    /*!< GPDMA1 REQSRCREG: CH0 Mask              */
#define GPDMA1_REQSRCREG_CH1_Pos              1                                                       /*!< GPDMA1 REQSRCREG: CH1 Position          */
#define GPDMA1_REQSRCREG_CH1_Msk              (0x01UL << GPDMA1_REQSRCREG_CH1_Pos)                    /*!< GPDMA1 REQSRCREG: CH1 Mask              */
#define GPDMA1_REQSRCREG_CH2_Pos              2                                                       /*!< GPDMA1 REQSRCREG: CH2 Position          */
#define GPDMA1_REQSRCREG_CH2_Msk              (0x01UL << GPDMA1_REQSRCREG_CH2_Pos)                    /*!< GPDMA1 REQSRCREG: CH2 Mask              */
#define GPDMA1_REQSRCREG_CH3_Pos              3                                                       /*!< GPDMA1 REQSRCREG: CH3 Position          */
#define GPDMA1_REQSRCREG_CH3_Msk              (0x01UL << GPDMA1_REQSRCREG_CH3_Pos)                    /*!< GPDMA1 REQSRCREG: CH3 Mask              */
#define GPDMA1_REQSRCREG_WE_CH0_Pos           8                                                       /*!< GPDMA1 REQSRCREG: WE_CH0 Position       */
#define GPDMA1_REQSRCREG_WE_CH0_Msk           (0x01UL << GPDMA1_REQSRCREG_WE_CH0_Pos)                 /*!< GPDMA1 REQSRCREG: WE_CH0 Mask           */
#define GPDMA1_REQSRCREG_WE_CH1_Pos           9                                                       /*!< GPDMA1 REQSRCREG: WE_CH1 Position       */
#define GPDMA1_REQSRCREG_WE_CH1_Msk           (0x01UL << GPDMA1_REQSRCREG_WE_CH1_Pos)                 /*!< GPDMA1 REQSRCREG: WE_CH1 Mask           */
#define GPDMA1_REQSRCREG_WE_CH2_Pos           10                                                      /*!< GPDMA1 REQSRCREG: WE_CH2 Position       */
#define GPDMA1_REQSRCREG_WE_CH2_Msk           (0x01UL << GPDMA1_REQSRCREG_WE_CH2_Pos)                 /*!< GPDMA1 REQSRCREG: WE_CH2 Mask           */
#define GPDMA1_REQSRCREG_WE_CH3_Pos           11                                                      /*!< GPDMA1 REQSRCREG: WE_CH3 Position       */
#define GPDMA1_REQSRCREG_WE_CH3_Msk           (0x01UL << GPDMA1_REQSRCREG_WE_CH3_Pos)                 /*!< GPDMA1 REQSRCREG: WE_CH3 Mask           */

