FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ------------------------------  GPDMA1_REQDSTREG  ------------------------------ */
#define GPDMA1_REQDSTREG_CH0_Pos              0                                                       /*!< GPDMA1 REQDSTREG: CH0 Position          */
#define GPDMA1_REQDSTREG_CH0_Msk              (0x01UL << GPDMA1_REQDSTREG_CH0_Pos)                    /*!< GPDMA1 REQDSTREG: CH0 Mask              */
#define GPDMA1_REQDSTREG_CH1_Pos              1                                                       /*!< GPDMA1 REQDSTREG: CH1 Position          */
#define GPDMA1_REQDSTREG_CH1_Msk              (0x01UL << GPDMA1_REQDSTREG_CH1_Pos)                    /*!< GPDMA1 REQDSTREG: CH1 Mask              */
#define GPDMA1_REQDSTREG_CH2_Pos              2                                                       /*!< GPDMA1 REQDSTREG: CH2 Position          */
#define GPDMA1_REQDSTREG_CH2_Msk              (0x01UL << GPDMA1_REQDSTREG_CH2_Pos)                    /*!< GPDMA1 REQDSTREG: CH2 Mask              */
#define GPDMA1_REQDSTREG_CH3_Pos              3                                                       /*!< GPDMA1 REQDSTREG: CH3 Position          */
#define GPDMA1_REQDSTREG_CH3_Msk              (0x01UL << GPDMA1_REQDSTREG_CH3_Pos)                    /*!< GPDMA1 REQDSTREG: CH3 Mask              */
#define GPDMA1_REQDSTREG_WE_CH0_Pos           8                                                       /*!< GPDMA1 REQDSTREG: WE_CH0 Position       */
#define GPDMA1_REQDSTREG_WE_CH0_Msk           (0x01UL << GPDMA1_REQDSTREG_WE_CH0_Pos)                 /*!< GPDMA1 REQDSTREG: WE_CH0 Mask           */
#define GPDMA1_REQDSTREG_WE_CH1_Pos           9                                                       /*!< GPDMA1 REQDSTREG: WE_CH1 Position       */
#define GPDMA1_REQDSTREG_WE_CH1_Msk           (0x01UL << GPDMA1_REQDSTREG_WE_CH1_Pos)                 /*!< GPDMA1 REQDSTREG: WE_CH1 Mask           */
#define GPDMA1_REQDSTREG_WE_CH2_Pos           10                                                      /*!< GPDMA1 REQDSTREG: WE_CH2 Position       */
#define GPDMA1_REQDSTREG_WE_CH2_Msk           (0x01UL << GPDMA1_REQDSTREG_WE_CH2_Pos)                 /*!< GPDMA1 REQDSTREG: WE_CH2 Mask           */
#define GPDMA1_REQDSTREG_WE_CH3_Pos           11                                                      /*!< GPDMA1 REQDSTREG: WE_CH3 Position       */
#define GPDMA1_REQDSTREG_WE_CH3_Msk           (0x01UL << GPDMA1_REQDSTREG_WE_CH3_Pos)                 /*!< GPDMA1 REQDSTREG: WE_CH3 Mask           */

/* -----------------------------  GPDMA1_SGLREQSRCREG  ---------------------------- */
#define GPDMA1_SGLREQSRCREG_CH0_Pos           0                                                       /*!< GPDMA1 SGLREQSRCREG: CH0 Position       */
#define GPDMA1_SGLREQSRCREG_CH0_Msk           (0x01UL << GPDMA1_SGLREQSRCREG_CH0_Pos)                 /*!< GPDMA1 SGLREQSRCREG: CH0 Mask           */
#define GPDMA1_SGLREQSRCREG_CH1_Pos           1                                                       /*!< GPDMA1 SGLREQSRCREG: CH1 Position       */
#define GPDMA1_SGLREQSRCREG_CH1_Msk           (0x01UL << GPDMA1_SGLREQSRCREG_CH1_Pos)                 /*!< GPDMA1 SGLREQSRCREG: CH1 Mask           */
#define GPDMA1_SGLREQSRCREG_CH2_Pos           2                                                       /*!< GPDMA1 SGLREQSRCREG: CH2 Position       */
#define GPDMA1_SGLREQSRCREG_CH2_Msk           (0x01UL << GPDMA1_SGLREQSRCREG_CH2_Pos)                 /*!< GPDMA1 SGLREQSRCREG: CH2 Mask           */
#define GPDMA1_SGLREQSRCREG_CH3_Pos           3                                                       /*!< GPDMA1 SGLREQSRCREG: CH3 Position       */
#define GPDMA1_SGLREQSRCREG_CH3_Msk           (0x01UL << GPDMA1_SGLREQSRCREG_CH3_Pos)                 /*!< GPDMA1 SGLREQSRCREG: CH3 Mask           */
#define GPDMA1_SGLREQSRCREG_WE_CH0_Pos        8                                                       /*!< GPDMA1 SGLREQSRCREG: WE_CH0 Position    */
#define GPDMA1_SGLREQSRCREG_WE_CH0_Msk        (0x01UL << GPDMA1_SGLREQSRCREG_WE_CH0_Pos)              /*!< GPDMA1 SGLREQSRCREG: WE_CH0 Mask        */
#define GPDMA1_SGLREQSRCREG_WE_CH1_Pos        9                                                       /*!< GPDMA1 SGLREQSRCREG: WE_CH1 Position    */
#define GPDMA1_SGLREQSRCREG_WE_CH1_Msk        (0x01UL << GPDMA1_SGLREQSRCREG_WE_CH1_Pos)              /*!< GPDMA1 SGLREQSRCREG: WE_CH1 Mask        */
#define GPDMA1_SGLREQSRCREG_WE_CH2_Pos        10                                                      /*!< GPDMA1 SGLREQSRCREG: WE_CH2 Position    */
#define GPDMA1_SGLREQSRCREG_WE_CH2_Msk        (0x01UL << GPDMA1_SGLREQSRCREG_WE_CH2_Pos)              /*!< GPDMA1 SGLREQSRCREG: WE_CH2 Mask        */
#define GPDMA1_SGLREQSRCREG_WE_CH3_Pos        11                                                      /*!< GPDMA1 SGLREQSRCREG: WE_CH3 Position    */
#define GPDMA1_SGLREQSRCREG_WE_CH3_Msk        (0x01UL << GPDMA1_SGLREQSRCREG_WE_CH3_Pos)              /*!< GPDMA1 SGLREQSRCREG: WE_CH3 Mask        */

/* -----------------------------  GPDMA1_SGLREQDSTREG  ---------------------------- */
#define GPDMA1_SGLREQDSTREG_CH0_Pos           0                                                       /*!< GPDMA1 SGLREQDSTREG: CH0 Position       */
#define GPDMA1_SGLREQDSTREG_CH0_Msk           (0x01UL << GPDMA1_SGLREQDSTREG_CH0_Pos)                 /*!< GPDMA1 SGLREQDSTREG: CH0 Mask           */
#define GPDMA1_SGLREQDSTREG_CH1_Pos           1                                                       /*!< GPDMA1 SGLREQDSTREG: CH1 Position       */
#define GPDMA1_SGLREQDSTREG_CH1_Msk           (0x01UL << GPDMA1_SGLREQDSTREG_CH1_Pos)                 /*!< GPDMA1 SGLREQDSTREG: CH1 Mask           */
#define GPDMA1_SGLREQDSTREG_CH2_Pos           2                                                       /*!< GPDMA1 SGLREQDSTREG: CH2 Position       */
#define GPDMA1_SGLREQDSTREG_CH2_Msk           (0x01UL << GPDMA1_SGLREQDSTREG_CH2_Pos)                 /*!< GPDMA1 SGLREQDSTREG: CH2 Mask           */
#define GPDMA1_SGLREQDSTREG_CH3_Pos           3                                                       /*!< GPDMA1 SGLREQDSTREG: CH3 Position       */
#define GPDMA1_SGLREQDSTREG_CH3_Msk           (0x01UL << GPDMA1_SGLREQDSTREG_CH3_Pos)                 /*!< GPDMA1 SGLREQDSTREG: CH3 Mask           */
#define GPDMA1_SGLREQDSTREG_WE_CH0_Pos        8                                                       /*!< GPDMA1 SGLREQDSTREG: WE_CH0 Position    */
#define GPDMA1_SGLREQDSTREG_WE_CH0_Msk        (0x01UL << GPDMA1_SGLREQDSTREG_WE_CH0_Pos)              /*!< GPDMA1 SGLREQDSTREG: WE_CH0 Mask        */
#define GPDMA1_SGLREQDSTREG_WE_CH1_Pos        9                                                       /*!< GPDMA1 SGLREQDSTREG: WE_CH1 Position    */
#define GPDMA1_SGLREQDSTREG_WE_CH1_Msk        (0x01UL << GPDMA1_SGLREQDSTREG_WE_CH1_Pos)              /*!< GPDMA1 SGLREQDSTREG: WE_CH1 Mask        */
#define GPDMA1_SGLREQDSTREG_WE_CH2_Pos        10                                                      /*!< GPDMA1 SGLREQDSTREG: WE_CH2 Position    */
#define GPDMA1_SGLREQDSTREG_WE_CH2_Msk        (0x01UL << GPDMA1_SGLREQDSTREG_WE_CH2_Pos)              /*!< GPDMA1 SGLREQDSTREG: WE_CH2 Mask        */
#define GPDMA1_SGLREQDSTREG_WE_CH3_Pos        11                                                      /*!< GPDMA1 SGLREQDSTREG: WE_CH3 Position    */
#define GPDMA1_SGLREQDSTREG_WE_CH3_Msk        (0x01UL << GPDMA1_SGLREQDSTREG_WE_CH3_Pos)              /*!< GPDMA1 SGLREQDSTREG: WE_CH3 Mask        */

/* ------------------------------  GPDMA1_LSTSRCREG  ------------------------------ */
#define GPDMA1_LSTSRCREG_CH0_Pos              0                                                       /*!< GPDMA1 LSTSRCREG: CH0 Position          */
#define GPDMA1_LSTSRCREG_CH0_Msk              (0x01UL << GPDMA1_LSTSRCREG_CH0_Pos)                    /*!< GPDMA1 LSTSRCREG: CH0 Mask              */
#define GPDMA1_LSTSRCREG_CH1_Pos              1                                                       /*!< GPDMA1 LSTSRCREG: CH1 Position          */
#define GPDMA1_LSTSRCREG_CH1_Msk              (0x01UL << GPDMA1_LSTSRCREG_CH1_Pos)                    /*!< GPDMA1 LSTSRCREG: CH1 Mask              */
#define GPDMA1_LSTSRCREG_CH2_Pos              2                                                       /*!< GPDMA1 LSTSRCREG: CH2 Position          */
#define GPDMA1_LSTSRCREG_CH2_Msk              (0x01UL << GPDMA1_LSTSRCREG_CH2_Pos)                    /*!< GPDMA1 LSTSRCREG: CH2 Mask              */
#define GPDMA1_LSTSRCREG_CH3_Pos              3                                                       /*!< GPDMA1 LSTSRCREG: CH3 Position          */
#define GPDMA1_LSTSRCREG_CH3_Msk              (0x01UL << GPDMA1_LSTSRCREG_CH3_Pos)                    /*!< GPDMA1 LSTSRCREG: CH3 Mask              */
#define GPDMA1_LSTSRCREG_WE_CH0_Pos           8                                                       /*!< GPDMA1 LSTSRCREG: WE_CH0 Position       */
#define GPDMA1_LSTSRCREG_WE_CH0_Msk           (0x01UL << GPDMA1_LSTSRCREG_WE_CH0_Pos)                 /*!< GPDMA1 LSTSRCREG: WE_CH0 Mask           */
#define GPDMA1_LSTSRCREG_WE_CH1_Pos           9                                                       /*!< GPDMA1 LSTSRCREG: WE_CH1 Position       */
#define GPDMA1_LSTSRCREG_WE_CH1_Msk           (0x01UL << GPDMA1_LSTSRCREG_WE_CH1_Pos)                 /*!< GPDMA1 LSTSRCREG: WE_CH1 Mask           */
#define GPDMA1_LSTSRCREG_WE_CH2_Pos           10                                                      /*!< GPDMA1 LSTSRCREG: WE_CH2 Position       */
#define GPDMA1_LSTSRCREG_WE_CH2_Msk           (0x01UL << GPDMA1_LSTSRCREG_WE_CH2_Pos)                 /*!< GPDMA1 LSTSRCREG: WE_CH2 Mask           */
#define GPDMA1_LSTSRCREG_WE_CH3_Pos           11                                                      /*!< GPDMA1 LSTSRCREG: WE_CH3 Position       */
#define GPDMA1_LSTSRCREG_WE_CH3_Msk           (0x01UL << GPDMA1_LSTSRCREG_WE_CH3_Pos)                 /*!< GPDMA1 LSTSRCREG: WE_CH3 Mask           */

/* ------------------------------  GPDMA1_LSTDSTREG  ------------------------------ */
#define GPDMA1_LSTDSTREG_CH0_Pos              0                                                       /*!< GPDMA1 LSTDSTREG: CH0 Position          */
#define GPDMA1_LSTDSTREG_CH0_Msk              (0x01UL << GPDMA1_LSTDSTREG_CH0_Pos)                    /*!< GPDMA1 LSTDSTREG: CH0 Mask              */
#define GPDMA1_LSTDSTREG_CH1_Pos              1                                                       /*!< GPDMA1 LSTDSTREG: CH1 Position          */
#define GPDMA1_LSTDSTREG_CH1_Msk              (0x01UL << GPDMA1_LSTDSTREG_CH1_Pos)                    /*!< GPDMA1 LSTDSTREG: CH1 Mask              */
#define GPDMA1_LSTDSTREG_CH2_Pos              2                                                       /*!< GPDMA1 LSTDSTREG: CH2 Position          */
#define GPDMA1_LSTDSTREG_CH2_Msk              (0x01UL << GPDMA1_LSTDSTREG_CH2_Pos)                    /*!< GPDMA1 LSTDSTREG: CH2 Mask              */
#define GPDMA1_LSTDSTREG_CH3_Pos              3                                                       /*!< GPDMA1 LSTDSTREG: CH3 Position          */
#define GPDMA1_LSTDSTREG_CH3_Msk              (0x01UL << GPDMA1_LSTDSTREG_CH3_Pos)                    /*!< GPDMA1 LSTDSTREG: CH3 Mask              */
#define GPDMA1_LSTDSTREG_WE_CH0_Pos           8                                                       /*!< GPDMA1 LSTDSTREG: WE_CH0 Position       */
#define GPDMA1_LSTDSTREG_WE_CH0_Msk           (0x01UL << GPDMA1_LSTDSTREG_WE_CH0_Pos)                 /*!< GPDMA1 LSTDSTREG: WE_CH0 Mask           */
#define GPDMA1_LSTDSTREG_WE_CH1_Pos           9                                                       /*!< GPDMA1 LSTDSTREG: WE_CH1 Position       */
#define GPDMA1_LSTDSTREG_WE_CH1_Msk           (0x01UL << GPDMA1_LSTDSTREG_WE_CH1_Pos)                 /*!< GPDMA1 LSTDSTREG: WE_CH1 Mask           */
#define GPDMA1_LSTDSTREG_WE_CH2_Pos           10                                                      /*!< GPDMA1 LSTDSTREG: WE_CH2 Position       */
#define GPDMA1_LSTDSTREG_WE_CH2_Msk           (0x01UL << GPDMA1_LSTDSTREG_WE_CH2_Pos)                 /*!< GPDMA1 LSTDSTREG: WE_CH2 Mask           */
#define GPDMA1_LSTDSTREG_WE_CH3_Pos           11                                                      /*!< GPDMA1 LSTDSTREG: WE_CH3 Position       */
#define GPDMA1_LSTDSTREG_WE_CH3_Msk           (0x01UL << GPDMA1_LSTDSTREG_WE_CH3_Pos)                 /*!< GPDMA1 LSTDSTREG: WE_CH3 Mask           */

/* ------------------------------  GPDMA1_DMACFGREG  ------------------------------ */
#define GPDMA1_DMACFGREG_DMA_EN_Pos           0                                                       /*!< GPDMA1 DMACFGREG: DMA_EN Position       */
#define GPDMA1_DMACFGREG_DMA_EN_Msk           (0x01UL << GPDMA1_DMACFGREG_DMA_EN_Pos)                 /*!< GPDMA1 DMACFGREG: DMA_EN Mask           */

/* -------------------------------  GPDMA1_CHENREG  ------------------------------- */
#define GPDMA1_CHENREG_CH_Pos                 0                                                       /*!< GPDMA1 CHENREG: CH Position             */
#define GPDMA1_CHENREG_CH_Msk                 (0x0fUL << GPDMA1_CHENREG_CH_Pos)                       /*!< GPDMA1 CHENREG: CH Mask                 */
#define GPDMA1_CHENREG_WE_CH_Pos              8                                                       /*!< GPDMA1 CHENREG: WE_CH Position          */
#define GPDMA1_CHENREG_WE_CH_Msk              (0x0fUL << GPDMA1_CHENREG_WE_CH_Pos)                    /*!< GPDMA1 CHENREG: WE_CH Mask              */

