FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ----------------------------------  GPDMA1_ID  --------------------------------- */
#define GPDMA1_ID_VALUE_Pos                   0                                                       /*!< GPDMA1 ID: VALUE Position               */
#define GPDMA1_ID_VALUE_Msk                   (0xffffffffUL << GPDMA1_ID_VALUE_Pos)                   /*!< GPDMA1 ID: VALUE Mask                   */

/* ---------------------------------  GPDMA1_TYPE  -------------------------------- */
#define GPDMA1_TYPE_VALUE_Pos                 0                                                       /*!< GPDMA1 TYPE: VALUE Position             */
#define GPDMA1_TYPE_VALUE_Msk                 (0xffffffffUL << GPDMA1_TYPE_VALUE_Pos)                 /*!< GPDMA1 TYPE: VALUE Mask                 */

/* -------------------------------  GPDMA1_VERSION  ------------------------------- */
#define GPDMA1_VERSION_VALUE_Pos              0                                                       /*!< GPDMA1 VERSION: VALUE Position          */
#define GPDMA1_VERSION_VALUE_Msk              (0xffffffffUL << GPDMA1_VERSION_VALUE_Pos)              /*!< GPDMA1 VERSION: VALUE Mask              */


/* ================================================================================ */
/* ================        Group 'GPDMA1_CH' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------------  GPDMA1_CH_SAR  ------------------------------- */
#define GPDMA1_CH_SAR_SAR_Pos                 0                                                       /*!< GPDMA1_CH SAR: SAR Position             */
#define GPDMA1_CH_SAR_SAR_Msk                 (0xffffffffUL << GPDMA1_CH_SAR_SAR_Pos)                 /*!< GPDMA1_CH SAR: SAR Mask                 */

/* --------------------------------  GPDMA1_CH_DAR  ------------------------------- */
#define GPDMA1_CH_DAR_DAR_Pos                 0                                                       /*!< GPDMA1_CH DAR: DAR Position             */
#define GPDMA1_CH_DAR_DAR_Msk                 (0xffffffffUL << GPDMA1_CH_DAR_DAR_Pos)                 /*!< GPDMA1_CH DAR: DAR Mask                 */

/* -------------------------------  GPDMA1_CH_CTLL  ------------------------------- */
#define GPDMA1_CH_CTLL_INT_EN_Pos             0                                                       /*!< GPDMA1_CH CTLL: INT_EN Position         */
#define GPDMA1_CH_CTLL_INT_EN_Msk             (0x01UL << GPDMA1_CH_CTLL_INT_EN_Pos)                   /*!< GPDMA1_CH CTLL: INT_EN Mask             */
#define GPDMA1_CH_CTLL_DST_TR_WIDTH_Pos       1                                                       /*!< GPDMA1_CH CTLL: DST_TR_WIDTH Position   */
#define GPDMA1_CH_CTLL_DST_TR_WIDTH_Msk       (0x07UL << GPDMA1_CH_CTLL_DST_TR_WIDTH_Pos)             /*!< GPDMA1_CH CTLL: DST_TR_WIDTH Mask       */
#define GPDMA1_CH_CTLL_SRC_TR_WIDTH_Pos       4                                                       /*!< GPDMA1_CH CTLL: SRC_TR_WIDTH Position   */
#define GPDMA1_CH_CTLL_SRC_TR_WIDTH_Msk       (0x07UL << GPDMA1_CH_CTLL_SRC_TR_WIDTH_Pos)             /*!< GPDMA1_CH CTLL: SRC_TR_WIDTH Mask       */
#define GPDMA1_CH_CTLL_DINC_Pos               7                                                       /*!< GPDMA1_CH CTLL: DINC Position           */
#define GPDMA1_CH_CTLL_DINC_Msk               (0x03UL << GPDMA1_CH_CTLL_DINC_Pos)                     /*!< GPDMA1_CH CTLL: DINC Mask               */
#define GPDMA1_CH_CTLL_SINC_Pos               9                                                       /*!< GPDMA1_CH CTLL: SINC Position           */
#define GPDMA1_CH_CTLL_SINC_Msk               (0x03UL << GPDMA1_CH_CTLL_SINC_Pos)                     /*!< GPDMA1_CH CTLL: SINC Mask               */
#define GPDMA1_CH_CTLL_DEST_MSIZE_Pos         11                                                      /*!< GPDMA1_CH CTLL: DEST_MSIZE Position     */
#define GPDMA1_CH_CTLL_DEST_MSIZE_Msk         (0x07UL << GPDMA1_CH_CTLL_DEST_MSIZE_Pos)               /*!< GPDMA1_CH CTLL: DEST_MSIZE Mask         */
#define GPDMA1_CH_CTLL_SRC_MSIZE_Pos          14                                                      /*!< GPDMA1_CH CTLL: SRC_MSIZE Position      */
#define GPDMA1_CH_CTLL_SRC_MSIZE_Msk          (0x07UL << GPDMA1_CH_CTLL_SRC_MSIZE_Pos)                /*!< GPDMA1_CH CTLL: SRC_MSIZE Mask          */
#define GPDMA1_CH_CTLL_TT_FC_Pos              20                                                      /*!< GPDMA1_CH CTLL: TT_FC Position          */
#define GPDMA1_CH_CTLL_TT_FC_Msk              (0x07UL << GPDMA1_CH_CTLL_TT_FC_Pos)                    /*!< GPDMA1_CH CTLL: TT_FC Mask              */

/* -------------------------------  GPDMA1_CH_CTLH  ------------------------------- */
#define GPDMA1_CH_CTLH_BLOCK_TS_Pos           0                                                       /*!< GPDMA1_CH CTLH: BLOCK_TS Position       */
#define GPDMA1_CH_CTLH_BLOCK_TS_Msk           (0x00000fffUL << GPDMA1_CH_CTLH_BLOCK_TS_Pos)           /*!< GPDMA1_CH CTLH: BLOCK_TS Mask           */
#define GPDMA1_CH_CTLH_DONE_Pos               12                                                      /*!< GPDMA1_CH CTLH: DONE Position           */
#define GPDMA1_CH_CTLH_DONE_Msk               (0x01UL << GPDMA1_CH_CTLH_DONE_Pos)                     /*!< GPDMA1_CH CTLH: DONE Mask               */

/* -------------------------------  GPDMA1_CH_CFGL  ------------------------------- */
#define GPDMA1_CH_CFGL_CH_PRIOR_Pos           5                                                       /*!< GPDMA1_CH CFGL: CH_PRIOR Position       */
#define GPDMA1_CH_CFGL_CH_PRIOR_Msk           (0x07UL << GPDMA1_CH_CFGL_CH_PRIOR_Pos)                 /*!< GPDMA1_CH CFGL: CH_PRIOR Mask           */
#define GPDMA1_CH_CFGL_CH_SUSP_Pos            8                                                       /*!< GPDMA1_CH CFGL: CH_SUSP Position        */
#define GPDMA1_CH_CFGL_CH_SUSP_Msk            (0x01UL << GPDMA1_CH_CFGL_CH_SUSP_Pos)                  /*!< GPDMA1_CH CFGL: CH_SUSP Mask            */
#define GPDMA1_CH_CFGL_FIFO_EMPTY_Pos         9                                                       /*!< GPDMA1_CH CFGL: FIFO_EMPTY Position     */
#define GPDMA1_CH_CFGL_FIFO_EMPTY_Msk         (0x01UL << GPDMA1_CH_CFGL_FIFO_EMPTY_Pos)               /*!< GPDMA1_CH CFGL: FIFO_EMPTY Mask         */
#define GPDMA1_CH_CFGL_HS_SEL_DST_Pos         10                                                      /*!< GPDMA1_CH CFGL: HS_SEL_DST Position     */
#define GPDMA1_CH_CFGL_HS_SEL_DST_Msk         (0x01UL << GPDMA1_CH_CFGL_HS_SEL_DST_Pos)               /*!< GPDMA1_CH CFGL: HS_SEL_DST Mask         */
#define GPDMA1_CH_CFGL_HS_SEL_SRC_Pos         11                                                      /*!< GPDMA1_CH CFGL: HS_SEL_SRC Position     */
#define GPDMA1_CH_CFGL_HS_SEL_SRC_Msk         (0x01UL << GPDMA1_CH_CFGL_HS_SEL_SRC_Pos)               /*!< GPDMA1_CH CFGL: HS_SEL_SRC Mask         */
#define GPDMA1_CH_CFGL_LOCK_CH_L_Pos          12                                                      /*!< GPDMA1_CH CFGL: LOCK_CH_L Position      */
#define GPDMA1_CH_CFGL_LOCK_CH_L_Msk          (0x03UL << GPDMA1_CH_CFGL_LOCK_CH_L_Pos)                /*!< GPDMA1_CH CFGL: LOCK_CH_L Mask          */
#define GPDMA1_CH_CFGL_LOCK_B_L_Pos           14                                                      /*!< GPDMA1_CH CFGL: LOCK_B_L Position       */
#define GPDMA1_CH_CFGL_LOCK_B_L_Msk           (0x03UL << GPDMA1_CH_CFGL_LOCK_B_L_Pos)                 /*!< GPDMA1_CH CFGL: LOCK_B_L Mask           */
#define GPDMA1_CH_CFGL_LOCK_CH_Pos            16                                                      /*!< GPDMA1_CH CFGL: LOCK_CH Position        */
#define GPDMA1_CH_CFGL_LOCK_CH_Msk            (0x01UL << GPDMA1_CH_CFGL_LOCK_CH_Pos)                  /*!< GPDMA1_CH CFGL: LOCK_CH Mask            */
#define GPDMA1_CH_CFGL_LOCK_B_Pos             17                                                      /*!< GPDMA1_CH CFGL: LOCK_B Position         */
#define GPDMA1_CH_CFGL_LOCK_B_Msk             (0x01UL << GPDMA1_CH_CFGL_LOCK_B_Pos)                   /*!< GPDMA1_CH CFGL: LOCK_B Mask             */
#define GPDMA1_CH_CFGL_DST_HS_POL_Pos         18                                                      /*!< GPDMA1_CH CFGL: DST_HS_POL Position     */
#define GPDMA1_CH_CFGL_DST_HS_POL_Msk         (0x01UL << GPDMA1_CH_CFGL_DST_HS_POL_Pos)               /*!< GPDMA1_CH CFGL: DST_HS_POL Mask         */
#define GPDMA1_CH_CFGL_SRC_HS_POL_Pos         19                                                      /*!< GPDMA1_CH CFGL: SRC_HS_POL Position     */
#define GPDMA1_CH_CFGL_SRC_HS_POL_Msk         (0x01UL << GPDMA1_CH_CFGL_SRC_HS_POL_Pos)               /*!< GPDMA1_CH CFGL: SRC_HS_POL Mask         */
#define GPDMA1_CH_CFGL_MAX_ABRST_Pos          20                                                      /*!< GPDMA1_CH CFGL: MAX_ABRST Position      */
#define GPDMA1_CH_CFGL_MAX_ABRST_Msk          (0x000003ffUL << GPDMA1_CH_CFGL_MAX_ABRST_Pos)          /*!< GPDMA1_CH CFGL: MAX_ABRST Mask          */

/* -------------------------------  GPDMA1_CH_CFGH  ------------------------------- */
#define GPDMA1_CH_CFGH_FCMODE_Pos             0                                                       /*!< GPDMA1_CH CFGH: FCMODE Position         */
#define GPDMA1_CH_CFGH_FCMODE_Msk             (0x01UL << GPDMA1_CH_CFGH_FCMODE_Pos)                   /*!< GPDMA1_CH CFGH: FCMODE Mask             */
#define GPDMA1_CH_CFGH_FIFO_MODE_Pos          1                                                       /*!< GPDMA1_CH CFGH: FIFO_MODE Position      */
#define GPDMA1_CH_CFGH_FIFO_MODE_Msk          (0x01UL << GPDMA1_CH_CFGH_FIFO_MODE_Pos)                /*!< GPDMA1_CH CFGH: FIFO_MODE Mask          */
#define GPDMA1_CH_CFGH_PROTCTL_Pos            2                                                       /*!< GPDMA1_CH CFGH: PROTCTL Position        */
#define GPDMA1_CH_CFGH_PROTCTL_Msk            (0x07UL << GPDMA1_CH_CFGH_PROTCTL_Pos)                  /*!< GPDMA1_CH CFGH: PROTCTL Mask            */
#define GPDMA1_CH_CFGH_SRC_PER_Pos            7                                                       /*!< GPDMA1_CH CFGH: SRC_PER Position        */
#define GPDMA1_CH_CFGH_SRC_PER_Msk            (0x0fUL << GPDMA1_CH_CFGH_SRC_PER_Pos)                  /*!< GPDMA1_CH CFGH: SRC_PER Mask            */
#define GPDMA1_CH_CFGH_DEST_PER_Pos           11                                                      /*!< GPDMA1_CH CFGH: DEST_PER Position       */
#define GPDMA1_CH_CFGH_DEST_PER_Msk           (0x0fUL << GPDMA1_CH_CFGH_DEST_PER_Pos)                 /*!< GPDMA1_CH CFGH: DEST_PER Mask           */


/* ================================================================================ */
/* ================          struct 'FCE' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  FCE_CLC  ---------------------------------- */
#define FCE_CLC_DISR_Pos                      0                                                       /*!< FCE CLC: DISR Position                  */
#define FCE_CLC_DISR_Msk                      (0x01UL << FCE_CLC_DISR_Pos)                            /*!< FCE CLC: DISR Mask                      */
#define FCE_CLC_DISS_Pos                      1                                                       /*!< FCE CLC: DISS Position                  */
#define FCE_CLC_DISS_Msk                      (0x01UL << FCE_CLC_DISS_Pos)                            /*!< FCE CLC: DISS Mask                      */

