FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ------------------------------  SDMMC_BLOCK_SIZE  ------------------------------ */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_Pos    0                                                       /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE Position */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_Msk    (0x00000fffUL << SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_Pos)    /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE Mask    */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_12_Pos 15                                                      /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE_12 Position */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_12_Msk (0x01UL << SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_12_Pos)       /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE_12 Mask */

/* ------------------------------  SDMMC_BLOCK_COUNT  ----------------------------- */
#define SDMMC_BLOCK_COUNT_BLOCK_COUNT_Pos     0                                                       /*!< SDMMC BLOCK_COUNT: BLOCK_COUNT Position */
#define SDMMC_BLOCK_COUNT_BLOCK_COUNT_Msk     (0x0000ffffUL << SDMMC_BLOCK_COUNT_BLOCK_COUNT_Pos)     /*!< SDMMC BLOCK_COUNT: BLOCK_COUNT Mask     */

/* -------------------------------  SDMMC_ARGUMENT1  ------------------------------ */
#define SDMMC_ARGUMENT1_ARGUMENT1_Pos         0                                                       /*!< SDMMC ARGUMENT1: ARGUMENT1 Position     */
#define SDMMC_ARGUMENT1_ARGUMENT1_Msk         (0xffffffffUL << SDMMC_ARGUMENT1_ARGUMENT1_Pos)         /*!< SDMMC ARGUMENT1: ARGUMENT1 Mask         */

/* -----------------------------  SDMMC_TRANSFER_MODE  ---------------------------- */
#define SDMMC_TRANSFER_MODE_BLOCK_COUNT_EN_Pos 1                                                      /*!< SDMMC TRANSFER_MODE: BLOCK_COUNT_EN Position */
#define SDMMC_TRANSFER_MODE_BLOCK_COUNT_EN_Msk (0x01UL << SDMMC_TRANSFER_MODE_BLOCK_COUNT_EN_Pos)     /*!< SDMMC TRANSFER_MODE: BLOCK_COUNT_EN Mask */
#define SDMMC_TRANSFER_MODE_ACMD_EN_Pos       2                                                       /*!< SDMMC TRANSFER_MODE: ACMD_EN Position   */
#define SDMMC_TRANSFER_MODE_ACMD_EN_Msk       (0x03UL << SDMMC_TRANSFER_MODE_ACMD_EN_Pos)             /*!< SDMMC TRANSFER_MODE: ACMD_EN Mask       */
#define SDMMC_TRANSFER_MODE_TX_DIR_SELECT_Pos 4                                                       /*!< SDMMC TRANSFER_MODE: TX_DIR_SELECT Position */
#define SDMMC_TRANSFER_MODE_TX_DIR_SELECT_Msk (0x01UL << SDMMC_TRANSFER_MODE_TX_DIR_SELECT_Pos)       /*!< SDMMC TRANSFER_MODE: TX_DIR_SELECT Mask */
#define SDMMC_TRANSFER_MODE_MULTI_BLOCK_SELECT_Pos 5                                                  /*!< SDMMC TRANSFER_MODE: MULTI_BLOCK_SELECT Position */
#define SDMMC_TRANSFER_MODE_MULTI_BLOCK_SELECT_Msk (0x01UL << SDMMC_TRANSFER_MODE_MULTI_BLOCK_SELECT_Pos)/*!< SDMMC TRANSFER_MODE: MULTI_BLOCK_SELECT Mask */
#define SDMMC_TRANSFER_MODE_CMD_COMP_ATA_Pos  6                                                       /*!< SDMMC TRANSFER_MODE: CMD_COMP_ATA Position */
#define SDMMC_TRANSFER_MODE_CMD_COMP_ATA_Msk  (0x01UL << SDMMC_TRANSFER_MODE_CMD_COMP_ATA_Pos)        /*!< SDMMC TRANSFER_MODE: CMD_COMP_ATA Mask  */

/* --------------------------------  SDMMC_COMMAND  ------------------------------- */
#define SDMMC_COMMAND_RESP_TYPE_SELECT_Pos    0                                                       /*!< SDMMC COMMAND: RESP_TYPE_SELECT Position */
#define SDMMC_COMMAND_RESP_TYPE_SELECT_Msk    (0x03UL << SDMMC_COMMAND_RESP_TYPE_SELECT_Pos)          /*!< SDMMC COMMAND: RESP_TYPE_SELECT Mask    */
#define SDMMC_COMMAND_CMD_CRC_CHECK_EN_Pos    3                                                       /*!< SDMMC COMMAND: CMD_CRC_CHECK_EN Position */
#define SDMMC_COMMAND_CMD_CRC_CHECK_EN_Msk    (0x01UL << SDMMC_COMMAND_CMD_CRC_CHECK_EN_Pos)          /*!< SDMMC COMMAND: CMD_CRC_CHECK_EN Mask    */
#define SDMMC_COMMAND_CMD_IND_CHECK_EN_Pos    4                                                       /*!< SDMMC COMMAND: CMD_IND_CHECK_EN Position */
#define SDMMC_COMMAND_CMD_IND_CHECK_EN_Msk    (0x01UL << SDMMC_COMMAND_CMD_IND_CHECK_EN_Pos)          /*!< SDMMC COMMAND: CMD_IND_CHECK_EN Mask    */
#define SDMMC_COMMAND_DATA_PRESENT_SELECT_Pos 5                                                       /*!< SDMMC COMMAND: DATA_PRESENT_SELECT Position */
#define SDMMC_COMMAND_DATA_PRESENT_SELECT_Msk (0x01UL << SDMMC_COMMAND_DATA_PRESENT_SELECT_Pos)       /*!< SDMMC COMMAND: DATA_PRESENT_SELECT Mask */
#define SDMMC_COMMAND_CMD_TYPE_Pos            6                                                       /*!< SDMMC COMMAND: CMD_TYPE Position        */
#define SDMMC_COMMAND_CMD_TYPE_Msk            (0x03UL << SDMMC_COMMAND_CMD_TYPE_Pos)                  /*!< SDMMC COMMAND: CMD_TYPE Mask            */
#define SDMMC_COMMAND_CMD_IND_Pos             8                                                       /*!< SDMMC COMMAND: CMD_IND Position         */
#define SDMMC_COMMAND_CMD_IND_Msk             (0x3fUL << SDMMC_COMMAND_CMD_IND_Pos)                   /*!< SDMMC COMMAND: CMD_IND Mask             */

/* -------------------------------  SDMMC_RESPONSE0  ------------------------------ */
#define SDMMC_RESPONSE0_RESPONSE0_Pos         0                                                       /*!< SDMMC RESPONSE0: RESPONSE0 Position     */
#define SDMMC_RESPONSE0_RESPONSE0_Msk         (0x0000ffffUL << SDMMC_RESPONSE0_RESPONSE0_Pos)         /*!< SDMMC RESPONSE0: RESPONSE0 Mask         */
#define SDMMC_RESPONSE0_RESPONSE1_Pos         16                                                      /*!< SDMMC RESPONSE0: RESPONSE1 Position     */
#define SDMMC_RESPONSE0_RESPONSE1_Msk         (0x0000ffffUL << SDMMC_RESPONSE0_RESPONSE1_Pos)         /*!< SDMMC RESPONSE0: RESPONSE1 Mask         */

/* -------------------------------  SDMMC_RESPONSE2  ------------------------------ */
#define SDMMC_RESPONSE2_RESPONSE2_Pos         0                                                       /*!< SDMMC RESPONSE2: RESPONSE2 Position     */
#define SDMMC_RESPONSE2_RESPONSE2_Msk         (0x0000ffffUL << SDMMC_RESPONSE2_RESPONSE2_Pos)         /*!< SDMMC RESPONSE2: RESPONSE2 Mask         */
#define SDMMC_RESPONSE2_RESPONSE3_Pos         16                                                      /*!< SDMMC RESPONSE2: RESPONSE3 Position     */
#define SDMMC_RESPONSE2_RESPONSE3_Msk         (0x0000ffffUL << SDMMC_RESPONSE2_RESPONSE3_Pos)         /*!< SDMMC RESPONSE2: RESPONSE3 Mask         */

/* -------------------------------  SDMMC_RESPONSE4  ------------------------------ */
#define SDMMC_RESPONSE4_RESPONSE4_Pos         0                                                       /*!< SDMMC RESPONSE4: RESPONSE4 Position     */
#define SDMMC_RESPONSE4_RESPONSE4_Msk         (0x0000ffffUL << SDMMC_RESPONSE4_RESPONSE4_Pos)         /*!< SDMMC RESPONSE4: RESPONSE4 Mask         */
#define SDMMC_RESPONSE4_RESPONSE5_Pos         16                                                      /*!< SDMMC RESPONSE4: RESPONSE5 Position     */
#define SDMMC_RESPONSE4_RESPONSE5_Msk         (0x0000ffffUL << SDMMC_RESPONSE4_RESPONSE5_Pos)         /*!< SDMMC RESPONSE4: RESPONSE5 Mask         */

/* -------------------------------  SDMMC_RESPONSE6  ------------------------------ */
#define SDMMC_RESPONSE6_RESPONSE6_Pos         0                                                       /*!< SDMMC RESPONSE6: RESPONSE6 Position     */
#define SDMMC_RESPONSE6_RESPONSE6_Msk         (0x0000ffffUL << SDMMC_RESPONSE6_RESPONSE6_Pos)         /*!< SDMMC RESPONSE6: RESPONSE6 Mask         */
#define SDMMC_RESPONSE6_RESPONSE7_Pos         16                                                      /*!< SDMMC RESPONSE6: RESPONSE7 Position     */
#define SDMMC_RESPONSE6_RESPONSE7_Msk         (0x0000ffffUL << SDMMC_RESPONSE6_RESPONSE7_Pos)         /*!< SDMMC RESPONSE6: RESPONSE7 Mask         */

/* ------------------------------  SDMMC_DATA_BUFFER  ----------------------------- */
#define SDMMC_DATA_BUFFER_DATA_BUFFER_Pos     0                                                       /*!< SDMMC DATA_BUFFER: DATA_BUFFER Position */
#define SDMMC_DATA_BUFFER_DATA_BUFFER_Msk     (0xffffffffUL << SDMMC_DATA_BUFFER_DATA_BUFFER_Pos)     /*!< SDMMC DATA_BUFFER: DATA_BUFFER Mask     */

/* -----------------------------  SDMMC_PRESENT_STATE  ---------------------------- */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_CMD_Pos 0                                                 /*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_CMD Position */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_CMD_Msk (0x01UL << SDMMC_PRESENT_STATE_COMMAND_INHIBIT_CMD_Pos)/*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_CMD Mask */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_DAT_Pos 1                                                 /*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_DAT Position */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_DAT_Msk (0x01UL << SDMMC_PRESENT_STATE_COMMAND_INHIBIT_DAT_Pos)/*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_DAT Mask */
#define SDMMC_PRESENT_STATE_DAT_LINE_ACTIVE_Pos 2                                                     /*!< SDMMC PRESENT_STATE: DAT_LINE_ACTIVE Position */
#define SDMMC_PRESENT_STATE_DAT_LINE_ACTIVE_Msk (0x01UL << SDMMC_PRESENT_STATE_DAT_LINE_ACTIVE_Pos)   /*!< SDMMC PRESENT_STATE: DAT_LINE_ACTIVE Mask */
#define SDMMC_PRESENT_STATE_WRITE_TRANSFER_ACTIVE_Pos 8                                               /*!< SDMMC PRESENT_STATE: WRITE_TRANSFER_ACTIVE Position */
#define SDMMC_PRESENT_STATE_WRITE_TRANSFER_ACTIVE_Msk (0x01UL << SDMMC_PRESENT_STATE_WRITE_TRANSFER_ACTIVE_Pos)/*!< SDMMC PRESENT_STATE: WRITE_TRANSFER_ACTIVE Mask */
#define SDMMC_PRESENT_STATE_READ_TRANSFER_ACTIVE_Pos 9                                                /*!< SDMMC PRESENT_STATE: READ_TRANSFER_ACTIVE Position */
#define SDMMC_PRESENT_STATE_READ_TRANSFER_ACTIVE_Msk (0x01UL << SDMMC_PRESENT_STATE_READ_TRANSFER_ACTIVE_Pos)/*!< SDMMC PRESENT_STATE: READ_TRANSFER_ACTIVE Mask */
#define SDMMC_PRESENT_STATE_BUFFER_WRITE_ENABLE_Pos 10                                                /*!< SDMMC PRESENT_STATE: BUFFER_WRITE_ENABLE Position */
#define SDMMC_PRESENT_STATE_BUFFER_WRITE_ENABLE_Msk (0x01UL << SDMMC_PRESENT_STATE_BUFFER_WRITE_ENABLE_Pos)/*!< SDMMC PRESENT_STATE: BUFFER_WRITE_ENABLE Mask */
#define SDMMC_PRESENT_STATE_BUFFER_READ_ENABLE_Pos 11                                                 /*!< SDMMC PRESENT_STATE: BUFFER_READ_ENABLE Position */
#define SDMMC_PRESENT_STATE_BUFFER_READ_ENABLE_Msk (0x01UL << SDMMC_PRESENT_STATE_BUFFER_READ_ENABLE_Pos)/*!< SDMMC PRESENT_STATE: BUFFER_READ_ENABLE Mask */
#define SDMMC_PRESENT_STATE_CARD_INSERTED_Pos 16                                                      /*!< SDMMC PRESENT_STATE: CARD_INSERTED Position */
#define SDMMC_PRESENT_STATE_CARD_INSERTED_Msk (0x01UL << SDMMC_PRESENT_STATE_CARD_INSERTED_Pos)       /*!< SDMMC PRESENT_STATE: CARD_INSERTED Mask */
#define SDMMC_PRESENT_STATE_CARD_STATE_STABLE_Pos 17                                                  /*!< SDMMC PRESENT_STATE: CARD_STATE_STABLE Position */
#define SDMMC_PRESENT_STATE_CARD_STATE_STABLE_Msk (0x01UL << SDMMC_PRESENT_STATE_CARD_STATE_STABLE_Pos)/*!< SDMMC PRESENT_STATE: CARD_STATE_STABLE Mask */
#define SDMMC_PRESENT_STATE_CARD_DETECT_PIN_LEVEL_Pos 18                                              /*!< SDMMC PRESENT_STATE: CARD_DETECT_PIN_LEVEL Position */
#define SDMMC_PRESENT_STATE_CARD_DETECT_PIN_LEVEL_Msk (0x01UL << SDMMC_PRESENT_STATE_CARD_DETECT_PIN_LEVEL_Pos)/*!< SDMMC PRESENT_STATE: CARD_DETECT_PIN_LEVEL Mask */
#define SDMMC_PRESENT_STATE_WRITE_PROTECT_PIN_LEVEL_Pos 19                                            /*!< SDMMC PRESENT_STATE: WRITE_PROTECT_PIN_LEVEL Position */
#define SDMMC_PRESENT_STATE_WRITE_PROTECT_PIN_LEVEL_Msk (0x01UL << SDMMC_PRESENT_STATE_WRITE_PROTECT_PIN_LEVEL_Pos)/*!< SDMMC PRESENT_STATE: WRITE_PROTECT_PIN_LEVEL Mask */
#define SDMMC_PRESENT_STATE_DAT_3_0_PIN_LEVEL_Pos 20                                                  /*!< SDMMC PRESENT_STATE: DAT_3_0_PIN_LEVEL Position */
#define SDMMC_PRESENT_STATE_DAT_3_0_PIN_LEVEL_Msk (0x0fUL << SDMMC_PRESENT_STATE_DAT_3_0_PIN_LEVEL_Pos)/*!< SDMMC PRESENT_STATE: DAT_3_0_PIN_LEVEL Mask */
#define SDMMC_PRESENT_STATE_CMD_LINE_LEVEL_Pos 24                                                     /*!< SDMMC PRESENT_STATE: CMD_LINE_LEVEL Position */
#define SDMMC_PRESENT_STATE_CMD_LINE_LEVEL_Msk (0x01UL << SDMMC_PRESENT_STATE_CMD_LINE_LEVEL_Pos)     /*!< SDMMC PRESENT_STATE: CMD_LINE_LEVEL Mask */
#define SDMMC_PRESENT_STATE_DAT_7_4_PIN_LEVEL_Pos 25                                                  /*!< SDMMC PRESENT_STATE: DAT_7_4_PIN_LEVEL Position */
#define SDMMC_PRESENT_STATE_DAT_7_4_PIN_LEVEL_Msk (0x0fUL << SDMMC_PRESENT_STATE_DAT_7_4_PIN_LEVEL_Pos)/*!< SDMMC PRESENT_STATE: DAT_7_4_PIN_LEVEL Mask */

/* -------------------------------  SDMMC_HOST_CTRL  ------------------------------ */
#define SDMMC_HOST_CTRL_LED_CTRL_Pos          0                                                       /*!< SDMMC HOST_CTRL: LED_CTRL Position      */
#define SDMMC_HOST_CTRL_LED_CTRL_Msk          (0x01UL << SDMMC_HOST_CTRL_LED_CTRL_Pos)                /*!< SDMMC HOST_CTRL: LED_CTRL Mask          */
#define SDMMC_HOST_CTRL_DATA_TX_WIDTH_Pos     1                                                       /*!< SDMMC HOST_CTRL: DATA_TX_WIDTH Position */
#define SDMMC_HOST_CTRL_DATA_TX_WIDTH_Msk     (0x01UL << SDMMC_HOST_CTRL_DATA_TX_WIDTH_Pos)           /*!< SDMMC HOST_CTRL: DATA_TX_WIDTH Mask     */
#define SDMMC_HOST_CTRL_HIGH_SPEED_EN_Pos     2                                                       /*!< SDMMC HOST_CTRL: HIGH_SPEED_EN Position */
#define SDMMC_HOST_CTRL_HIGH_SPEED_EN_Msk     (0x01UL << SDMMC_HOST_CTRL_HIGH_SPEED_EN_Pos)           /*!< SDMMC HOST_CTRL: HIGH_SPEED_EN Mask     */
#define SDMMC_HOST_CTRL_CARD_DETECT_TEST_LEVEL_Pos 6                                                  /*!< SDMMC HOST_CTRL: CARD_DETECT_TEST_LEVEL Position */
#define SDMMC_HOST_CTRL_CARD_DETECT_TEST_LEVEL_Msk (0x01UL << SDMMC_HOST_CTRL_CARD_DETECT_TEST_LEVEL_Pos)/*!< SDMMC HOST_CTRL: CARD_DETECT_TEST_LEVEL Mask */
#define SDMMC_HOST_CTRL_CARD_DET_SIGNAL_DETECT_Pos 7                                                  /*!< SDMMC HOST_CTRL: CARD_DET_SIGNAL_DETECT Position */
#define SDMMC_HOST_CTRL_CARD_DET_SIGNAL_DETECT_Msk (0x01UL << SDMMC_HOST_CTRL_CARD_DET_SIGNAL_DETECT_Pos)/*!< SDMMC HOST_CTRL: CARD_DET_SIGNAL_DETECT Mask */

/* ------------------------------  SDMMC_POWER_CTRL  ------------------------------ */
#define SDMMC_POWER_CTRL_SD_BUS_POWER_Pos     0                                                       /*!< SDMMC POWER_CTRL: SD_BUS_POWER Position */
#define SDMMC_POWER_CTRL_SD_BUS_POWER_Msk     (0x01UL << SDMMC_POWER_CTRL_SD_BUS_POWER_Pos)           /*!< SDMMC POWER_CTRL: SD_BUS_POWER Mask     */
#define SDMMC_POWER_CTRL_SD_BUS_VOLTAGE_SEL_Pos 1                                                     /*!< SDMMC POWER_CTRL: SD_BUS_VOLTAGE_SEL Position */
#define SDMMC_POWER_CTRL_SD_BUS_VOLTAGE_SEL_Msk (0x07UL << SDMMC_POWER_CTRL_SD_BUS_VOLTAGE_SEL_Pos)   /*!< SDMMC POWER_CTRL: SD_BUS_VOLTAGE_SEL Mask */
#define SDMMC_POWER_CTRL_HARDWARE_RESET_Pos   4                                                       /*!< SDMMC POWER_CTRL: HARDWARE_RESET Position */
#define SDMMC_POWER_CTRL_HARDWARE_RESET_Msk   (0x01UL << SDMMC_POWER_CTRL_HARDWARE_RESET_Pos)         /*!< SDMMC POWER_CTRL: HARDWARE_RESET Mask   */

/* ----------------------------  SDMMC_BLOCK_GAP_CTRL  ---------------------------- */
#define SDMMC_BLOCK_GAP_CTRL_STOP_AT_BLOCK_GAP_Pos 0                                                  /*!< SDMMC BLOCK_GAP_CTRL: STOP_AT_BLOCK_GAP Position */
#define SDMMC_BLOCK_GAP_CTRL_STOP_AT_BLOCK_GAP_Msk (0x01UL << SDMMC_BLOCK_GAP_CTRL_STOP_AT_BLOCK_GAP_Pos)/*!< SDMMC BLOCK_GAP_CTRL: STOP_AT_BLOCK_GAP Mask */
#define SDMMC_BLOCK_GAP_CTRL_CONTINUE_REQ_Pos 1                                                       /*!< SDMMC BLOCK_GAP_CTRL: CONTINUE_REQ Position */
#define SDMMC_BLOCK_GAP_CTRL_CONTINUE_REQ_Msk (0x01UL << SDMMC_BLOCK_GAP_CTRL_CONTINUE_REQ_Pos)       /*!< SDMMC BLOCK_GAP_CTRL: CONTINUE_REQ Mask */
#define SDMMC_BLOCK_GAP_CTRL_READ_WAIT_CTRL_Pos 2                                                     /*!< SDMMC BLOCK_GAP_CTRL: READ_WAIT_CTRL Position */
#define SDMMC_BLOCK_GAP_CTRL_READ_WAIT_CTRL_Msk (0x01UL << SDMMC_BLOCK_GAP_CTRL_READ_WAIT_CTRL_Pos)   /*!< SDMMC BLOCK_GAP_CTRL: READ_WAIT_CTRL Mask */
#define SDMMC_BLOCK_GAP_CTRL_INT_AT_BLOCK_GAP_Pos 3                                                   /*!< SDMMC BLOCK_GAP_CTRL: INT_AT_BLOCK_GAP Position */
#define SDMMC_BLOCK_GAP_CTRL_INT_AT_BLOCK_GAP_Msk (0x01UL << SDMMC_BLOCK_GAP_CTRL_INT_AT_BLOCK_GAP_Pos)/*!< SDMMC BLOCK_GAP_CTRL: INT_AT_BLOCK_GAP Mask */
#define SDMMC_BLOCK_GAP_CTRL_SPI_MODE_Pos     4                                                       /*!< SDMMC BLOCK_GAP_CTRL: SPI_MODE Position */
#define SDMMC_BLOCK_GAP_CTRL_SPI_MODE_Msk     (0x01UL << SDMMC_BLOCK_GAP_CTRL_SPI_MODE_Pos)           /*!< SDMMC BLOCK_GAP_CTRL: SPI_MODE Mask     */

