FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ------------------------------  SDMMC_WAKEUP_CTRL  ----------------------------- */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INT_Pos 0                                                   /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INT Position */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INT_Msk (0x01UL << SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INT_Pos)/*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INT Mask */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INS_Pos 1                                                   /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INS Position */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INS_Msk (0x01UL << SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INS_Pos)/*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INS Mask */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_REM_Pos 2                                                   /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_REM Position */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_REM_Msk (0x01UL << SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_REM_Pos)/*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_REM Mask */

/* ------------------------------  SDMMC_CLOCK_CTRL  ------------------------------ */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_EN_Pos 0                                                      /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_EN Position */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_EN_Msk (0x01UL << SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_EN_Pos)     /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_EN Mask */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_STABLE_Pos 1                                                  /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_STABLE Position */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_STABLE_Msk (0x01UL << SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_STABLE_Pos)/*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_STABLE Mask */
#define SDMMC_CLOCK_CTRL_SDCLOCK_EN_Pos       2                                                       /*!< SDMMC CLOCK_CTRL: SDCLOCK_EN Position   */
#define SDMMC_CLOCK_CTRL_SDCLOCK_EN_Msk       (0x01UL << SDMMC_CLOCK_CTRL_SDCLOCK_EN_Pos)             /*!< SDMMC CLOCK_CTRL: SDCLOCK_EN Mask       */
#define SDMMC_CLOCK_CTRL_SDCLK_FREQ_SEL_Pos   8                                                       /*!< SDMMC CLOCK_CTRL: SDCLK_FREQ_SEL Position */
#define SDMMC_CLOCK_CTRL_SDCLK_FREQ_SEL_Msk   (0x000000ffUL << SDMMC_CLOCK_CTRL_SDCLK_FREQ_SEL_Pos)   /*!< SDMMC CLOCK_CTRL: SDCLK_FREQ_SEL Mask   */

/* -----------------------------  SDMMC_TIMEOUT_CTRL  ----------------------------- */
#define SDMMC_TIMEOUT_CTRL_DAT_TIMEOUT_CNT_VAL_Pos 0                                                  /*!< SDMMC TIMEOUT_CTRL: DAT_TIMEOUT_CNT_VAL Position */
#define SDMMC_TIMEOUT_CTRL_DAT_TIMEOUT_CNT_VAL_Msk (0x0fUL << SDMMC_TIMEOUT_CTRL_DAT_TIMEOUT_CNT_VAL_Pos)/*!< SDMMC TIMEOUT_CTRL: DAT_TIMEOUT_CNT_VAL Mask */

/* -------------------------------  SDMMC_SW_RESET  ------------------------------- */
#define SDMMC_SW_RESET_SW_RST_ALL_Pos         0                                                       /*!< SDMMC SW_RESET: SW_RST_ALL Position     */
#define SDMMC_SW_RESET_SW_RST_ALL_Msk         (0x01UL << SDMMC_SW_RESET_SW_RST_ALL_Pos)               /*!< SDMMC SW_RESET: SW_RST_ALL Mask         */
#define SDMMC_SW_RESET_SW_RST_CMD_LINE_Pos    1                                                       /*!< SDMMC SW_RESET: SW_RST_CMD_LINE Position */
#define SDMMC_SW_RESET_SW_RST_CMD_LINE_Msk    (0x01UL << SDMMC_SW_RESET_SW_RST_CMD_LINE_Pos)          /*!< SDMMC SW_RESET: SW_RST_CMD_LINE Mask    */
#define SDMMC_SW_RESET_SW_RST_DAT_LINE_Pos    2                                                       /*!< SDMMC SW_RESET: SW_RST_DAT_LINE Position */
#define SDMMC_SW_RESET_SW_RST_DAT_LINE_Msk    (0x01UL << SDMMC_SW_RESET_SW_RST_DAT_LINE_Pos)          /*!< SDMMC SW_RESET: SW_RST_DAT_LINE Mask    */

/* ----------------------------  SDMMC_INT_STATUS_NORM  --------------------------- */
#define SDMMC_INT_STATUS_NORM_CMD_COMPLETE_Pos 0                                                      /*!< SDMMC INT_STATUS_NORM: CMD_COMPLETE Position */
#define SDMMC_INT_STATUS_NORM_CMD_COMPLETE_Msk (0x01UL << SDMMC_INT_STATUS_NORM_CMD_COMPLETE_Pos)     /*!< SDMMC INT_STATUS_NORM: CMD_COMPLETE Mask */
#define SDMMC_INT_STATUS_NORM_TX_COMPLETE_Pos 1                                                       /*!< SDMMC INT_STATUS_NORM: TX_COMPLETE Position */
#define SDMMC_INT_STATUS_NORM_TX_COMPLETE_Msk (0x01UL << SDMMC_INT_STATUS_NORM_TX_COMPLETE_Pos)       /*!< SDMMC INT_STATUS_NORM: TX_COMPLETE Mask */
#define SDMMC_INT_STATUS_NORM_BLOCK_GAP_EVENT_Pos 2                                                   /*!< SDMMC INT_STATUS_NORM: BLOCK_GAP_EVENT Position */
#define SDMMC_INT_STATUS_NORM_BLOCK_GAP_EVENT_Msk (0x01UL << SDMMC_INT_STATUS_NORM_BLOCK_GAP_EVENT_Pos)/*!< SDMMC INT_STATUS_NORM: BLOCK_GAP_EVENT Mask */
#define SDMMC_INT_STATUS_NORM_BUFF_WRITE_READY_Pos 4                                                  /*!< SDMMC INT_STATUS_NORM: BUFF_WRITE_READY Position */
#define SDMMC_INT_STATUS_NORM_BUFF_WRITE_READY_Msk (0x01UL << SDMMC_INT_STATUS_NORM_BUFF_WRITE_READY_Pos)/*!< SDMMC INT_STATUS_NORM: BUFF_WRITE_READY Mask */
#define SDMMC_INT_STATUS_NORM_BUFF_READ_READY_Pos 5                                                   /*!< SDMMC INT_STATUS_NORM: BUFF_READ_READY Position */
#define SDMMC_INT_STATUS_NORM_BUFF_READ_READY_Msk (0x01UL << SDMMC_INT_STATUS_NORM_BUFF_READ_READY_Pos)/*!< SDMMC INT_STATUS_NORM: BUFF_READ_READY Mask */
#define SDMMC_INT_STATUS_NORM_CARD_INS_Pos    6                                                       /*!< SDMMC INT_STATUS_NORM: CARD_INS Position */
#define SDMMC_INT_STATUS_NORM_CARD_INS_Msk    (0x01UL << SDMMC_INT_STATUS_NORM_CARD_INS_Pos)          /*!< SDMMC INT_STATUS_NORM: CARD_INS Mask    */
#define SDMMC_INT_STATUS_NORM_CARD_REMOVAL_Pos 7                                                      /*!< SDMMC INT_STATUS_NORM: CARD_REMOVAL Position */
#define SDMMC_INT_STATUS_NORM_CARD_REMOVAL_Msk (0x01UL << SDMMC_INT_STATUS_NORM_CARD_REMOVAL_Pos)     /*!< SDMMC INT_STATUS_NORM: CARD_REMOVAL Mask */
#define SDMMC_INT_STATUS_NORM_CARD_INT_Pos    8                                                       /*!< SDMMC INT_STATUS_NORM: CARD_INT Position */
#define SDMMC_INT_STATUS_NORM_CARD_INT_Msk    (0x01UL << SDMMC_INT_STATUS_NORM_CARD_INT_Pos)          /*!< SDMMC INT_STATUS_NORM: CARD_INT Mask    */
#define SDMMC_INT_STATUS_NORM_ERR_INT_Pos     15                                                      /*!< SDMMC INT_STATUS_NORM: ERR_INT Position */
#define SDMMC_INT_STATUS_NORM_ERR_INT_Msk     (0x01UL << SDMMC_INT_STATUS_NORM_ERR_INT_Pos)           /*!< SDMMC INT_STATUS_NORM: ERR_INT Mask     */

/* ----------------------------  SDMMC_INT_STATUS_ERR  ---------------------------- */
#define SDMMC_INT_STATUS_ERR_CMD_TIMEOUT_ERR_Pos 0                                                    /*!< SDMMC INT_STATUS_ERR: CMD_TIMEOUT_ERR Position */
#define SDMMC_INT_STATUS_ERR_CMD_TIMEOUT_ERR_Msk (0x01UL << SDMMC_INT_STATUS_ERR_CMD_TIMEOUT_ERR_Pos) /*!< SDMMC INT_STATUS_ERR: CMD_TIMEOUT_ERR Mask */
#define SDMMC_INT_STATUS_ERR_CMD_CRC_ERR_Pos  1                                                       /*!< SDMMC INT_STATUS_ERR: CMD_CRC_ERR Position */
#define SDMMC_INT_STATUS_ERR_CMD_CRC_ERR_Msk  (0x01UL << SDMMC_INT_STATUS_ERR_CMD_CRC_ERR_Pos)        /*!< SDMMC INT_STATUS_ERR: CMD_CRC_ERR Mask  */
#define SDMMC_INT_STATUS_ERR_CMD_END_BIT_ERR_Pos 2                                                    /*!< SDMMC INT_STATUS_ERR: CMD_END_BIT_ERR Position */
#define SDMMC_INT_STATUS_ERR_CMD_END_BIT_ERR_Msk (0x01UL << SDMMC_INT_STATUS_ERR_CMD_END_BIT_ERR_Pos) /*!< SDMMC INT_STATUS_ERR: CMD_END_BIT_ERR Mask */
#define SDMMC_INT_STATUS_ERR_CMD_IND_ERR_Pos  3                                                       /*!< SDMMC INT_STATUS_ERR: CMD_IND_ERR Position */
#define SDMMC_INT_STATUS_ERR_CMD_IND_ERR_Msk  (0x01UL << SDMMC_INT_STATUS_ERR_CMD_IND_ERR_Pos)        /*!< SDMMC INT_STATUS_ERR: CMD_IND_ERR Mask  */
#define SDMMC_INT_STATUS_ERR_DATA_TIMEOUT_ERR_Pos 4                                                   /*!< SDMMC INT_STATUS_ERR: DATA_TIMEOUT_ERR Position */
#define SDMMC_INT_STATUS_ERR_DATA_TIMEOUT_ERR_Msk (0x01UL << SDMMC_INT_STATUS_ERR_DATA_TIMEOUT_ERR_Pos)/*!< SDMMC INT_STATUS_ERR: DATA_TIMEOUT_ERR Mask */
#define SDMMC_INT_STATUS_ERR_DATA_CRC_ERR_Pos 5                                                       /*!< SDMMC INT_STATUS_ERR: DATA_CRC_ERR Position */
#define SDMMC_INT_STATUS_ERR_DATA_CRC_ERR_Msk (0x01UL << SDMMC_INT_STATUS_ERR_DATA_CRC_ERR_Pos)       /*!< SDMMC INT_STATUS_ERR: DATA_CRC_ERR Mask */
#define SDMMC_INT_STATUS_ERR_DATA_END_BIT_ERR_Pos 6                                                   /*!< SDMMC INT_STATUS_ERR: DATA_END_BIT_ERR Position */
#define SDMMC_INT_STATUS_ERR_DATA_END_BIT_ERR_Msk (0x01UL << SDMMC_INT_STATUS_ERR_DATA_END_BIT_ERR_Pos)/*!< SDMMC INT_STATUS_ERR: DATA_END_BIT_ERR Mask */
#define SDMMC_INT_STATUS_ERR_CURRENT_LIMIT_ERR_Pos 7                                                  /*!< SDMMC INT_STATUS_ERR: CURRENT_LIMIT_ERR Position */
#define SDMMC_INT_STATUS_ERR_CURRENT_LIMIT_ERR_Msk (0x01UL << SDMMC_INT_STATUS_ERR_CURRENT_LIMIT_ERR_Pos)/*!< SDMMC INT_STATUS_ERR: CURRENT_LIMIT_ERR Mask */
#define SDMMC_INT_STATUS_ERR_ACMD_ERR_Pos     8                                                       /*!< SDMMC INT_STATUS_ERR: ACMD_ERR Position */
#define SDMMC_INT_STATUS_ERR_ACMD_ERR_Msk     (0x01UL << SDMMC_INT_STATUS_ERR_ACMD_ERR_Pos)           /*!< SDMMC INT_STATUS_ERR: ACMD_ERR Mask     */
#define SDMMC_INT_STATUS_ERR_CEATA_ERR_Pos    13                                                      /*!< SDMMC INT_STATUS_ERR: CEATA_ERR Position */
#define SDMMC_INT_STATUS_ERR_CEATA_ERR_Msk    (0x01UL << SDMMC_INT_STATUS_ERR_CEATA_ERR_Pos)          /*!< SDMMC INT_STATUS_ERR: CEATA_ERR Mask    */

/* --------------------------  SDMMC_EN_INT_STATUS_NORM  -------------------------- */
#define SDMMC_EN_INT_STATUS_NORM_CMD_COMPLETE_EN_Pos 0                                                /*!< SDMMC EN_INT_STATUS_NORM: CMD_COMPLETE_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_CMD_COMPLETE_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_CMD_COMPLETE_EN_Pos)/*!< SDMMC EN_INT_STATUS_NORM: CMD_COMPLETE_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_TX_COMPLETE_EN_Pos 1                                                 /*!< SDMMC EN_INT_STATUS_NORM: TX_COMPLETE_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_TX_COMPLETE_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_TX_COMPLETE_EN_Pos)/*!< SDMMC EN_INT_STATUS_NORM: TX_COMPLETE_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_BLOCK_GAP_EVENT_EN_Pos 2                                             /*!< SDMMC EN_INT_STATUS_NORM: BLOCK_GAP_EVENT_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_BLOCK_GAP_EVENT_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_BLOCK_GAP_EVENT_EN_Pos)/*!< SDMMC EN_INT_STATUS_NORM: BLOCK_GAP_EVENT_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_WRITE_READY_EN_Pos 4                                            /*!< SDMMC EN_INT_STATUS_NORM: BUFF_WRITE_READY_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_WRITE_READY_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_BUFF_WRITE_READY_EN_Pos)/*!< SDMMC EN_INT_STATUS_NORM: BUFF_WRITE_READY_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_READ_READY_EN_Pos 5                                             /*!< SDMMC EN_INT_STATUS_NORM: BUFF_READ_READY_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_READ_READY_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_BUFF_READ_READY_EN_Pos)/*!< SDMMC EN_INT_STATUS_NORM: BUFF_READ_READY_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INS_EN_Pos 6                                                    /*!< SDMMC EN_INT_STATUS_NORM: CARD_INS_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INS_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_CARD_INS_EN_Pos) /*!< SDMMC EN_INT_STATUS_NORM: CARD_INS_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_CARD_REMOVAL_EN_Pos 7                                                /*!< SDMMC EN_INT_STATUS_NORM: CARD_REMOVAL_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_CARD_REMOVAL_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_CARD_REMOVAL_EN_Pos)/*!< SDMMC EN_INT_STATUS_NORM: CARD_REMOVAL_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INT_EN_Pos 8                                                    /*!< SDMMC EN_INT_STATUS_NORM: CARD_INT_EN Position */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INT_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_CARD_INT_EN_Pos) /*!< SDMMC EN_INT_STATUS_NORM: CARD_INT_EN Mask */
#define SDMMC_EN_INT_STATUS_NORM_FIXED_TO_0_Pos 15                                                    /*!< SDMMC EN_INT_STATUS_NORM: FIXED_TO_0 Position */
#define SDMMC_EN_INT_STATUS_NORM_FIXED_TO_0_Msk (0x01UL << SDMMC_EN_INT_STATUS_NORM_FIXED_TO_0_Pos)   /*!< SDMMC EN_INT_STATUS_NORM: FIXED_TO_0 Mask */

/* ---------------------------  SDMMC_EN_INT_STATUS_ERR  -------------------------- */
#define SDMMC_EN_INT_STATUS_ERR_CMD_TIMEOUT_ERR_EN_Pos 0                                              /*!< SDMMC EN_INT_STATUS_ERR: CMD_TIMEOUT_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_CMD_TIMEOUT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_CMD_TIMEOUT_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: CMD_TIMEOUT_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_CMD_CRC_ERR_EN_Pos 1                                                  /*!< SDMMC EN_INT_STATUS_ERR: CMD_CRC_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_CMD_CRC_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_CMD_CRC_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: CMD_CRC_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_CMD_END_BIT_ERR_EN_Pos 2                                              /*!< SDMMC EN_INT_STATUS_ERR: CMD_END_BIT_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_CMD_END_BIT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_CMD_END_BIT_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: CMD_END_BIT_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_CMD_IND_ERR_EN_Pos 3                                                  /*!< SDMMC EN_INT_STATUS_ERR: CMD_IND_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_CMD_IND_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_CMD_IND_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: CMD_IND_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_DATA_TIMEOUT_ERR_EN_Pos 4                                             /*!< SDMMC EN_INT_STATUS_ERR: DATA_TIMEOUT_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_DATA_TIMEOUT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_DATA_TIMEOUT_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: DATA_TIMEOUT_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_DATA_CRC_ERR_EN_Pos 5                                                 /*!< SDMMC EN_INT_STATUS_ERR: DATA_CRC_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_DATA_CRC_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_DATA_CRC_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: DATA_CRC_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_DATA_END_BIT_ERR_EN_Pos 6                                             /*!< SDMMC EN_INT_STATUS_ERR: DATA_END_BIT_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_DATA_END_BIT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_DATA_END_BIT_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: DATA_END_BIT_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_CURRENT_LIMIT_ERR_EN_Pos 7                                            /*!< SDMMC EN_INT_STATUS_ERR: CURRENT_LIMIT_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_CURRENT_LIMIT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_CURRENT_LIMIT_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: CURRENT_LIMIT_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_ACMD_ERR_EN_Pos 8                                                     /*!< SDMMC EN_INT_STATUS_ERR: ACMD_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_ACMD_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_ACMD_ERR_EN_Pos)   /*!< SDMMC EN_INT_STATUS_ERR: ACMD_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_TARGET_RESP_ERR_EN_Pos 12                                             /*!< SDMMC EN_INT_STATUS_ERR: TARGET_RESP_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_TARGET_RESP_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_TARGET_RESP_ERR_EN_Pos)/*!< SDMMC EN_INT_STATUS_ERR: TARGET_RESP_ERR_EN Mask */
#define SDMMC_EN_INT_STATUS_ERR_CEATA_ERR_EN_Pos 13                                                   /*!< SDMMC EN_INT_STATUS_ERR: CEATA_ERR_EN Position */
#define SDMMC_EN_INT_STATUS_ERR_CEATA_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_STATUS_ERR_CEATA_ERR_EN_Pos) /*!< SDMMC EN_INT_STATUS_ERR: CEATA_ERR_EN Mask */

/* --------------------------  SDMMC_EN_INT_SIGNAL_NORM  -------------------------- */
#define SDMMC_EN_INT_SIGNAL_NORM_CMD_COMPLETE_EN_Pos 0                                                /*!< SDMMC EN_INT_SIGNAL_NORM: CMD_COMPLETE_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_CMD_COMPLETE_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_CMD_COMPLETE_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_NORM: CMD_COMPLETE_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_TX_COMPLETE_EN_Pos 1                                                 /*!< SDMMC EN_INT_SIGNAL_NORM: TX_COMPLETE_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_TX_COMPLETE_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_TX_COMPLETE_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_NORM: TX_COMPLETE_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_BLOCK_GAP_EVENT_EN_Pos 2                                             /*!< SDMMC EN_INT_SIGNAL_NORM: BLOCK_GAP_EVENT_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_BLOCK_GAP_EVENT_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_BLOCK_GAP_EVENT_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_NORM: BLOCK_GAP_EVENT_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_WRITE_READY_EN_Pos 4                                            /*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_WRITE_READY_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_WRITE_READY_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_BUFF_WRITE_READY_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_WRITE_READY_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_READ_READY_EN_Pos 5                                             /*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_READ_READY_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_READ_READY_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_BUFF_READ_READY_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_READ_READY_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INS_EN_Pos 6                                                    /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INS_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INS_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_CARD_INS_EN_Pos) /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INS_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_REMOVAL_EN_Pos 7                                                /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_REMOVAL_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_REMOVAL_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_CARD_REMOVAL_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_NORM: CARD_REMOVAL_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INT_EN_Pos 8                                                    /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INT_EN Position */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INT_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_CARD_INT_EN_Pos) /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INT_EN Mask */
#define SDMMC_EN_INT_SIGNAL_NORM_FIXED_TO_0_Pos 15                                                    /*!< SDMMC EN_INT_SIGNAL_NORM: FIXED_TO_0 Position */
#define SDMMC_EN_INT_SIGNAL_NORM_FIXED_TO_0_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_NORM_FIXED_TO_0_Pos)   /*!< SDMMC EN_INT_SIGNAL_NORM: FIXED_TO_0 Mask */

/* ---------------------------  SDMMC_EN_INT_SIGNAL_ERR  -------------------------- */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_TIMEOUT_ERR_EN_Pos 0                                              /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_TIMEOUT_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_TIMEOUT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_CMD_TIMEOUT_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: CMD_TIMEOUT_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_CRC_ERR_EN_Pos 1                                                  /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_CRC_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_CRC_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_CMD_CRC_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: CMD_CRC_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_END_BIT_ERR_EN_Pos 2                                              /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_END_BIT_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_END_BIT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_CMD_END_BIT_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: CMD_END_BIT_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_IND_ERR_EN_Pos 3                                                  /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_IND_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_IND_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_CMD_IND_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: CMD_IND_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_TIMEOUT_ERR_EN_Pos 4                                             /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_TIMEOUT_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_TIMEOUT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_DATA_TIMEOUT_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: DATA_TIMEOUT_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_CRC_ERR_EN_Pos 5                                                 /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_CRC_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_CRC_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_DATA_CRC_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: DATA_CRC_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_END_BIT_ERR_EN_Pos 6                                             /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_END_BIT_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_END_BIT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_DATA_END_BIT_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: DATA_END_BIT_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_CURRENT_LIMIT_ERR_EN_Pos 7                                            /*!< SDMMC EN_INT_SIGNAL_ERR: CURRENT_LIMIT_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_CURRENT_LIMIT_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_CURRENT_LIMIT_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: CURRENT_LIMIT_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_ACMD_ERR_EN_Pos 8                                                     /*!< SDMMC EN_INT_SIGNAL_ERR: ACMD_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_ACMD_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_ACMD_ERR_EN_Pos)   /*!< SDMMC EN_INT_SIGNAL_ERR: ACMD_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_TARGET_RESP_ERR_EN_Pos 12                                             /*!< SDMMC EN_INT_SIGNAL_ERR: TARGET_RESP_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_TARGET_RESP_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_TARGET_RESP_ERR_EN_Pos)/*!< SDMMC EN_INT_SIGNAL_ERR: TARGET_RESP_ERR_EN Mask */
#define SDMMC_EN_INT_SIGNAL_ERR_CEATA_ERR_EN_Pos 13                                                   /*!< SDMMC EN_INT_SIGNAL_ERR: CEATA_ERR_EN Position */
#define SDMMC_EN_INT_SIGNAL_ERR_CEATA_ERR_EN_Msk (0x01UL << SDMMC_EN_INT_SIGNAL_ERR_CEATA_ERR_EN_Pos) /*!< SDMMC EN_INT_SIGNAL_ERR: CEATA_ERR_EN Mask */

