FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ----------------------------  SDMMC_ACMD_ERR_STATUS  --------------------------- */
#define SDMMC_ACMD_ERR_STATUS_ACMD12_NOT_EXEC_ERR_Pos 0                                               /*!< SDMMC ACMD_ERR_STATUS: ACMD12_NOT_EXEC_ERR Position */
#define SDMMC_ACMD_ERR_STATUS_ACMD12_NOT_EXEC_ERR_Msk (0x01UL << SDMMC_ACMD_ERR_STATUS_ACMD12_NOT_EXEC_ERR_Pos)/*!< SDMMC ACMD_ERR_STATUS: ACMD12_NOT_EXEC_ERR Mask */
#define SDMMC_ACMD_ERR_STATUS_ACMD_TIMEOUT_ERR_Pos 1                                                  /*!< SDMMC ACMD_ERR_STATUS: ACMD_TIMEOUT_ERR Position */
#define SDMMC_ACMD_ERR_STATUS_ACMD_TIMEOUT_ERR_Msk (0x01UL << SDMMC_ACMD_ERR_STATUS_ACMD_TIMEOUT_ERR_Pos)/*!< SDMMC ACMD_ERR_STATUS: ACMD_TIMEOUT_ERR Mask */
#define SDMMC_ACMD_ERR_STATUS_ACMD_CRC_ERR_Pos 2                                                      /*!< SDMMC ACMD_ERR_STATUS: ACMD_CRC_ERR Position */
#define SDMMC_ACMD_ERR_STATUS_ACMD_CRC_ERR_Msk (0x01UL << SDMMC_ACMD_ERR_STATUS_ACMD_CRC_ERR_Pos)     /*!< SDMMC ACMD_ERR_STATUS: ACMD_CRC_ERR Mask */
#define SDMMC_ACMD_ERR_STATUS_ACMD_END_BIT_ERR_Pos 3                                                  /*!< SDMMC ACMD_ERR_STATUS: ACMD_END_BIT_ERR Position */
#define SDMMC_ACMD_ERR_STATUS_ACMD_END_BIT_ERR_Msk (0x01UL << SDMMC_ACMD_ERR_STATUS_ACMD_END_BIT_ERR_Pos)/*!< SDMMC ACMD_ERR_STATUS: ACMD_END_BIT_ERR Mask */
#define SDMMC_ACMD_ERR_STATUS_ACMD_IND_ERR_Pos 4                                                      /*!< SDMMC ACMD_ERR_STATUS: ACMD_IND_ERR Position */
#define SDMMC_ACMD_ERR_STATUS_ACMD_IND_ERR_Msk (0x01UL << SDMMC_ACMD_ERR_STATUS_ACMD_IND_ERR_Pos)     /*!< SDMMC ACMD_ERR_STATUS: ACMD_IND_ERR Mask */
#define SDMMC_ACMD_ERR_STATUS_CMD_NOT_ISSUED_BY_ACMD12_ERR_Pos 7                                      /*!< SDMMC ACMD_ERR_STATUS: CMD_NOT_ISSUED_BY_ACMD12_ERR Position */
#define SDMMC_ACMD_ERR_STATUS_CMD_NOT_ISSUED_BY_ACMD12_ERR_Msk (0x01UL << SDMMC_ACMD_ERR_STATUS_CMD_NOT_ISSUED_BY_ACMD12_ERR_Pos)/*!< SDMMC ACMD_ERR_STATUS: CMD_NOT_ISSUED_BY_ACMD12_ERR Mask */

/* ----------------------  SDMMC_FORCE_EVENT_ACMD_ERR_STATUS  --------------------- */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_NOT_EXEC_Pos 0                                      /*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_NOT_EXEC Position */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_NOT_EXEC_Msk (0x01UL << SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_NOT_EXEC_Pos)/*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_NOT_EXEC Mask */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_TIMEOUT_ERR_Pos 1                                   /*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_TIMEOUT_ERR Position */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_TIMEOUT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_TIMEOUT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_TIMEOUT_ERR Mask */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_CRC_ERR_Pos 2                                       /*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_CRC_ERR Position */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_CRC_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_CRC_ERR_Pos)/*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_CRC_ERR Mask */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_END_BIT_ERR_Pos 3                                   /*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_END_BIT_ERR Position */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_END_BIT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_END_BIT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_END_BIT_ERR Mask */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_IND_ERR_Pos 4                                       /*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_IND_ERR Position */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_IND_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_ACMD_IND_ERR_Pos)/*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_ACMD_IND_ERR Mask */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_CMD_NOT_ISSUED_ACMD12_ERR_Pos 7                          /*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_CMD_NOT_ISSUED_ACMD12_ERR
                                                         Position                                                                                  */
#define SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_CMD_NOT_ISSUED_ACMD12_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ACMD_ERR_STATUS_FE_CMD_NOT_ISSUED_ACMD12_ERR_Pos)/*!< SDMMC FORCE_EVENT_ACMD_ERR_STATUS: FE_CMD_NOT_ISSUED_ACMD12_ERR
                                                         Mask                                                                                      */

/* ------------------------  SDMMC_FORCE_EVENT_ERR_STATUS  ------------------------ */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_TIMEOUT_ERR_Pos 0                                         /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_TIMEOUT_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_TIMEOUT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_TIMEOUT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_TIMEOUT_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_CRC_ERR_Pos 1                                             /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_CRC_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_CRC_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_CRC_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_CRC_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_END_BIT_ERR_Pos 2                                         /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_END_BIT_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_END_BIT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_END_BIT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_END_BIT_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_IND_ERR_Pos 3                                             /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_IND_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_IND_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_IND_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_IND_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_TIMEOUT_ERR_Pos 4                                        /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_TIMEOUT_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_TIMEOUT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_TIMEOUT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_TIMEOUT_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_CRC_ERR_Pos 5                                            /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_CRC_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_CRC_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_CRC_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_CRC_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_END_BIT_ERR_Pos 6                                        /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_END_BIT_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_END_BIT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_END_BIT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_END_BIT_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CURRENT_LIMIT_ERR_Pos 7                                       /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CURRENT_LIMIT_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CURRENT_LIMIT_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_CURRENT_LIMIT_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CURRENT_LIMIT_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_ACMD12_ERR_Pos 8                                              /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_ACMD12_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_ACMD12_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_ACMD12_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_ACMD12_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_TARGET_RESPONSE_ERR_Pos 12                                    /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_TARGET_RESPONSE_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_TARGET_RESPONSE_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_TARGET_RESPONSE_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_TARGET_RESPONSE_ERR Mask */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CEATA_ERR_Pos 13                                              /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CEATA_ERR Position */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CEATA_ERR_Msk (0x01UL << SDMMC_FORCE_EVENT_ERR_STATUS_FE_CEATA_ERR_Pos)/*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CEATA_ERR Mask */

/* -------------------------------  SDMMC_DEBUG_SEL  ------------------------------ */
#define SDMMC_DEBUG_SEL_DEBUG_SEL_Pos         0                                                       /*!< SDMMC DEBUG_SEL: DEBUG_SEL Position     */
#define SDMMC_DEBUG_SEL_DEBUG_SEL_Msk         (0x01UL << SDMMC_DEBUG_SEL_DEBUG_SEL_Pos)               /*!< SDMMC DEBUG_SEL: DEBUG_SEL Mask         */

/* ----------------------------------  SDMMC_SPI  --------------------------------- */
#define SDMMC_SPI_SPI_INT_SUPPORT_Pos         0                                                       /*!< SDMMC SPI: SPI_INT_SUPPORT Position     */
#define SDMMC_SPI_SPI_INT_SUPPORT_Msk         (0x000000ffUL << SDMMC_SPI_SPI_INT_SUPPORT_Pos)         /*!< SDMMC SPI: SPI_INT_SUPPORT Mask         */

