FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ----------------------------  SDMMC_SLOT_INT_STATUS  --------------------------- */
#define SDMMC_SLOT_INT_STATUS_SLOT_INT_STATUS_Pos 0                                                   /*!< SDMMC SLOT_INT_STATUS: SLOT_INT_STATUS Position */
#define SDMMC_SLOT_INT_STATUS_SLOT_INT_STATUS_Msk (0x000000ffUL << SDMMC_SLOT_INT_STATUS_SLOT_INT_STATUS_Pos)/*!< SDMMC SLOT_INT_STATUS: SLOT_INT_STATUS Mask */


/* ================================================================================ */
/* ================          struct 'EBU' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  EBU_CLC  ---------------------------------- */
#define EBU_CLC_DISR_Pos                      0                                                       /*!< EBU CLC: DISR Position                  */
#define EBU_CLC_DISR_Msk                      (0x01UL << EBU_CLC_DISR_Pos)                            /*!< EBU CLC: DISR Mask                      */
#define EBU_CLC_DISS_Pos                      1                                                       /*!< EBU CLC: DISS Position                  */
#define EBU_CLC_DISS_Msk                      (0x01UL << EBU_CLC_DISS_Pos)                            /*!< EBU CLC: DISS Mask                      */
#define EBU_CLC_SYNC_Pos                      16                                                      /*!< EBU CLC: SYNC Position                  */
#define EBU_CLC_SYNC_Msk                      (0x01UL << EBU_CLC_SYNC_Pos)                            /*!< EBU CLC: SYNC Mask                      */
#define EBU_CLC_DIV2_Pos                      17                                                      /*!< EBU CLC: DIV2 Position                  */
#define EBU_CLC_DIV2_Msk                      (0x01UL << EBU_CLC_DIV2_Pos)                            /*!< EBU CLC: DIV2 Mask                      */
#define EBU_CLC_EBUDIV_Pos                    18                                                      /*!< EBU CLC: EBUDIV Position                */
#define EBU_CLC_EBUDIV_Msk                    (0x03UL << EBU_CLC_EBUDIV_Pos)                          /*!< EBU CLC: EBUDIV Mask                    */
#define EBU_CLC_SYNCACK_Pos                   20                                                      /*!< EBU CLC: SYNCACK Position               */
#define EBU_CLC_SYNCACK_Msk                   (0x01UL << EBU_CLC_SYNCACK_Pos)                         /*!< EBU CLC: SYNCACK Mask                   */
#define EBU_CLC_DIV2ACK_Pos                   21                                                      /*!< EBU CLC: DIV2ACK Position               */
#define EBU_CLC_DIV2ACK_Msk                   (0x01UL << EBU_CLC_DIV2ACK_Pos)                         /*!< EBU CLC: DIV2ACK Mask                   */
#define EBU_CLC_EBUDIVACK_Pos                 22                                                      /*!< EBU CLC: EBUDIVACK Position             */
#define EBU_CLC_EBUDIVACK_Msk                 (0x03UL << EBU_CLC_EBUDIVACK_Pos)                       /*!< EBU CLC: EBUDIVACK Mask                 */

/* ---------------------------------  EBU_MODCON  --------------------------------- */
#define EBU_MODCON_STS_Pos                    0                                                       /*!< EBU MODCON: STS Position                */
#define EBU_MODCON_STS_Msk                    (0x01UL << EBU_MODCON_STS_Pos)                          /*!< EBU MODCON: STS Mask                    */
#define EBU_MODCON_LCKABRT_Pos                1                                                       /*!< EBU MODCON: LCKABRT Position            */
#define EBU_MODCON_LCKABRT_Msk                (0x01UL << EBU_MODCON_LCKABRT_Pos)                      /*!< EBU MODCON: LCKABRT Mask                */
#define EBU_MODCON_SDTRI_Pos                  2                                                       /*!< EBU MODCON: SDTRI Position              */
#define EBU_MODCON_SDTRI_Msk                  (0x01UL << EBU_MODCON_SDTRI_Pos)                        /*!< EBU MODCON: SDTRI Mask                  */
#define EBU_MODCON_EXTLOCK_Pos                4                                                       /*!< EBU MODCON: EXTLOCK Position            */
#define EBU_MODCON_EXTLOCK_Msk                (0x01UL << EBU_MODCON_EXTLOCK_Pos)                      /*!< EBU MODCON: EXTLOCK Mask                */
#define EBU_MODCON_ARBSYNC_Pos                5                                                       /*!< EBU MODCON: ARBSYNC Position            */
#define EBU_MODCON_ARBSYNC_Msk                (0x01UL << EBU_MODCON_ARBSYNC_Pos)                      /*!< EBU MODCON: ARBSYNC Mask                */
#define EBU_MODCON_ARBMODE_Pos                6                                                       /*!< EBU MODCON: ARBMODE Position            */
#define EBU_MODCON_ARBMODE_Msk                (0x03UL << EBU_MODCON_ARBMODE_Pos)                      /*!< EBU MODCON: ARBMODE Mask                */
#define EBU_MODCON_TIMEOUTC_Pos               8                                                       /*!< EBU MODCON: TIMEOUTC Position           */
#define EBU_MODCON_TIMEOUTC_Msk               (0x000000ffUL << EBU_MODCON_TIMEOUTC_Pos)               /*!< EBU MODCON: TIMEOUTC Mask               */
#define EBU_MODCON_LOCKTIMEOUT_Pos            16                                                      /*!< EBU MODCON: LOCKTIMEOUT Position        */
#define EBU_MODCON_LOCKTIMEOUT_Msk            (0x000000ffUL << EBU_MODCON_LOCKTIMEOUT_Pos)            /*!< EBU MODCON: LOCKTIMEOUT Mask            */
#define EBU_MODCON_GLOBALCS_Pos               24                                                      /*!< EBU MODCON: GLOBALCS Position           */
#define EBU_MODCON_GLOBALCS_Msk               (0x0fUL << EBU_MODCON_GLOBALCS_Pos)                     /*!< EBU MODCON: GLOBALCS Mask               */
#define EBU_MODCON_ACCSINH_Pos                28                                                      /*!< EBU MODCON: ACCSINH Position            */
#define EBU_MODCON_ACCSINH_Msk                (0x01UL << EBU_MODCON_ACCSINH_Pos)                      /*!< EBU MODCON: ACCSINH Mask                */
#define EBU_MODCON_ACCSINHACK_Pos             29                                                      /*!< EBU MODCON: ACCSINHACK Position         */
#define EBU_MODCON_ACCSINHACK_Msk             (0x01UL << EBU_MODCON_ACCSINHACK_Pos)                   /*!< EBU MODCON: ACCSINHACK Mask             */
#define EBU_MODCON_ALE_Pos                    31                                                      /*!< EBU MODCON: ALE Position                */
#define EBU_MODCON_ALE_Msk                    (0x01UL << EBU_MODCON_ALE_Pos)                          /*!< EBU MODCON: ALE Mask                    */

/* -----------------------------------  EBU_ID  ----------------------------------- */
#define EBU_ID_MOD_REV_Pos                    0                                                       /*!< EBU ID: MOD_REV Position                */
#define EBU_ID_MOD_REV_Msk                    (0x000000ffUL << EBU_ID_MOD_REV_Pos)                    /*!< EBU ID: MOD_REV Mask                    */
#define EBU_ID_MOD_TYPE_Pos                   8                                                       /*!< EBU ID: MOD_TYPE Position               */
#define EBU_ID_MOD_TYPE_Msk                   (0x000000ffUL << EBU_ID_MOD_TYPE_Pos)                   /*!< EBU ID: MOD_TYPE Mask                   */
#define EBU_ID_MOD_NUMBER_Pos                 16                                                      /*!< EBU ID: MOD_NUMBER Position             */
#define EBU_ID_MOD_NUMBER_Msk                 (0x0000ffffUL << EBU_ID_MOD_NUMBER_Pos)                 /*!< EBU ID: MOD_NUMBER Mask                 */

/* ---------------------------------  EBU_USERCON  -------------------------------- */
#define EBU_USERCON_DIP_Pos                   0                                                       /*!< EBU USERCON: DIP Position               */
#define EBU_USERCON_DIP_Msk                   (0x01UL << EBU_USERCON_DIP_Pos)                         /*!< EBU USERCON: DIP Mask                   */
#define EBU_USERCON_ADDIO_Pos                 16                                                      /*!< EBU USERCON: ADDIO Position             */
#define EBU_USERCON_ADDIO_Msk                 (0x000001ffUL << EBU_USERCON_ADDIO_Pos)                 /*!< EBU USERCON: ADDIO Mask                 */
#define EBU_USERCON_ADVIO_Pos                 25                                                      /*!< EBU USERCON: ADVIO Position             */
#define EBU_USERCON_ADVIO_Msk                 (0x01UL << EBU_USERCON_ADVIO_Pos)                       /*!< EBU USERCON: ADVIO Mask                 */

/* --------------------------------  EBU_ADDRSEL0  -------------------------------- */
#define EBU_ADDRSEL0_REGENAB_Pos              0                                                       /*!< EBU ADDRSEL0: REGENAB Position          */
#define EBU_ADDRSEL0_REGENAB_Msk              (0x01UL << EBU_ADDRSEL0_REGENAB_Pos)                    /*!< EBU ADDRSEL0: REGENAB Mask              */
#define EBU_ADDRSEL0_ALTENAB_Pos              1                                                       /*!< EBU ADDRSEL0: ALTENAB Position          */
#define EBU_ADDRSEL0_ALTENAB_Msk              (0x01UL << EBU_ADDRSEL0_ALTENAB_Pos)                    /*!< EBU ADDRSEL0: ALTENAB Mask              */
#define EBU_ADDRSEL0_WPROT_Pos                2                                                       /*!< EBU ADDRSEL0: WPROT Position            */
#define EBU_ADDRSEL0_WPROT_Msk                (0x01UL << EBU_ADDRSEL0_WPROT_Pos)                      /*!< EBU ADDRSEL0: WPROT Mask                */

/* --------------------------------  EBU_ADDRSEL1  -------------------------------- */
#define EBU_ADDRSEL1_REGENAB_Pos              0                                                       /*!< EBU ADDRSEL1: REGENAB Position          */
#define EBU_ADDRSEL1_REGENAB_Msk              (0x01UL << EBU_ADDRSEL1_REGENAB_Pos)                    /*!< EBU ADDRSEL1: REGENAB Mask              */
#define EBU_ADDRSEL1_ALTENAB_Pos              1                                                       /*!< EBU ADDRSEL1: ALTENAB Position          */
#define EBU_ADDRSEL1_ALTENAB_Msk              (0x01UL << EBU_ADDRSEL1_ALTENAB_Pos)                    /*!< EBU ADDRSEL1: ALTENAB Mask              */
#define EBU_ADDRSEL1_WPROT_Pos                2                                                       /*!< EBU ADDRSEL1: WPROT Position            */
#define EBU_ADDRSEL1_WPROT_Msk                (0x01UL << EBU_ADDRSEL1_WPROT_Pos)                      /*!< EBU ADDRSEL1: WPROT Mask                */

