FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* --------------------------------  EBU_ADDRSEL2  -------------------------------- */
#define EBU_ADDRSEL2_REGENAB_Pos              0                                                       /*!< EBU ADDRSEL2: REGENAB Position          */
#define EBU_ADDRSEL2_REGENAB_Msk              (0x01UL << EBU_ADDRSEL2_REGENAB_Pos)                    /*!< EBU ADDRSEL2: REGENAB Mask              */
#define EBU_ADDRSEL2_ALTENAB_Pos              1                                                       /*!< EBU ADDRSEL2: ALTENAB Position          */
#define EBU_ADDRSEL2_ALTENAB_Msk              (0x01UL << EBU_ADDRSEL2_ALTENAB_Pos)                    /*!< EBU ADDRSEL2: ALTENAB Mask              */
#define EBU_ADDRSEL2_WPROT_Pos                2                                                       /*!< EBU ADDRSEL2: WPROT Position            */
#define EBU_ADDRSEL2_WPROT_Msk                (0x01UL << EBU_ADDRSEL2_WPROT_Pos)                      /*!< EBU ADDRSEL2: WPROT Mask                */

/* --------------------------------  EBU_ADDRSEL3  -------------------------------- */
#define EBU_ADDRSEL3_REGENAB_Pos              0                                                       /*!< EBU ADDRSEL3: REGENAB Position          */
#define EBU_ADDRSEL3_REGENAB_Msk              (0x01UL << EBU_ADDRSEL3_REGENAB_Pos)                    /*!< EBU ADDRSEL3: REGENAB Mask              */
#define EBU_ADDRSEL3_ALTENAB_Pos              1                                                       /*!< EBU ADDRSEL3: ALTENAB Position          */
#define EBU_ADDRSEL3_ALTENAB_Msk              (0x01UL << EBU_ADDRSEL3_ALTENAB_Pos)                    /*!< EBU ADDRSEL3: ALTENAB Mask              */
#define EBU_ADDRSEL3_WPROT_Pos                2                                                       /*!< EBU ADDRSEL3: WPROT Position            */
#define EBU_ADDRSEL3_WPROT_Msk                (0x01UL << EBU_ADDRSEL3_WPROT_Pos)                      /*!< EBU ADDRSEL3: WPROT Mask                */

/* --------------------------------  EBU_BUSRCON0  -------------------------------- */
#define EBU_BUSRCON0_FETBLEN_Pos              0                                                       /*!< EBU BUSRCON0: FETBLEN Position          */
#define EBU_BUSRCON0_FETBLEN_Msk              (0x07UL << EBU_BUSRCON0_FETBLEN_Pos)                    /*!< EBU BUSRCON0: FETBLEN Mask              */
#define EBU_BUSRCON0_FBBMSEL_Pos              3                                                       /*!< EBU BUSRCON0: FBBMSEL Position          */
#define EBU_BUSRCON0_FBBMSEL_Msk              (0x01UL << EBU_BUSRCON0_FBBMSEL_Pos)                    /*!< EBU BUSRCON0: FBBMSEL Mask              */
#define EBU_BUSRCON0_BFSSS_Pos                4                                                       /*!< EBU BUSRCON0: BFSSS Position            */
#define EBU_BUSRCON0_BFSSS_Msk                (0x01UL << EBU_BUSRCON0_BFSSS_Pos)                      /*!< EBU BUSRCON0: BFSSS Mask                */
#define EBU_BUSRCON0_FDBKEN_Pos               5                                                       /*!< EBU BUSRCON0: FDBKEN Position           */
#define EBU_BUSRCON0_FDBKEN_Msk               (0x01UL << EBU_BUSRCON0_FDBKEN_Pos)                     /*!< EBU BUSRCON0: FDBKEN Mask               */
#define EBU_BUSRCON0_BFCMSEL_Pos              6                                                       /*!< EBU BUSRCON0: BFCMSEL Position          */
#define EBU_BUSRCON0_BFCMSEL_Msk              (0x01UL << EBU_BUSRCON0_BFCMSEL_Pos)                    /*!< EBU BUSRCON0: BFCMSEL Mask              */
#define EBU_BUSRCON0_NAA_Pos                  7                                                       /*!< EBU BUSRCON0: NAA Position              */
#define EBU_BUSRCON0_NAA_Msk                  (0x01UL << EBU_BUSRCON0_NAA_Pos)                        /*!< EBU BUSRCON0: NAA Mask                  */
#define EBU_BUSRCON0_ECSE_Pos                 16                                                      /*!< EBU BUSRCON0: ECSE Position             */
#define EBU_BUSRCON0_ECSE_Msk                 (0x01UL << EBU_BUSRCON0_ECSE_Pos)                       /*!< EBU BUSRCON0: ECSE Mask                 */
#define EBU_BUSRCON0_EBSE_Pos                 17                                                      /*!< EBU BUSRCON0: EBSE Position             */
#define EBU_BUSRCON0_EBSE_Msk                 (0x01UL << EBU_BUSRCON0_EBSE_Pos)                       /*!< EBU BUSRCON0: EBSE Mask                 */
#define EBU_BUSRCON0_DBA_Pos                  18                                                      /*!< EBU BUSRCON0: DBA Position              */
#define EBU_BUSRCON0_DBA_Msk                  (0x01UL << EBU_BUSRCON0_DBA_Pos)                        /*!< EBU BUSRCON0: DBA Mask                  */
#define EBU_BUSRCON0_WAITINV_Pos              19                                                      /*!< EBU BUSRCON0: WAITINV Position          */
#define EBU_BUSRCON0_WAITINV_Msk              (0x01UL << EBU_BUSRCON0_WAITINV_Pos)                    /*!< EBU BUSRCON0: WAITINV Mask              */
#define EBU_BUSRCON0_BCGEN_Pos                20                                                      /*!< EBU BUSRCON0: BCGEN Position            */
#define EBU_BUSRCON0_BCGEN_Msk                (0x03UL << EBU_BUSRCON0_BCGEN_Pos)                      /*!< EBU BUSRCON0: BCGEN Mask                */
#define EBU_BUSRCON0_PORTW_Pos                22                                                      /*!< EBU BUSRCON0: PORTW Position            */
#define EBU_BUSRCON0_PORTW_Msk                (0x03UL << EBU_BUSRCON0_PORTW_Pos)                      /*!< EBU BUSRCON0: PORTW Mask                */
#define EBU_BUSRCON0_WAIT_Pos                 24                                                      /*!< EBU BUSRCON0: WAIT Position             */
#define EBU_BUSRCON0_WAIT_Msk                 (0x03UL << EBU_BUSRCON0_WAIT_Pos)                       /*!< EBU BUSRCON0: WAIT Mask                 */
#define EBU_BUSRCON0_AAP_Pos                  26                                                      /*!< EBU BUSRCON0: AAP Position              */
#define EBU_BUSRCON0_AAP_Msk                  (0x01UL << EBU_BUSRCON0_AAP_Pos)                        /*!< EBU BUSRCON0: AAP Mask                  */
#define EBU_BUSRCON0_AGEN_Pos                 28                                                      /*!< EBU BUSRCON0: AGEN Position             */
#define EBU_BUSRCON0_AGEN_Msk                 (0x0fUL << EBU_BUSRCON0_AGEN_Pos)                       /*!< EBU BUSRCON0: AGEN Mask                 */

