FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ---------------------------------  EBU_BUSRAP0  -------------------------------- */
#define EBU_BUSRAP0_RDDTACS_Pos               0                                                       /*!< EBU BUSRAP0: RDDTACS Position           */
#define EBU_BUSRAP0_RDDTACS_Msk               (0x0fUL << EBU_BUSRAP0_RDDTACS_Pos)                     /*!< EBU BUSRAP0: RDDTACS Mask               */
#define EBU_BUSRAP0_RDRECOVC_Pos              4                                                       /*!< EBU BUSRAP0: RDRECOVC Position          */
#define EBU_BUSRAP0_RDRECOVC_Msk              (0x07UL << EBU_BUSRAP0_RDRECOVC_Pos)                    /*!< EBU BUSRAP0: RDRECOVC Mask              */
#define EBU_BUSRAP0_WAITRDC_Pos               7                                                       /*!< EBU BUSRAP0: WAITRDC Position           */
#define EBU_BUSRAP0_WAITRDC_Msk               (0x1fUL << EBU_BUSRAP0_WAITRDC_Pos)                     /*!< EBU BUSRAP0: WAITRDC Mask               */
#define EBU_BUSRAP0_DATAC_Pos                 12                                                      /*!< EBU BUSRAP0: DATAC Position             */
#define EBU_BUSRAP0_DATAC_Msk                 (0x0fUL << EBU_BUSRAP0_DATAC_Pos)                       /*!< EBU BUSRAP0: DATAC Mask                 */
#define EBU_BUSRAP0_EXTCLOCK_Pos              16                                                      /*!< EBU BUSRAP0: EXTCLOCK Position          */
#define EBU_BUSRAP0_EXTCLOCK_Msk              (0x03UL << EBU_BUSRAP0_EXTCLOCK_Pos)                    /*!< EBU BUSRAP0: EXTCLOCK Mask              */
#define EBU_BUSRAP0_EXTDATA_Pos               18                                                      /*!< EBU BUSRAP0: EXTDATA Position           */
#define EBU_BUSRAP0_EXTDATA_Msk               (0x03UL << EBU_BUSRAP0_EXTDATA_Pos)                     /*!< EBU BUSRAP0: EXTDATA Mask               */
#define EBU_BUSRAP0_CMDDELAY_Pos              20                                                      /*!< EBU BUSRAP0: CMDDELAY Position          */
#define EBU_BUSRAP0_CMDDELAY_Msk              (0x0fUL << EBU_BUSRAP0_CMDDELAY_Pos)                    /*!< EBU BUSRAP0: CMDDELAY Mask              */
#define EBU_BUSRAP0_AHOLDC_Pos                24                                                      /*!< EBU BUSRAP0: AHOLDC Position            */
#define EBU_BUSRAP0_AHOLDC_Msk                (0x0fUL << EBU_BUSRAP0_AHOLDC_Pos)                      /*!< EBU BUSRAP0: AHOLDC Mask                */
#define EBU_BUSRAP0_ADDRC_Pos                 28                                                      /*!< EBU BUSRAP0: ADDRC Position             */
#define EBU_BUSRAP0_ADDRC_Msk                 (0x0fUL << EBU_BUSRAP0_ADDRC_Pos)                       /*!< EBU BUSRAP0: ADDRC Mask                 */

/* --------------------------------  EBU_BUSWCON0  -------------------------------- */
#define EBU_BUSWCON0_FETBLEN_Pos              0                                                       /*!< EBU BUSWCON0: FETBLEN Position          */
#define EBU_BUSWCON0_FETBLEN_Msk              (0x07UL << EBU_BUSWCON0_FETBLEN_Pos)                    /*!< EBU BUSWCON0: FETBLEN Mask              */
#define EBU_BUSWCON0_FBBMSEL_Pos              3                                                       /*!< EBU BUSWCON0: FBBMSEL Position          */
#define EBU_BUSWCON0_FBBMSEL_Msk              (0x01UL << EBU_BUSWCON0_FBBMSEL_Pos)                    /*!< EBU BUSWCON0: FBBMSEL Mask              */
#define EBU_BUSWCON0_NAA_Pos                  7                                                       /*!< EBU BUSWCON0: NAA Position              */
#define EBU_BUSWCON0_NAA_Msk                  (0x01UL << EBU_BUSWCON0_NAA_Pos)                        /*!< EBU BUSWCON0: NAA Mask                  */
#define EBU_BUSWCON0_ECSE_Pos                 16                                                      /*!< EBU BUSWCON0: ECSE Position             */
#define EBU_BUSWCON0_ECSE_Msk                 (0x01UL << EBU_BUSWCON0_ECSE_Pos)                       /*!< EBU BUSWCON0: ECSE Mask                 */
#define EBU_BUSWCON0_EBSE_Pos                 17                                                      /*!< EBU BUSWCON0: EBSE Position             */
#define EBU_BUSWCON0_EBSE_Msk                 (0x01UL << EBU_BUSWCON0_EBSE_Pos)                       /*!< EBU BUSWCON0: EBSE Mask                 */
#define EBU_BUSWCON0_WAITINV_Pos              19                                                      /*!< EBU BUSWCON0: WAITINV Position          */
#define EBU_BUSWCON0_WAITINV_Msk              (0x01UL << EBU_BUSWCON0_WAITINV_Pos)                    /*!< EBU BUSWCON0: WAITINV Mask              */
#define EBU_BUSWCON0_BCGEN_Pos                20                                                      /*!< EBU BUSWCON0: BCGEN Position            */
#define EBU_BUSWCON0_BCGEN_Msk                (0x03UL << EBU_BUSWCON0_BCGEN_Pos)                      /*!< EBU BUSWCON0: BCGEN Mask                */
#define EBU_BUSWCON0_PORTW_Pos                22                                                      /*!< EBU BUSWCON0: PORTW Position            */
#define EBU_BUSWCON0_PORTW_Msk                (0x03UL << EBU_BUSWCON0_PORTW_Pos)                      /*!< EBU BUSWCON0: PORTW Mask                */
#define EBU_BUSWCON0_WAIT_Pos                 24                                                      /*!< EBU BUSWCON0: WAIT Position             */
#define EBU_BUSWCON0_WAIT_Msk                 (0x03UL << EBU_BUSWCON0_WAIT_Pos)                       /*!< EBU BUSWCON0: WAIT Mask                 */
#define EBU_BUSWCON0_AAP_Pos                  26                                                      /*!< EBU BUSWCON0: AAP Position              */
#define EBU_BUSWCON0_AAP_Msk                  (0x01UL << EBU_BUSWCON0_AAP_Pos)                        /*!< EBU BUSWCON0: AAP Mask                  */
#define EBU_BUSWCON0_LOCKCS_Pos               27                                                      /*!< EBU BUSWCON0: LOCKCS Position           */
#define EBU_BUSWCON0_LOCKCS_Msk               (0x01UL << EBU_BUSWCON0_LOCKCS_Pos)                     /*!< EBU BUSWCON0: LOCKCS Mask               */
#define EBU_BUSWCON0_AGEN_Pos                 28                                                      /*!< EBU BUSWCON0: AGEN Position             */
#define EBU_BUSWCON0_AGEN_Msk                 (0x0fUL << EBU_BUSWCON0_AGEN_Pos)                       /*!< EBU BUSWCON0: AGEN Mask                 */

/* ---------------------------------  EBU_BUSWAP0  -------------------------------- */
#define EBU_BUSWAP0_WRDTACS_Pos               0                                                       /*!< EBU BUSWAP0: WRDTACS Position           */
#define EBU_BUSWAP0_WRDTACS_Msk               (0x0fUL << EBU_BUSWAP0_WRDTACS_Pos)                     /*!< EBU BUSWAP0: WRDTACS Mask               */
#define EBU_BUSWAP0_WRRECOVC_Pos              4                                                       /*!< EBU BUSWAP0: WRRECOVC Position          */
#define EBU_BUSWAP0_WRRECOVC_Msk              (0x07UL << EBU_BUSWAP0_WRRECOVC_Pos)                    /*!< EBU BUSWAP0: WRRECOVC Mask              */
#define EBU_BUSWAP0_WAITWRC_Pos               7                                                       /*!< EBU BUSWAP0: WAITWRC Position           */
#define EBU_BUSWAP0_WAITWRC_Msk               (0x1fUL << EBU_BUSWAP0_WAITWRC_Pos)                     /*!< EBU BUSWAP0: WAITWRC Mask               */
#define EBU_BUSWAP0_DATAC_Pos                 12                                                      /*!< EBU BUSWAP0: DATAC Position             */
#define EBU_BUSWAP0_DATAC_Msk                 (0x0fUL << EBU_BUSWAP0_DATAC_Pos)                       /*!< EBU BUSWAP0: DATAC Mask                 */
#define EBU_BUSWAP0_EXTCLOCK_Pos              16                                                      /*!< EBU BUSWAP0: EXTCLOCK Position          */
#define EBU_BUSWAP0_EXTCLOCK_Msk              (0x03UL << EBU_BUSWAP0_EXTCLOCK_Pos)                    /*!< EBU BUSWAP0: EXTCLOCK Mask              */
#define EBU_BUSWAP0_EXTDATA_Pos               18                                                      /*!< EBU BUSWAP0: EXTDATA Position           */
#define EBU_BUSWAP0_EXTDATA_Msk               (0x03UL << EBU_BUSWAP0_EXTDATA_Pos)                     /*!< EBU BUSWAP0: EXTDATA Mask               */
#define EBU_BUSWAP0_CMDDELAY_Pos              20                                                      /*!< EBU BUSWAP0: CMDDELAY Position          */
#define EBU_BUSWAP0_CMDDELAY_Msk              (0x0fUL << EBU_BUSWAP0_CMDDELAY_Pos)                    /*!< EBU BUSWAP0: CMDDELAY Mask              */
#define EBU_BUSWAP0_AHOLDC_Pos                24                                                      /*!< EBU BUSWAP0: AHOLDC Position            */
#define EBU_BUSWAP0_AHOLDC_Msk                (0x0fUL << EBU_BUSWAP0_AHOLDC_Pos)                      /*!< EBU BUSWAP0: AHOLDC Mask                */
#define EBU_BUSWAP0_ADDRC_Pos                 28                                                      /*!< EBU BUSWAP0: ADDRC Position             */
#define EBU_BUSWAP0_ADDRC_Msk                 (0x0fUL << EBU_BUSWAP0_ADDRC_Pos)                       /*!< EBU BUSWAP0: ADDRC Mask                 */

/* --------------------------------  EBU_BUSRCON1  -------------------------------- */
#define EBU_BUSRCON1_FETBLEN_Pos              0                                                       /*!< EBU BUSRCON1: FETBLEN Position          */
#define EBU_BUSRCON1_FETBLEN_Msk              (0x07UL << EBU_BUSRCON1_FETBLEN_Pos)                    /*!< EBU BUSRCON1: FETBLEN Mask              */
#define EBU_BUSRCON1_FBBMSEL_Pos              3                                                       /*!< EBU BUSRCON1: FBBMSEL Position          */
#define EBU_BUSRCON1_FBBMSEL_Msk              (0x01UL << EBU_BUSRCON1_FBBMSEL_Pos)                    /*!< EBU BUSRCON1: FBBMSEL Mask              */
#define EBU_BUSRCON1_BFSSS_Pos                4                                                       /*!< EBU BUSRCON1: BFSSS Position            */
#define EBU_BUSRCON1_BFSSS_Msk                (0x01UL << EBU_BUSRCON1_BFSSS_Pos)                      /*!< EBU BUSRCON1: BFSSS Mask                */
#define EBU_BUSRCON1_FDBKEN_Pos               5                                                       /*!< EBU BUSRCON1: FDBKEN Position           */
#define EBU_BUSRCON1_FDBKEN_Msk               (0x01UL << EBU_BUSRCON1_FDBKEN_Pos)                     /*!< EBU BUSRCON1: FDBKEN Mask               */
#define EBU_BUSRCON1_BFCMSEL_Pos              6                                                       /*!< EBU BUSRCON1: BFCMSEL Position          */
#define EBU_BUSRCON1_BFCMSEL_Msk              (0x01UL << EBU_BUSRCON1_BFCMSEL_Pos)                    /*!< EBU BUSRCON1: BFCMSEL Mask              */
#define EBU_BUSRCON1_NAA_Pos                  7                                                       /*!< EBU BUSRCON1: NAA Position              */
#define EBU_BUSRCON1_NAA_Msk                  (0x01UL << EBU_BUSRCON1_NAA_Pos)                        /*!< EBU BUSRCON1: NAA Mask                  */
#define EBU_BUSRCON1_ECSE_Pos                 16                                                      /*!< EBU BUSRCON1: ECSE Position             */
#define EBU_BUSRCON1_ECSE_Msk                 (0x01UL << EBU_BUSRCON1_ECSE_Pos)                       /*!< EBU BUSRCON1: ECSE Mask                 */
#define EBU_BUSRCON1_EBSE_Pos                 17                                                      /*!< EBU BUSRCON1: EBSE Position             */
#define EBU_BUSRCON1_EBSE_Msk                 (0x01UL << EBU_BUSRCON1_EBSE_Pos)                       /*!< EBU BUSRCON1: EBSE Mask                 */
#define EBU_BUSRCON1_DBA_Pos                  18                                                      /*!< EBU BUSRCON1: DBA Position              */
#define EBU_BUSRCON1_DBA_Msk                  (0x01UL << EBU_BUSRCON1_DBA_Pos)                        /*!< EBU BUSRCON1: DBA Mask                  */
#define EBU_BUSRCON1_WAITINV_Pos              19                                                      /*!< EBU BUSRCON1: WAITINV Position          */
#define EBU_BUSRCON1_WAITINV_Msk              (0x01UL << EBU_BUSRCON1_WAITINV_Pos)                    /*!< EBU BUSRCON1: WAITINV Mask              */
#define EBU_BUSRCON1_BCGEN_Pos                20                                                      /*!< EBU BUSRCON1: BCGEN Position            */
#define EBU_BUSRCON1_BCGEN_Msk                (0x03UL << EBU_BUSRCON1_BCGEN_Pos)                      /*!< EBU BUSRCON1: BCGEN Mask                */
#define EBU_BUSRCON1_PORTW_Pos                22                                                      /*!< EBU BUSRCON1: PORTW Position            */
#define EBU_BUSRCON1_PORTW_Msk                (0x03UL << EBU_BUSRCON1_PORTW_Pos)                      /*!< EBU BUSRCON1: PORTW Mask                */
#define EBU_BUSRCON1_WAIT_Pos                 24                                                      /*!< EBU BUSRCON1: WAIT Position             */
#define EBU_BUSRCON1_WAIT_Msk                 (0x03UL << EBU_BUSRCON1_WAIT_Pos)                       /*!< EBU BUSRCON1: WAIT Mask                 */
#define EBU_BUSRCON1_AAP_Pos                  26                                                      /*!< EBU BUSRCON1: AAP Position              */
#define EBU_BUSRCON1_AAP_Msk                  (0x01UL << EBU_BUSRCON1_AAP_Pos)                        /*!< EBU BUSRCON1: AAP Mask                  */
#define EBU_BUSRCON1_AGEN_Pos                 28                                                      /*!< EBU BUSRCON1: AGEN Position             */
#define EBU_BUSRCON1_AGEN_Msk                 (0x0fUL << EBU_BUSRCON1_AGEN_Pos)                       /*!< EBU BUSRCON1: AGEN Mask                 */

/* ---------------------------------  EBU_BUSRAP1  -------------------------------- */
#define EBU_BUSRAP1_RDDTACS_Pos               0                                                       /*!< EBU BUSRAP1: RDDTACS Position           */
#define EBU_BUSRAP1_RDDTACS_Msk               (0x0fUL << EBU_BUSRAP1_RDDTACS_Pos)                     /*!< EBU BUSRAP1: RDDTACS Mask               */
#define EBU_BUSRAP1_RDRECOVC_Pos              4                                                       /*!< EBU BUSRAP1: RDRECOVC Position          */
#define EBU_BUSRAP1_RDRECOVC_Msk              (0x07UL << EBU_BUSRAP1_RDRECOVC_Pos)                    /*!< EBU BUSRAP1: RDRECOVC Mask              */
#define EBU_BUSRAP1_WAITRDC_Pos               7                                                       /*!< EBU BUSRAP1: WAITRDC Position           */
#define EBU_BUSRAP1_WAITRDC_Msk               (0x1fUL << EBU_BUSRAP1_WAITRDC_Pos)                     /*!< EBU BUSRAP1: WAITRDC Mask               */
#define EBU_BUSRAP1_DATAC_Pos                 12                                                      /*!< EBU BUSRAP1: DATAC Position             */
#define EBU_BUSRAP1_DATAC_Msk                 (0x0fUL << EBU_BUSRAP1_DATAC_Pos)                       /*!< EBU BUSRAP1: DATAC Mask                 */
#define EBU_BUSRAP1_EXTCLOCK_Pos              16                                                      /*!< EBU BUSRAP1: EXTCLOCK Position          */
#define EBU_BUSRAP1_EXTCLOCK_Msk              (0x03UL << EBU_BUSRAP1_EXTCLOCK_Pos)                    /*!< EBU BUSRAP1: EXTCLOCK Mask              */
#define EBU_BUSRAP1_EXTDATA_Pos               18                                                      /*!< EBU BUSRAP1: EXTDATA Position           */
#define EBU_BUSRAP1_EXTDATA_Msk               (0x03UL << EBU_BUSRAP1_EXTDATA_Pos)                     /*!< EBU BUSRAP1: EXTDATA Mask               */
#define EBU_BUSRAP1_CMDDELAY_Pos              20                                                      /*!< EBU BUSRAP1: CMDDELAY Position          */
#define EBU_BUSRAP1_CMDDELAY_Msk              (0x0fUL << EBU_BUSRAP1_CMDDELAY_Pos)                    /*!< EBU BUSRAP1: CMDDELAY Mask              */
#define EBU_BUSRAP1_AHOLDC_Pos                24                                                      /*!< EBU BUSRAP1: AHOLDC Position            */
#define EBU_BUSRAP1_AHOLDC_Msk                (0x0fUL << EBU_BUSRAP1_AHOLDC_Pos)                      /*!< EBU BUSRAP1: AHOLDC Mask                */
#define EBU_BUSRAP1_ADDRC_Pos                 28                                                      /*!< EBU BUSRAP1: ADDRC Position             */
#define EBU_BUSRAP1_ADDRC_Msk                 (0x0fUL << EBU_BUSRAP1_ADDRC_Pos)                       /*!< EBU BUSRAP1: ADDRC Mask                 */

/* --------------------------------  EBU_BUSWCON1  -------------------------------- */
#define EBU_BUSWCON1_FETBLEN_Pos              0                                                       /*!< EBU BUSWCON1: FETBLEN Position          */
#define EBU_BUSWCON1_FETBLEN_Msk              (0x07UL << EBU_BUSWCON1_FETBLEN_Pos)                    /*!< EBU BUSWCON1: FETBLEN Mask              */
#define EBU_BUSWCON1_FBBMSEL_Pos              3                                                       /*!< EBU BUSWCON1: FBBMSEL Position          */
#define EBU_BUSWCON1_FBBMSEL_Msk              (0x01UL << EBU_BUSWCON1_FBBMSEL_Pos)                    /*!< EBU BUSWCON1: FBBMSEL Mask              */
#define EBU_BUSWCON1_NAA_Pos                  7                                                       /*!< EBU BUSWCON1: NAA Position              */
#define EBU_BUSWCON1_NAA_Msk                  (0x01UL << EBU_BUSWCON1_NAA_Pos)                        /*!< EBU BUSWCON1: NAA Mask                  */
#define EBU_BUSWCON1_ECSE_Pos                 16                                                      /*!< EBU BUSWCON1: ECSE Position             */
#define EBU_BUSWCON1_ECSE_Msk                 (0x01UL << EBU_BUSWCON1_ECSE_Pos)                       /*!< EBU BUSWCON1: ECSE Mask                 */
#define EBU_BUSWCON1_EBSE_Pos                 17                                                      /*!< EBU BUSWCON1: EBSE Position             */
#define EBU_BUSWCON1_EBSE_Msk                 (0x01UL << EBU_BUSWCON1_EBSE_Pos)                       /*!< EBU BUSWCON1: EBSE Mask                 */
#define EBU_BUSWCON1_WAITINV_Pos              19                                                      /*!< EBU BUSWCON1: WAITINV Position          */
#define EBU_BUSWCON1_WAITINV_Msk              (0x01UL << EBU_BUSWCON1_WAITINV_Pos)                    /*!< EBU BUSWCON1: WAITINV Mask              */
#define EBU_BUSWCON1_BCGEN_Pos                20                                                      /*!< EBU BUSWCON1: BCGEN Position            */
#define EBU_BUSWCON1_BCGEN_Msk                (0x03UL << EBU_BUSWCON1_BCGEN_Pos)                      /*!< EBU BUSWCON1: BCGEN Mask                */
#define EBU_BUSWCON1_PORTW_Pos                22                                                      /*!< EBU BUSWCON1: PORTW Position            */
#define EBU_BUSWCON1_PORTW_Msk                (0x03UL << EBU_BUSWCON1_PORTW_Pos)                      /*!< EBU BUSWCON1: PORTW Mask                */
#define EBU_BUSWCON1_WAIT_Pos                 24                                                      /*!< EBU BUSWCON1: WAIT Position             */
#define EBU_BUSWCON1_WAIT_Msk                 (0x03UL << EBU_BUSWCON1_WAIT_Pos)                       /*!< EBU BUSWCON1: WAIT Mask                 */
#define EBU_BUSWCON1_AAP_Pos                  26                                                      /*!< EBU BUSWCON1: AAP Position              */
#define EBU_BUSWCON1_AAP_Msk                  (0x01UL << EBU_BUSWCON1_AAP_Pos)                        /*!< EBU BUSWCON1: AAP Mask                  */
#define EBU_BUSWCON1_LOCKCS_Pos               27                                                      /*!< EBU BUSWCON1: LOCKCS Position           */
#define EBU_BUSWCON1_LOCKCS_Msk               (0x01UL << EBU_BUSWCON1_LOCKCS_Pos)                     /*!< EBU BUSWCON1: LOCKCS Mask               */
#define EBU_BUSWCON1_AGEN_Pos                 28                                                      /*!< EBU BUSWCON1: AGEN Position             */
#define EBU_BUSWCON1_AGEN_Msk                 (0x0fUL << EBU_BUSWCON1_AGEN_Pos)                       /*!< EBU BUSWCON1: AGEN Mask                 */

/* ---------------------------------  EBU_BUSWAP1  -------------------------------- */
#define EBU_BUSWAP1_WRDTACS_Pos               0                                                       /*!< EBU BUSWAP1: WRDTACS Position           */
#define EBU_BUSWAP1_WRDTACS_Msk               (0x0fUL << EBU_BUSWAP1_WRDTACS_Pos)                     /*!< EBU BUSWAP1: WRDTACS Mask               */
#define EBU_BUSWAP1_WRRECOVC_Pos              4                                                       /*!< EBU BUSWAP1: WRRECOVC Position          */
#define EBU_BUSWAP1_WRRECOVC_Msk              (0x07UL << EBU_BUSWAP1_WRRECOVC_Pos)                    /*!< EBU BUSWAP1: WRRECOVC Mask              */
#define EBU_BUSWAP1_WAITWRC_Pos               7                                                       /*!< EBU BUSWAP1: WAITWRC Position           */
#define EBU_BUSWAP1_WAITWRC_Msk               (0x1fUL << EBU_BUSWAP1_WAITWRC_Pos)                     /*!< EBU BUSWAP1: WAITWRC Mask               */
#define EBU_BUSWAP1_DATAC_Pos                 12                                                      /*!< EBU BUSWAP1: DATAC Position             */
#define EBU_BUSWAP1_DATAC_Msk                 (0x0fUL << EBU_BUSWAP1_DATAC_Pos)                       /*!< EBU BUSWAP1: DATAC Mask                 */
#define EBU_BUSWAP1_EXTCLOCK_Pos              16                                                      /*!< EBU BUSWAP1: EXTCLOCK Position          */
#define EBU_BUSWAP1_EXTCLOCK_Msk              (0x03UL << EBU_BUSWAP1_EXTCLOCK_Pos)                    /*!< EBU BUSWAP1: EXTCLOCK Mask              */
#define EBU_BUSWAP1_EXTDATA_Pos               18                                                      /*!< EBU BUSWAP1: EXTDATA Position           */
#define EBU_BUSWAP1_EXTDATA_Msk               (0x03UL << EBU_BUSWAP1_EXTDATA_Pos)                     /*!< EBU BUSWAP1: EXTDATA Mask               */
#define EBU_BUSWAP1_CMDDELAY_Pos              20                                                      /*!< EBU BUSWAP1: CMDDELAY Position          */
#define EBU_BUSWAP1_CMDDELAY_Msk              (0x0fUL << EBU_BUSWAP1_CMDDELAY_Pos)                    /*!< EBU BUSWAP1: CMDDELAY Mask              */
#define EBU_BUSWAP1_AHOLDC_Pos                24                                                      /*!< EBU BUSWAP1: AHOLDC Position            */
#define EBU_BUSWAP1_AHOLDC_Msk                (0x0fUL << EBU_BUSWAP1_AHOLDC_Pos)                      /*!< EBU BUSWAP1: AHOLDC Mask                */
#define EBU_BUSWAP1_ADDRC_Pos                 28                                                      /*!< EBU BUSWAP1: ADDRC Position             */
#define EBU_BUSWAP1_ADDRC_Msk                 (0x0fUL << EBU_BUSWAP1_ADDRC_Pos)                       /*!< EBU BUSWAP1: ADDRC Mask                 */

