FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* --------------------------------  EBU_BUSRCON2  -------------------------------- */
#define EBU_BUSRCON2_FETBLEN_Pos              0                                                       /*!< EBU BUSRCON2: FETBLEN Position          */
#define EBU_BUSRCON2_FETBLEN_Msk              (0x07UL << EBU_BUSRCON2_FETBLEN_Pos)                    /*!< EBU BUSRCON2: FETBLEN Mask              */
#define EBU_BUSRCON2_FBBMSEL_Pos              3                                                       /*!< EBU BUSRCON2: FBBMSEL Position          */
#define EBU_BUSRCON2_FBBMSEL_Msk              (0x01UL << EBU_BUSRCON2_FBBMSEL_Pos)                    /*!< EBU BUSRCON2: FBBMSEL Mask              */
#define EBU_BUSRCON2_BFSSS_Pos                4                                                       /*!< EBU BUSRCON2: BFSSS Position            */
#define EBU_BUSRCON2_BFSSS_Msk                (0x01UL << EBU_BUSRCON2_BFSSS_Pos)                      /*!< EBU BUSRCON2: BFSSS Mask                */
#define EBU_BUSRCON2_FDBKEN_Pos               5                                                       /*!< EBU BUSRCON2: FDBKEN Position           */
#define EBU_BUSRCON2_FDBKEN_Msk               (0x01UL << EBU_BUSRCON2_FDBKEN_Pos)                     /*!< EBU BUSRCON2: FDBKEN Mask               */
#define EBU_BUSRCON2_BFCMSEL_Pos              6                                                       /*!< EBU BUSRCON2: BFCMSEL Position          */
#define EBU_BUSRCON2_BFCMSEL_Msk              (0x01UL << EBU_BUSRCON2_BFCMSEL_Pos)                    /*!< EBU BUSRCON2: BFCMSEL Mask              */
#define EBU_BUSRCON2_NAA_Pos                  7                                                       /*!< EBU BUSRCON2: NAA Position              */
#define EBU_BUSRCON2_NAA_Msk                  (0x01UL << EBU_BUSRCON2_NAA_Pos)                        /*!< EBU BUSRCON2: NAA Mask                  */
#define EBU_BUSRCON2_ECSE_Pos                 16                                                      /*!< EBU BUSRCON2: ECSE Position             */
#define EBU_BUSRCON2_ECSE_Msk                 (0x01UL << EBU_BUSRCON2_ECSE_Pos)                       /*!< EBU BUSRCON2: ECSE Mask                 */
#define EBU_BUSRCON2_EBSE_Pos                 17                                                      /*!< EBU BUSRCON2: EBSE Position             */
#define EBU_BUSRCON2_EBSE_Msk                 (0x01UL << EBU_BUSRCON2_EBSE_Pos)                       /*!< EBU BUSRCON2: EBSE Mask                 */
#define EBU_BUSRCON2_DBA_Pos                  18                                                      /*!< EBU BUSRCON2: DBA Position              */
#define EBU_BUSRCON2_DBA_Msk                  (0x01UL << EBU_BUSRCON2_DBA_Pos)                        /*!< EBU BUSRCON2: DBA Mask                  */
#define EBU_BUSRCON2_WAITINV_Pos              19                                                      /*!< EBU BUSRCON2: WAITINV Position          */
#define EBU_BUSRCON2_WAITINV_Msk              (0x01UL << EBU_BUSRCON2_WAITINV_Pos)                    /*!< EBU BUSRCON2: WAITINV Mask              */
#define EBU_BUSRCON2_BCGEN_Pos                20                                                      /*!< EBU BUSRCON2: BCGEN Position            */
#define EBU_BUSRCON2_BCGEN_Msk                (0x03UL << EBU_BUSRCON2_BCGEN_Pos)                      /*!< EBU BUSRCON2: BCGEN Mask                */
#define EBU_BUSRCON2_PORTW_Pos                22                                                      /*!< EBU BUSRCON2: PORTW Position            */
#define EBU_BUSRCON2_PORTW_Msk                (0x03UL << EBU_BUSRCON2_PORTW_Pos)                      /*!< EBU BUSRCON2: PORTW Mask                */
#define EBU_BUSRCON2_WAIT_Pos                 24                                                      /*!< EBU BUSRCON2: WAIT Position             */
#define EBU_BUSRCON2_WAIT_Msk                 (0x03UL << EBU_BUSRCON2_WAIT_Pos)                       /*!< EBU BUSRCON2: WAIT Mask                 */
#define EBU_BUSRCON2_AAP_Pos                  26                                                      /*!< EBU BUSRCON2: AAP Position              */
#define EBU_BUSRCON2_AAP_Msk                  (0x01UL << EBU_BUSRCON2_AAP_Pos)                        /*!< EBU BUSRCON2: AAP Mask                  */
#define EBU_BUSRCON2_AGEN_Pos                 28                                                      /*!< EBU BUSRCON2: AGEN Position             */
#define EBU_BUSRCON2_AGEN_Msk                 (0x0fUL << EBU_BUSRCON2_AGEN_Pos)                       /*!< EBU BUSRCON2: AGEN Mask                 */

/* ---------------------------------  EBU_BUSRAP2  -------------------------------- */
#define EBU_BUSRAP2_RDDTACS_Pos               0                                                       /*!< EBU BUSRAP2: RDDTACS Position           */
#define EBU_BUSRAP2_RDDTACS_Msk               (0x0fUL << EBU_BUSRAP2_RDDTACS_Pos)                     /*!< EBU BUSRAP2: RDDTACS Mask               */
#define EBU_BUSRAP2_RDRECOVC_Pos              4                                                       /*!< EBU BUSRAP2: RDRECOVC Position          */
#define EBU_BUSRAP2_RDRECOVC_Msk              (0x07UL << EBU_BUSRAP2_RDRECOVC_Pos)                    /*!< EBU BUSRAP2: RDRECOVC Mask              */
#define EBU_BUSRAP2_WAITRDC_Pos               7                                                       /*!< EBU BUSRAP2: WAITRDC Position           */
#define EBU_BUSRAP2_WAITRDC_Msk               (0x1fUL << EBU_BUSRAP2_WAITRDC_Pos)                     /*!< EBU BUSRAP2: WAITRDC Mask               */
#define EBU_BUSRAP2_DATAC_Pos                 12                                                      /*!< EBU BUSRAP2: DATAC Position             */
#define EBU_BUSRAP2_DATAC_Msk                 (0x0fUL << EBU_BUSRAP2_DATAC_Pos)                       /*!< EBU BUSRAP2: DATAC Mask                 */
#define EBU_BUSRAP2_EXTCLOCK_Pos              16                                                      /*!< EBU BUSRAP2: EXTCLOCK Position          */
#define EBU_BUSRAP2_EXTCLOCK_Msk              (0x03UL << EBU_BUSRAP2_EXTCLOCK_Pos)                    /*!< EBU BUSRAP2: EXTCLOCK Mask              */
#define EBU_BUSRAP2_EXTDATA_Pos               18                                                      /*!< EBU BUSRAP2: EXTDATA Position           */
#define EBU_BUSRAP2_EXTDATA_Msk               (0x03UL << EBU_BUSRAP2_EXTDATA_Pos)                     /*!< EBU BUSRAP2: EXTDATA Mask               */
#define EBU_BUSRAP2_CMDDELAY_Pos              20                                                      /*!< EBU BUSRAP2: CMDDELAY Position          */
#define EBU_BUSRAP2_CMDDELAY_Msk              (0x0fUL << EBU_BUSRAP2_CMDDELAY_Pos)                    /*!< EBU BUSRAP2: CMDDELAY Mask              */
#define EBU_BUSRAP2_AHOLDC_Pos                24                                                      /*!< EBU BUSRAP2: AHOLDC Position            */
#define EBU_BUSRAP2_AHOLDC_Msk                (0x0fUL << EBU_BUSRAP2_AHOLDC_Pos)                      /*!< EBU BUSRAP2: AHOLDC Mask                */
#define EBU_BUSRAP2_ADDRC_Pos                 28                                                      /*!< EBU BUSRAP2: ADDRC Position             */
#define EBU_BUSRAP2_ADDRC_Msk                 (0x0fUL << EBU_BUSRAP2_ADDRC_Pos)                       /*!< EBU BUSRAP2: ADDRC Mask                 */

/* --------------------------------  EBU_BUSWCON2  -------------------------------- */
#define EBU_BUSWCON2_FETBLEN_Pos              0                                                       /*!< EBU BUSWCON2: FETBLEN Position          */
#define EBU_BUSWCON2_FETBLEN_Msk              (0x07UL << EBU_BUSWCON2_FETBLEN_Pos)                    /*!< EBU BUSWCON2: FETBLEN Mask              */
#define EBU_BUSWCON2_FBBMSEL_Pos              3                                                       /*!< EBU BUSWCON2: FBBMSEL Position          */
#define EBU_BUSWCON2_FBBMSEL_Msk              (0x01UL << EBU_BUSWCON2_FBBMSEL_Pos)                    /*!< EBU BUSWCON2: FBBMSEL Mask              */
#define EBU_BUSWCON2_NAA_Pos                  7                                                       /*!< EBU BUSWCON2: NAA Position              */
#define EBU_BUSWCON2_NAA_Msk                  (0x01UL << EBU_BUSWCON2_NAA_Pos)                        /*!< EBU BUSWCON2: NAA Mask                  */
#define EBU_BUSWCON2_ECSE_Pos                 16                                                      /*!< EBU BUSWCON2: ECSE Position             */
#define EBU_BUSWCON2_ECSE_Msk                 (0x01UL << EBU_BUSWCON2_ECSE_Pos)                       /*!< EBU BUSWCON2: ECSE Mask                 */
#define EBU_BUSWCON2_EBSE_Pos                 17                                                      /*!< EBU BUSWCON2: EBSE Position             */
#define EBU_BUSWCON2_EBSE_Msk                 (0x01UL << EBU_BUSWCON2_EBSE_Pos)                       /*!< EBU BUSWCON2: EBSE Mask                 */
#define EBU_BUSWCON2_WAITINV_Pos              19                                                      /*!< EBU BUSWCON2: WAITINV Position          */
#define EBU_BUSWCON2_WAITINV_Msk              (0x01UL << EBU_BUSWCON2_WAITINV_Pos)                    /*!< EBU BUSWCON2: WAITINV Mask              */
#define EBU_BUSWCON2_BCGEN_Pos                20                                                      /*!< EBU BUSWCON2: BCGEN Position            */
#define EBU_BUSWCON2_BCGEN_Msk                (0x03UL << EBU_BUSWCON2_BCGEN_Pos)                      /*!< EBU BUSWCON2: BCGEN Mask                */
#define EBU_BUSWCON2_PORTW_Pos                22                                                      /*!< EBU BUSWCON2: PORTW Position            */
#define EBU_BUSWCON2_PORTW_Msk                (0x03UL << EBU_BUSWCON2_PORTW_Pos)                      /*!< EBU BUSWCON2: PORTW Mask                */
#define EBU_BUSWCON2_WAIT_Pos                 24                                                      /*!< EBU BUSWCON2: WAIT Position             */
#define EBU_BUSWCON2_WAIT_Msk                 (0x03UL << EBU_BUSWCON2_WAIT_Pos)                       /*!< EBU BUSWCON2: WAIT Mask                 */
#define EBU_BUSWCON2_AAP_Pos                  26                                                      /*!< EBU BUSWCON2: AAP Position              */
#define EBU_BUSWCON2_AAP_Msk                  (0x01UL << EBU_BUSWCON2_AAP_Pos)                        /*!< EBU BUSWCON2: AAP Mask                  */
#define EBU_BUSWCON2_LOCKCS_Pos               27                                                      /*!< EBU BUSWCON2: LOCKCS Position           */
#define EBU_BUSWCON2_LOCKCS_Msk               (0x01UL << EBU_BUSWCON2_LOCKCS_Pos)                     /*!< EBU BUSWCON2: LOCKCS Mask               */
#define EBU_BUSWCON2_AGEN_Pos                 28                                                      /*!< EBU BUSWCON2: AGEN Position             */
#define EBU_BUSWCON2_AGEN_Msk                 (0x0fUL << EBU_BUSWCON2_AGEN_Pos)                       /*!< EBU BUSWCON2: AGEN Mask                 */

/* ---------------------------------  EBU_BUSWAP2  -------------------------------- */
#define EBU_BUSWAP2_WRDTACS_Pos               0                                                       /*!< EBU BUSWAP2: WRDTACS Position           */
#define EBU_BUSWAP2_WRDTACS_Msk               (0x0fUL << EBU_BUSWAP2_WRDTACS_Pos)                     /*!< EBU BUSWAP2: WRDTACS Mask               */
#define EBU_BUSWAP2_WRRECOVC_Pos              4                                                       /*!< EBU BUSWAP2: WRRECOVC Position          */
#define EBU_BUSWAP2_WRRECOVC_Msk              (0x07UL << EBU_BUSWAP2_WRRECOVC_Pos)                    /*!< EBU BUSWAP2: WRRECOVC Mask              */
#define EBU_BUSWAP2_WAITWRC_Pos               7                                                       /*!< EBU BUSWAP2: WAITWRC Position           */
#define EBU_BUSWAP2_WAITWRC_Msk               (0x1fUL << EBU_BUSWAP2_WAITWRC_Pos)                     /*!< EBU BUSWAP2: WAITWRC Mask               */
#define EBU_BUSWAP2_DATAC_Pos                 12                                                      /*!< EBU BUSWAP2: DATAC Position             */
#define EBU_BUSWAP2_DATAC_Msk                 (0x0fUL << EBU_BUSWAP2_DATAC_Pos)                       /*!< EBU BUSWAP2: DATAC Mask                 */
#define EBU_BUSWAP2_EXTCLOCK_Pos              16                                                      /*!< EBU BUSWAP2: EXTCLOCK Position          */
#define EBU_BUSWAP2_EXTCLOCK_Msk              (0x03UL << EBU_BUSWAP2_EXTCLOCK_Pos)                    /*!< EBU BUSWAP2: EXTCLOCK Mask              */
#define EBU_BUSWAP2_EXTDATA_Pos               18                                                      /*!< EBU BUSWAP2: EXTDATA Position           */
#define EBU_BUSWAP2_EXTDATA_Msk               (0x03UL << EBU_BUSWAP2_EXTDATA_Pos)                     /*!< EBU BUSWAP2: EXTDATA Mask               */
#define EBU_BUSWAP2_CMDDELAY_Pos              20                                                      /*!< EBU BUSWAP2: CMDDELAY Position          */
#define EBU_BUSWAP2_CMDDELAY_Msk              (0x0fUL << EBU_BUSWAP2_CMDDELAY_Pos)                    /*!< EBU BUSWAP2: CMDDELAY Mask              */
#define EBU_BUSWAP2_AHOLDC_Pos                24                                                      /*!< EBU BUSWAP2: AHOLDC Position            */
#define EBU_BUSWAP2_AHOLDC_Msk                (0x0fUL << EBU_BUSWAP2_AHOLDC_Pos)                      /*!< EBU BUSWAP2: AHOLDC Mask                */
#define EBU_BUSWAP2_ADDRC_Pos                 28                                                      /*!< EBU BUSWAP2: ADDRC Position             */
#define EBU_BUSWAP2_ADDRC_Msk                 (0x0fUL << EBU_BUSWAP2_ADDRC_Pos)                       /*!< EBU BUSWAP2: ADDRC Mask                 */

/* --------------------------------  EBU_BUSRCON3  -------------------------------- */
#define EBU_BUSRCON3_FETBLEN_Pos              0                                                       /*!< EBU BUSRCON3: FETBLEN Position          */
#define EBU_BUSRCON3_FETBLEN_Msk              (0x07UL << EBU_BUSRCON3_FETBLEN_Pos)                    /*!< EBU BUSRCON3: FETBLEN Mask              */
#define EBU_BUSRCON3_FBBMSEL_Pos              3                                                       /*!< EBU BUSRCON3: FBBMSEL Position          */
#define EBU_BUSRCON3_FBBMSEL_Msk              (0x01UL << EBU_BUSRCON3_FBBMSEL_Pos)                    /*!< EBU BUSRCON3: FBBMSEL Mask              */
#define EBU_BUSRCON3_BFSSS_Pos                4                                                       /*!< EBU BUSRCON3: BFSSS Position            */
#define EBU_BUSRCON3_BFSSS_Msk                (0x01UL << EBU_BUSRCON3_BFSSS_Pos)                      /*!< EBU BUSRCON3: BFSSS Mask                */
#define EBU_BUSRCON3_FDBKEN_Pos               5                                                       /*!< EBU BUSRCON3: FDBKEN Position           */
#define EBU_BUSRCON3_FDBKEN_Msk               (0x01UL << EBU_BUSRCON3_FDBKEN_Pos)                     /*!< EBU BUSRCON3: FDBKEN Mask               */
#define EBU_BUSRCON3_BFCMSEL_Pos              6                                                       /*!< EBU BUSRCON3: BFCMSEL Position          */
#define EBU_BUSRCON3_BFCMSEL_Msk              (0x01UL << EBU_BUSRCON3_BFCMSEL_Pos)                    /*!< EBU BUSRCON3: BFCMSEL Mask              */
#define EBU_BUSRCON3_NAA_Pos                  7                                                       /*!< EBU BUSRCON3: NAA Position              */
#define EBU_BUSRCON3_NAA_Msk                  (0x01UL << EBU_BUSRCON3_NAA_Pos)                        /*!< EBU BUSRCON3: NAA Mask                  */
#define EBU_BUSRCON3_ECSE_Pos                 16                                                      /*!< EBU BUSRCON3: ECSE Position             */
#define EBU_BUSRCON3_ECSE_Msk                 (0x01UL << EBU_BUSRCON3_ECSE_Pos)                       /*!< EBU BUSRCON3: ECSE Mask                 */
#define EBU_BUSRCON3_EBSE_Pos                 17                                                      /*!< EBU BUSRCON3: EBSE Position             */
#define EBU_BUSRCON3_EBSE_Msk                 (0x01UL << EBU_BUSRCON3_EBSE_Pos)                       /*!< EBU BUSRCON3: EBSE Mask                 */
#define EBU_BUSRCON3_DBA_Pos                  18                                                      /*!< EBU BUSRCON3: DBA Position              */
#define EBU_BUSRCON3_DBA_Msk                  (0x01UL << EBU_BUSRCON3_DBA_Pos)                        /*!< EBU BUSRCON3: DBA Mask                  */
#define EBU_BUSRCON3_WAITINV_Pos              19                                                      /*!< EBU BUSRCON3: WAITINV Position          */
#define EBU_BUSRCON3_WAITINV_Msk              (0x01UL << EBU_BUSRCON3_WAITINV_Pos)                    /*!< EBU BUSRCON3: WAITINV Mask              */
#define EBU_BUSRCON3_BCGEN_Pos                20                                                      /*!< EBU BUSRCON3: BCGEN Position            */
#define EBU_BUSRCON3_BCGEN_Msk                (0x03UL << EBU_BUSRCON3_BCGEN_Pos)                      /*!< EBU BUSRCON3: BCGEN Mask                */
#define EBU_BUSRCON3_PORTW_Pos                22                                                      /*!< EBU BUSRCON3: PORTW Position            */
#define EBU_BUSRCON3_PORTW_Msk                (0x03UL << EBU_BUSRCON3_PORTW_Pos)                      /*!< EBU BUSRCON3: PORTW Mask                */
#define EBU_BUSRCON3_WAIT_Pos                 24                                                      /*!< EBU BUSRCON3: WAIT Position             */
#define EBU_BUSRCON3_WAIT_Msk                 (0x03UL << EBU_BUSRCON3_WAIT_Pos)                       /*!< EBU BUSRCON3: WAIT Mask                 */
#define EBU_BUSRCON3_AAP_Pos                  26                                                      /*!< EBU BUSRCON3: AAP Position              */
#define EBU_BUSRCON3_AAP_Msk                  (0x01UL << EBU_BUSRCON3_AAP_Pos)                        /*!< EBU BUSRCON3: AAP Mask                  */
#define EBU_BUSRCON3_AGEN_Pos                 28                                                      /*!< EBU BUSRCON3: AGEN Position             */
#define EBU_BUSRCON3_AGEN_Msk                 (0x0fUL << EBU_BUSRCON3_AGEN_Pos)                       /*!< EBU BUSRCON3: AGEN Mask                 */

/* ---------------------------------  EBU_BUSRAP3  -------------------------------- */
#define EBU_BUSRAP3_RDDTACS_Pos               0                                                       /*!< EBU BUSRAP3: RDDTACS Position           */
#define EBU_BUSRAP3_RDDTACS_Msk               (0x0fUL << EBU_BUSRAP3_RDDTACS_Pos)                     /*!< EBU BUSRAP3: RDDTACS Mask               */
#define EBU_BUSRAP3_RDRECOVC_Pos              4                                                       /*!< EBU BUSRAP3: RDRECOVC Position          */
#define EBU_BUSRAP3_RDRECOVC_Msk              (0x07UL << EBU_BUSRAP3_RDRECOVC_Pos)                    /*!< EBU BUSRAP3: RDRECOVC Mask              */
#define EBU_BUSRAP3_WAITRDC_Pos               7                                                       /*!< EBU BUSRAP3: WAITRDC Position           */
#define EBU_BUSRAP3_WAITRDC_Msk               (0x1fUL << EBU_BUSRAP3_WAITRDC_Pos)                     /*!< EBU BUSRAP3: WAITRDC Mask               */
#define EBU_BUSRAP3_DATAC_Pos                 12                                                      /*!< EBU BUSRAP3: DATAC Position             */
#define EBU_BUSRAP3_DATAC_Msk                 (0x0fUL << EBU_BUSRAP3_DATAC_Pos)                       /*!< EBU BUSRAP3: DATAC Mask                 */
#define EBU_BUSRAP3_EXTCLOCK_Pos              16                                                      /*!< EBU BUSRAP3: EXTCLOCK Position          */
#define EBU_BUSRAP3_EXTCLOCK_Msk              (0x03UL << EBU_BUSRAP3_EXTCLOCK_Pos)                    /*!< EBU BUSRAP3: EXTCLOCK Mask              */
#define EBU_BUSRAP3_EXTDATA_Pos               18                                                      /*!< EBU BUSRAP3: EXTDATA Position           */
#define EBU_BUSRAP3_EXTDATA_Msk               (0x03UL << EBU_BUSRAP3_EXTDATA_Pos)                     /*!< EBU BUSRAP3: EXTDATA Mask               */
#define EBU_BUSRAP3_CMDDELAY_Pos              20                                                      /*!< EBU BUSRAP3: CMDDELAY Position          */
#define EBU_BUSRAP3_CMDDELAY_Msk              (0x0fUL << EBU_BUSRAP3_CMDDELAY_Pos)                    /*!< EBU BUSRAP3: CMDDELAY Mask              */
#define EBU_BUSRAP3_AHOLDC_Pos                24                                                      /*!< EBU BUSRAP3: AHOLDC Position            */
#define EBU_BUSRAP3_AHOLDC_Msk                (0x0fUL << EBU_BUSRAP3_AHOLDC_Pos)                      /*!< EBU BUSRAP3: AHOLDC Mask                */
#define EBU_BUSRAP3_ADDRC_Pos                 28                                                      /*!< EBU BUSRAP3: ADDRC Position             */
#define EBU_BUSRAP3_ADDRC_Msk                 (0x0fUL << EBU_BUSRAP3_ADDRC_Pos)                       /*!< EBU BUSRAP3: ADDRC Mask                 */

