FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* --------------------------------  EBU_BUSWCON3  -------------------------------- */
#define EBU_BUSWCON3_FETBLEN_Pos              0                                                       /*!< EBU BUSWCON3: FETBLEN Position          */
#define EBU_BUSWCON3_FETBLEN_Msk              (0x07UL << EBU_BUSWCON3_FETBLEN_Pos)                    /*!< EBU BUSWCON3: FETBLEN Mask              */
#define EBU_BUSWCON3_FBBMSEL_Pos              3                                                       /*!< EBU BUSWCON3: FBBMSEL Position          */
#define EBU_BUSWCON3_FBBMSEL_Msk              (0x01UL << EBU_BUSWCON3_FBBMSEL_Pos)                    /*!< EBU BUSWCON3: FBBMSEL Mask              */
#define EBU_BUSWCON3_NAA_Pos                  7                                                       /*!< EBU BUSWCON3: NAA Position              */
#define EBU_BUSWCON3_NAA_Msk                  (0x01UL << EBU_BUSWCON3_NAA_Pos)                        /*!< EBU BUSWCON3: NAA Mask                  */
#define EBU_BUSWCON3_ECSE_Pos                 16                                                      /*!< EBU BUSWCON3: ECSE Position             */
#define EBU_BUSWCON3_ECSE_Msk                 (0x01UL << EBU_BUSWCON3_ECSE_Pos)                       /*!< EBU BUSWCON3: ECSE Mask                 */
#define EBU_BUSWCON3_EBSE_Pos                 17                                                      /*!< EBU BUSWCON3: EBSE Position             */
#define EBU_BUSWCON3_EBSE_Msk                 (0x01UL << EBU_BUSWCON3_EBSE_Pos)                       /*!< EBU BUSWCON3: EBSE Mask                 */
#define EBU_BUSWCON3_WAITINV_Pos              19                                                      /*!< EBU BUSWCON3: WAITINV Position          */
#define EBU_BUSWCON3_WAITINV_Msk              (0x01UL << EBU_BUSWCON3_WAITINV_Pos)                    /*!< EBU BUSWCON3: WAITINV Mask              */
#define EBU_BUSWCON3_BCGEN_Pos                20                                                      /*!< EBU BUSWCON3: BCGEN Position            */
#define EBU_BUSWCON3_BCGEN_Msk                (0x03UL << EBU_BUSWCON3_BCGEN_Pos)                      /*!< EBU BUSWCON3: BCGEN Mask                */
#define EBU_BUSWCON3_PORTW_Pos                22                                                      /*!< EBU BUSWCON3: PORTW Position            */
#define EBU_BUSWCON3_PORTW_Msk                (0x03UL << EBU_BUSWCON3_PORTW_Pos)                      /*!< EBU BUSWCON3: PORTW Mask                */
#define EBU_BUSWCON3_WAIT_Pos                 24                                                      /*!< EBU BUSWCON3: WAIT Position             */
#define EBU_BUSWCON3_WAIT_Msk                 (0x03UL << EBU_BUSWCON3_WAIT_Pos)                       /*!< EBU BUSWCON3: WAIT Mask                 */
#define EBU_BUSWCON3_AAP_Pos                  26                                                      /*!< EBU BUSWCON3: AAP Position              */
#define EBU_BUSWCON3_AAP_Msk                  (0x01UL << EBU_BUSWCON3_AAP_Pos)                        /*!< EBU BUSWCON3: AAP Mask                  */
#define EBU_BUSWCON3_LOCKCS_Pos               27                                                      /*!< EBU BUSWCON3: LOCKCS Position           */
#define EBU_BUSWCON3_LOCKCS_Msk               (0x01UL << EBU_BUSWCON3_LOCKCS_Pos)                     /*!< EBU BUSWCON3: LOCKCS Mask               */
#define EBU_BUSWCON3_AGEN_Pos                 28                                                      /*!< EBU BUSWCON3: AGEN Position             */
#define EBU_BUSWCON3_AGEN_Msk                 (0x0fUL << EBU_BUSWCON3_AGEN_Pos)                       /*!< EBU BUSWCON3: AGEN Mask                 */

/* ---------------------------------  EBU_BUSWAP3  -------------------------------- */
#define EBU_BUSWAP3_WRDTACS_Pos               0                                                       /*!< EBU BUSWAP3: WRDTACS Position           */
#define EBU_BUSWAP3_WRDTACS_Msk               (0x0fUL << EBU_BUSWAP3_WRDTACS_Pos)                     /*!< EBU BUSWAP3: WRDTACS Mask               */
#define EBU_BUSWAP3_WRRECOVC_Pos              4                                                       /*!< EBU BUSWAP3: WRRECOVC Position          */
#define EBU_BUSWAP3_WRRECOVC_Msk              (0x07UL << EBU_BUSWAP3_WRRECOVC_Pos)                    /*!< EBU BUSWAP3: WRRECOVC Mask              */
#define EBU_BUSWAP3_WAITWRC_Pos               7                                                       /*!< EBU BUSWAP3: WAITWRC Position           */
#define EBU_BUSWAP3_WAITWRC_Msk               (0x1fUL << EBU_BUSWAP3_WAITWRC_Pos)                     /*!< EBU BUSWAP3: WAITWRC Mask               */
#define EBU_BUSWAP3_DATAC_Pos                 12                                                      /*!< EBU BUSWAP3: DATAC Position             */
#define EBU_BUSWAP3_DATAC_Msk                 (0x0fUL << EBU_BUSWAP3_DATAC_Pos)                       /*!< EBU BUSWAP3: DATAC Mask                 */
#define EBU_BUSWAP3_EXTCLOCK_Pos              16                                                      /*!< EBU BUSWAP3: EXTCLOCK Position          */
#define EBU_BUSWAP3_EXTCLOCK_Msk              (0x03UL << EBU_BUSWAP3_EXTCLOCK_Pos)                    /*!< EBU BUSWAP3: EXTCLOCK Mask              */
#define EBU_BUSWAP3_EXTDATA_Pos               18                                                      /*!< EBU BUSWAP3: EXTDATA Position           */
#define EBU_BUSWAP3_EXTDATA_Msk               (0x03UL << EBU_BUSWAP3_EXTDATA_Pos)                     /*!< EBU BUSWAP3: EXTDATA Mask               */
#define EBU_BUSWAP3_CMDDELAY_Pos              20                                                      /*!< EBU BUSWAP3: CMDDELAY Position          */
#define EBU_BUSWAP3_CMDDELAY_Msk              (0x0fUL << EBU_BUSWAP3_CMDDELAY_Pos)                    /*!< EBU BUSWAP3: CMDDELAY Mask              */
#define EBU_BUSWAP3_AHOLDC_Pos                24                                                      /*!< EBU BUSWAP3: AHOLDC Position            */
#define EBU_BUSWAP3_AHOLDC_Msk                (0x0fUL << EBU_BUSWAP3_AHOLDC_Pos)                      /*!< EBU BUSWAP3: AHOLDC Mask                */
#define EBU_BUSWAP3_ADDRC_Pos                 28                                                      /*!< EBU BUSWAP3: ADDRC Position             */
#define EBU_BUSWAP3_ADDRC_Msk                 (0x0fUL << EBU_BUSWAP3_ADDRC_Pos)                       /*!< EBU BUSWAP3: ADDRC Mask                 */

/* ---------------------------------  EBU_SDRMCON  -------------------------------- */
#define EBU_SDRMCON_CRAS_Pos                  0                                                       /*!< EBU SDRMCON: CRAS Position              */
#define EBU_SDRMCON_CRAS_Msk                  (0x0fUL << EBU_SDRMCON_CRAS_Pos)                        /*!< EBU SDRMCON: CRAS Mask                  */
#define EBU_SDRMCON_CRFSH_Pos                 4                                                       /*!< EBU SDRMCON: CRFSH Position             */
#define EBU_SDRMCON_CRFSH_Msk                 (0x0fUL << EBU_SDRMCON_CRFSH_Pos)                       /*!< EBU SDRMCON: CRFSH Mask                 */
#define EBU_SDRMCON_CRSC_Pos                  8                                                       /*!< EBU SDRMCON: CRSC Position              */
#define EBU_SDRMCON_CRSC_Msk                  (0x03UL << EBU_SDRMCON_CRSC_Pos)                        /*!< EBU SDRMCON: CRSC Mask                  */
#define EBU_SDRMCON_CRP_Pos                   10                                                      /*!< EBU SDRMCON: CRP Position               */
#define EBU_SDRMCON_CRP_Msk                   (0x03UL << EBU_SDRMCON_CRP_Pos)                         /*!< EBU SDRMCON: CRP Mask                   */
#define EBU_SDRMCON_AWIDTH_Pos                12                                                      /*!< EBU SDRMCON: AWIDTH Position            */
#define EBU_SDRMCON_AWIDTH_Msk                (0x03UL << EBU_SDRMCON_AWIDTH_Pos)                      /*!< EBU SDRMCON: AWIDTH Mask                */
#define EBU_SDRMCON_CRCD_Pos                  14                                                      /*!< EBU SDRMCON: CRCD Position              */
#define EBU_SDRMCON_CRCD_Msk                  (0x03UL << EBU_SDRMCON_CRCD_Pos)                        /*!< EBU SDRMCON: CRCD Mask                  */
#define EBU_SDRMCON_CRC_Pos                   16                                                      /*!< EBU SDRMCON: CRC Position               */
#define EBU_SDRMCON_CRC_Msk                   (0x07UL << EBU_SDRMCON_CRC_Pos)                         /*!< EBU SDRMCON: CRC Mask                   */
#define EBU_SDRMCON_ROWM_Pos                  19                                                      /*!< EBU SDRMCON: ROWM Position              */
#define EBU_SDRMCON_ROWM_Msk                  (0x07UL << EBU_SDRMCON_ROWM_Pos)                        /*!< EBU SDRMCON: ROWM Mask                  */
#define EBU_SDRMCON_BANKM_Pos                 22                                                      /*!< EBU SDRMCON: BANKM Position             */
#define EBU_SDRMCON_BANKM_Msk                 (0x07UL << EBU_SDRMCON_BANKM_Pos)                       /*!< EBU SDRMCON: BANKM Mask                 */
#define EBU_SDRMCON_CRCE_Pos                  25                                                      /*!< EBU SDRMCON: CRCE Position              */
#define EBU_SDRMCON_CRCE_Msk                  (0x07UL << EBU_SDRMCON_CRCE_Pos)                        /*!< EBU SDRMCON: CRCE Mask                  */
#define EBU_SDRMCON_CLKDIS_Pos                28                                                      /*!< EBU SDRMCON: CLKDIS Position            */
#define EBU_SDRMCON_CLKDIS_Msk                (0x01UL << EBU_SDRMCON_CLKDIS_Pos)                      /*!< EBU SDRMCON: CLKDIS Mask                */
#define EBU_SDRMCON_PWR_MODE_Pos              29                                                      /*!< EBU SDRMCON: PWR_MODE Position          */
#define EBU_SDRMCON_PWR_MODE_Msk              (0x03UL << EBU_SDRMCON_PWR_MODE_Pos)                    /*!< EBU SDRMCON: PWR_MODE Mask              */
#define EBU_SDRMCON_SDCMSEL_Pos               31                                                      /*!< EBU SDRMCON: SDCMSEL Position           */
#define EBU_SDRMCON_SDCMSEL_Msk               (0x01UL << EBU_SDRMCON_SDCMSEL_Pos)                     /*!< EBU SDRMCON: SDCMSEL Mask               */

/* ---------------------------------  EBU_SDRMOD  --------------------------------- */
#define EBU_SDRMOD_BURSTL_Pos                 0                                                       /*!< EBU SDRMOD: BURSTL Position             */
#define EBU_SDRMOD_BURSTL_Msk                 (0x07UL << EBU_SDRMOD_BURSTL_Pos)                       /*!< EBU SDRMOD: BURSTL Mask                 */
#define EBU_SDRMOD_BTYP_Pos                   3                                                       /*!< EBU SDRMOD: BTYP Position               */
#define EBU_SDRMOD_BTYP_Msk                   (0x01UL << EBU_SDRMOD_BTYP_Pos)                         /*!< EBU SDRMOD: BTYP Mask                   */
#define EBU_SDRMOD_CASLAT_Pos                 4                                                       /*!< EBU SDRMOD: CASLAT Position             */
#define EBU_SDRMOD_CASLAT_Msk                 (0x07UL << EBU_SDRMOD_CASLAT_Pos)                       /*!< EBU SDRMOD: CASLAT Mask                 */
#define EBU_SDRMOD_OPMODE_Pos                 7                                                       /*!< EBU SDRMOD: OPMODE Position             */
#define EBU_SDRMOD_OPMODE_Msk                 (0x7fUL << EBU_SDRMOD_OPMODE_Pos)                       /*!< EBU SDRMOD: OPMODE Mask                 */
#define EBU_SDRMOD_COLDSTART_Pos              15                                                      /*!< EBU SDRMOD: COLDSTART Position          */
#define EBU_SDRMOD_COLDSTART_Msk              (0x01UL << EBU_SDRMOD_COLDSTART_Pos)                    /*!< EBU SDRMOD: COLDSTART Mask              */
#define EBU_SDRMOD_XOPM_Pos                   16                                                      /*!< EBU SDRMOD: XOPM Position               */
#define EBU_SDRMOD_XOPM_Msk                   (0x00000fffUL << EBU_SDRMOD_XOPM_Pos)                   /*!< EBU SDRMOD: XOPM Mask                   */
#define EBU_SDRMOD_XBA_Pos                    28                                                      /*!< EBU SDRMOD: XBA Position                */
#define EBU_SDRMOD_XBA_Msk                    (0x0fUL << EBU_SDRMOD_XBA_Pos)                          /*!< EBU SDRMOD: XBA Mask                    */

/* ---------------------------------  EBU_SDRMREF  -------------------------------- */
#define EBU_SDRMREF_REFRESHC_Pos              0                                                       /*!< EBU SDRMREF: REFRESHC Position          */
#define EBU_SDRMREF_REFRESHC_Msk              (0x3fUL << EBU_SDRMREF_REFRESHC_Pos)                    /*!< EBU SDRMREF: REFRESHC Mask              */
#define EBU_SDRMREF_REFRESHR_Pos              6                                                       /*!< EBU SDRMREF: REFRESHR Position          */
#define EBU_SDRMREF_REFRESHR_Msk              (0x07UL << EBU_SDRMREF_REFRESHR_Pos)                    /*!< EBU SDRMREF: REFRESHR Mask              */
#define EBU_SDRMREF_SELFREXST_Pos             9                                                       /*!< EBU SDRMREF: SELFREXST Position         */
#define EBU_SDRMREF_SELFREXST_Msk             (0x01UL << EBU_SDRMREF_SELFREXST_Pos)                   /*!< EBU SDRMREF: SELFREXST Mask             */
#define EBU_SDRMREF_SELFREX_Pos               10                                                      /*!< EBU SDRMREF: SELFREX Position           */
#define EBU_SDRMREF_SELFREX_Msk               (0x01UL << EBU_SDRMREF_SELFREX_Pos)                     /*!< EBU SDRMREF: SELFREX Mask               */
#define EBU_SDRMREF_SELFRENST_Pos             11                                                      /*!< EBU SDRMREF: SELFRENST Position         */
#define EBU_SDRMREF_SELFRENST_Msk             (0x01UL << EBU_SDRMREF_SELFRENST_Pos)                   /*!< EBU SDRMREF: SELFRENST Mask             */
#define EBU_SDRMREF_SELFREN_Pos               12                                                      /*!< EBU SDRMREF: SELFREN Position           */
#define EBU_SDRMREF_SELFREN_Msk               (0x01UL << EBU_SDRMREF_SELFREN_Pos)                     /*!< EBU SDRMREF: SELFREN Mask               */
#define EBU_SDRMREF_AUTOSELFR_Pos             13                                                      /*!< EBU SDRMREF: AUTOSELFR Position         */
#define EBU_SDRMREF_AUTOSELFR_Msk             (0x01UL << EBU_SDRMREF_AUTOSELFR_Pos)                   /*!< EBU SDRMREF: AUTOSELFR Mask             */
#define EBU_SDRMREF_ERFSHC_Pos                14                                                      /*!< EBU SDRMREF: ERFSHC Position            */
#define EBU_SDRMREF_ERFSHC_Msk                (0x03UL << EBU_SDRMREF_ERFSHC_Pos)                      /*!< EBU SDRMREF: ERFSHC Mask                */
#define EBU_SDRMREF_SELFREX_DLY_Pos           16                                                      /*!< EBU SDRMREF: SELFREX_DLY Position       */
#define EBU_SDRMREF_SELFREX_DLY_Msk           (0x000000ffUL << EBU_SDRMREF_SELFREX_DLY_Pos)           /*!< EBU SDRMREF: SELFREX_DLY Mask           */
#define EBU_SDRMREF_ARFSH_Pos                 24                                                      /*!< EBU SDRMREF: ARFSH Position             */
#define EBU_SDRMREF_ARFSH_Msk                 (0x01UL << EBU_SDRMREF_ARFSH_Pos)                       /*!< EBU SDRMREF: ARFSH Mask                 */
#define EBU_SDRMREF_RES_DLY_Pos               25                                                      /*!< EBU SDRMREF: RES_DLY Position           */
#define EBU_SDRMREF_RES_DLY_Msk               (0x07UL << EBU_SDRMREF_RES_DLY_Pos)                     /*!< EBU SDRMREF: RES_DLY Mask               */

/* ---------------------------------  EBU_SDRSTAT  -------------------------------- */
#define EBU_SDRSTAT_REFERR_Pos                0                                                       /*!< EBU SDRSTAT: REFERR Position            */
#define EBU_SDRSTAT_REFERR_Msk                (0x01UL << EBU_SDRSTAT_REFERR_Pos)                      /*!< EBU SDRSTAT: REFERR Mask                */
#define EBU_SDRSTAT_SDRMBUSY_Pos              1                                                       /*!< EBU SDRSTAT: SDRMBUSY Position          */
#define EBU_SDRSTAT_SDRMBUSY_Msk              (0x01UL << EBU_SDRSTAT_SDRMBUSY_Pos)                    /*!< EBU SDRSTAT: SDRMBUSY Mask              */
#define EBU_SDRSTAT_SDERR_Pos                 2                                                       /*!< EBU SDRSTAT: SDERR Position             */
#define EBU_SDRSTAT_SDERR_Msk                 (0x01UL << EBU_SDRSTAT_SDERR_Pos)                       /*!< EBU SDRSTAT: SDERR Mask                 */


/* ================================================================================ */
/* ================        struct 'ETH0_CON' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  ETH0_CON_ETH0_CON  ----------------------------- */
#define ETH_CON_RXD0_Pos            0                                                       /*!< ETH0_CON ETH0_CON: RXD0 Position        */
#define ETH_CON_RXD0_Msk            (0x03UL << ETH_CON_RXD0_Pos)                  /*!< ETH0_CON ETH0_CON: RXD0 Mask            */
#define ETH_CON_RXD1_Pos            2                                                       /*!< ETH0_CON ETH0_CON: RXD1 Position        */
#define ETH_CON_RXD1_Msk            (0x03UL << ETH_CON_RXD1_Pos)                  /*!< ETH0_CON ETH0_CON: RXD1 Mask            */
#define ETH_CON_RXD2_Pos            4                                                       /*!< ETH0_CON ETH0_CON: RXD2 Position        */
#define ETH_CON_RXD2_Msk            (0x03UL << ETH_CON_RXD2_Pos)                  /*!< ETH0_CON ETH0_CON: RXD2 Mask            */
#define ETH_CON_RXD3_Pos            6                                                       /*!< ETH0_CON ETH0_CON: RXD3 Position        */
#define ETH_CON_RXD3_Msk            (0x03UL << ETH_CON_RXD3_Pos)                  /*!< ETH0_CON ETH0_CON: RXD3 Mask            */
#define ETH_CON_CLK_RMII_Pos        8                                                       /*!< ETH0_CON ETH0_CON: CLK_RMII Position    */
#define ETH_CON_CLK_RMII_Msk        (0x03UL << ETH_CON_CLK_RMII_Pos)              /*!< ETH0_CON ETH0_CON: CLK_RMII Mask        */
#define ETH_CON_CRS_DV_Pos          10                                                      /*!< ETH0_CON ETH0_CON: CRS_DV Position      */
#define ETH_CON_CRS_DV_Msk          (0x03UL << ETH_CON_CRS_DV_Pos)                /*!< ETH0_CON ETH0_CON: CRS_DV Mask          */
#define ETH_CON_CRS_Pos             12                                                      /*!< ETH0_CON ETH0_CON: CRS Position         */
#define ETH_CON_CRS_Msk             (0x03UL << ETH_CON_CRS_Pos)                   /*!< ETH0_CON ETH0_CON: CRS Mask             */
#define ETH_CON_RXER_Pos            14                                                      /*!< ETH0_CON ETH0_CON: RXER Position        */
#define ETH_CON_RXER_Msk            (0x03UL << ETH_CON_RXER_Pos)                  /*!< ETH0_CON ETH0_CON: RXER Mask            */
#define ETH_CON_COL_Pos             16                                                      /*!< ETH0_CON ETH0_CON: COL Position         */
#define ETH_CON_COL_Msk             (0x03UL << ETH_CON_COL_Pos)                   /*!< ETH0_CON ETH0_CON: COL Mask             */
#define ETH_CON_CLK_TX_Pos          18                                                      /*!< ETH0_CON ETH0_CON: CLK_TX Position      */
#define ETH_CON_CLK_TX_Msk          (0x03UL << ETH_CON_CLK_TX_Pos)                /*!< ETH0_CON ETH0_CON: CLK_TX Mask          */
#define ETH_CON_MDIO_Pos            22                                                      /*!< ETH0_CON ETH0_CON: MDIO Position        */
#define ETH_CON_MDIO_Msk            (0x03UL << ETH_CON_MDIO_Pos)                  /*!< ETH0_CON ETH0_CON: MDIO Mask            */
#define ETH_CON_INFSEL_Pos          26                                                      /*!< ETH0_CON ETH0_CON: INFSEL Position      */
#define ETH_CON_INFSEL_Msk          (0x01UL << ETH_CON_INFSEL_Pos)                /*!< ETH0_CON ETH0_CON: INFSEL Mask          */


/* ================================================================================ */
/* ================           Group 'ETH' Position & Mask          ================ */
/* ================================================================================ */


