FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ---------------------------------  PORT4_IOCR4  -------------------------------- */
#define PORT4_IOCR4_PC4_Pos                   3                                                       /*!< PORT4 IOCR4: PC4 Position               */
#define PORT4_IOCR4_PC4_Msk                   (0x1fUL << PORT4_IOCR4_PC4_Pos)                         /*!< PORT4 IOCR4: PC4 Mask                   */
#define PORT4_IOCR4_PC5_Pos                   11                                                      /*!< PORT4 IOCR4: PC5 Position               */
#define PORT4_IOCR4_PC5_Msk                   (0x1fUL << PORT4_IOCR4_PC5_Pos)                         /*!< PORT4 IOCR4: PC5 Mask                   */
#define PORT4_IOCR4_PC6_Pos                   19                                                      /*!< PORT4 IOCR4: PC6 Position               */
#define PORT4_IOCR4_PC6_Msk                   (0x1fUL << PORT4_IOCR4_PC6_Pos)                         /*!< PORT4 IOCR4: PC6 Mask                   */
#define PORT4_IOCR4_PC7_Pos                   27                                                      /*!< PORT4 IOCR4: PC7 Position               */
#define PORT4_IOCR4_PC7_Msk                   (0x1fUL << PORT4_IOCR4_PC7_Pos)                         /*!< PORT4 IOCR4: PC7 Mask                   */

/* ----------------------------------  PORT4_IN  ---------------------------------- */
#define PORT4_IN_P0_Pos                       0                                                       /*!< PORT4 IN: P0 Position                   */
#define PORT4_IN_P0_Msk                       (0x01UL << PORT4_IN_P0_Pos)                             /*!< PORT4 IN: P0 Mask                       */
#define PORT4_IN_P1_Pos                       1                                                       /*!< PORT4 IN: P1 Position                   */
#define PORT4_IN_P1_Msk                       (0x01UL << PORT4_IN_P1_Pos)                             /*!< PORT4 IN: P1 Mask                       */
#define PORT4_IN_P2_Pos                       2                                                       /*!< PORT4 IN: P2 Position                   */
#define PORT4_IN_P2_Msk                       (0x01UL << PORT4_IN_P2_Pos)                             /*!< PORT4 IN: P2 Mask                       */
#define PORT4_IN_P3_Pos                       3                                                       /*!< PORT4 IN: P3 Position                   */
#define PORT4_IN_P3_Msk                       (0x01UL << PORT4_IN_P3_Pos)                             /*!< PORT4 IN: P3 Mask                       */
#define PORT4_IN_P4_Pos                       4                                                       /*!< PORT4 IN: P4 Position                   */
#define PORT4_IN_P4_Msk                       (0x01UL << PORT4_IN_P4_Pos)                             /*!< PORT4 IN: P4 Mask                       */
#define PORT4_IN_P5_Pos                       5                                                       /*!< PORT4 IN: P5 Position                   */
#define PORT4_IN_P5_Msk                       (0x01UL << PORT4_IN_P5_Pos)                             /*!< PORT4 IN: P5 Mask                       */
#define PORT4_IN_P6_Pos                       6                                                       /*!< PORT4 IN: P6 Position                   */
#define PORT4_IN_P6_Msk                       (0x01UL << PORT4_IN_P6_Pos)                             /*!< PORT4 IN: P6 Mask                       */
#define PORT4_IN_P7_Pos                       7                                                       /*!< PORT4 IN: P7 Position                   */
#define PORT4_IN_P7_Msk                       (0x01UL << PORT4_IN_P7_Pos)                             /*!< PORT4 IN: P7 Mask                       */
#define PORT4_IN_P8_Pos                       8                                                       /*!< PORT4 IN: P8 Position                   */
#define PORT4_IN_P8_Msk                       (0x01UL << PORT4_IN_P8_Pos)                             /*!< PORT4 IN: P8 Mask                       */
#define PORT4_IN_P9_Pos                       9                                                       /*!< PORT4 IN: P9 Position                   */
#define PORT4_IN_P9_Msk                       (0x01UL << PORT4_IN_P9_Pos)                             /*!< PORT4 IN: P9 Mask                       */
#define PORT4_IN_P10_Pos                      10                                                      /*!< PORT4 IN: P10 Position                  */
#define PORT4_IN_P10_Msk                      (0x01UL << PORT4_IN_P10_Pos)                            /*!< PORT4 IN: P10 Mask                      */
#define PORT4_IN_P11_Pos                      11                                                      /*!< PORT4 IN: P11 Position                  */
#define PORT4_IN_P11_Msk                      (0x01UL << PORT4_IN_P11_Pos)                            /*!< PORT4 IN: P11 Mask                      */
#define PORT4_IN_P12_Pos                      12                                                      /*!< PORT4 IN: P12 Position                  */
#define PORT4_IN_P12_Msk                      (0x01UL << PORT4_IN_P12_Pos)                            /*!< PORT4 IN: P12 Mask                      */
#define PORT4_IN_P13_Pos                      13                                                      /*!< PORT4 IN: P13 Position                  */
#define PORT4_IN_P13_Msk                      (0x01UL << PORT4_IN_P13_Pos)                            /*!< PORT4 IN: P13 Mask                      */
#define PORT4_IN_P14_Pos                      14                                                      /*!< PORT4 IN: P14 Position                  */
#define PORT4_IN_P14_Msk                      (0x01UL << PORT4_IN_P14_Pos)                            /*!< PORT4 IN: P14 Mask                      */
#define PORT4_IN_P15_Pos                      15                                                      /*!< PORT4 IN: P15 Position                  */
#define PORT4_IN_P15_Msk                      (0x01UL << PORT4_IN_P15_Pos)                            /*!< PORT4 IN: P15 Mask                      */

