FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ----------------------------------  PORT5_OMR  --------------------------------- */
#define PORT5_OMR_PS0_Pos                     0                                                       /*!< PORT5 OMR: PS0 Position                 */
#define PORT5_OMR_PS0_Msk                     (0x01UL << PORT5_OMR_PS0_Pos)                           /*!< PORT5 OMR: PS0 Mask                     */
#define PORT5_OMR_PS1_Pos                     1                                                       /*!< PORT5 OMR: PS1 Position                 */
#define PORT5_OMR_PS1_Msk                     (0x01UL << PORT5_OMR_PS1_Pos)                           /*!< PORT5 OMR: PS1 Mask                     */
#define PORT5_OMR_PS2_Pos                     2                                                       /*!< PORT5 OMR: PS2 Position                 */
#define PORT5_OMR_PS2_Msk                     (0x01UL << PORT5_OMR_PS2_Pos)                           /*!< PORT5 OMR: PS2 Mask                     */
#define PORT5_OMR_PS3_Pos                     3                                                       /*!< PORT5 OMR: PS3 Position                 */
#define PORT5_OMR_PS3_Msk                     (0x01UL << PORT5_OMR_PS3_Pos)                           /*!< PORT5 OMR: PS3 Mask                     */
#define PORT5_OMR_PS4_Pos                     4                                                       /*!< PORT5 OMR: PS4 Position                 */
#define PORT5_OMR_PS4_Msk                     (0x01UL << PORT5_OMR_PS4_Pos)                           /*!< PORT5 OMR: PS4 Mask                     */
#define PORT5_OMR_PS5_Pos                     5                                                       /*!< PORT5 OMR: PS5 Position                 */
#define PORT5_OMR_PS5_Msk                     (0x01UL << PORT5_OMR_PS5_Pos)                           /*!< PORT5 OMR: PS5 Mask                     */
#define PORT5_OMR_PS6_Pos                     6                                                       /*!< PORT5 OMR: PS6 Position                 */
#define PORT5_OMR_PS6_Msk                     (0x01UL << PORT5_OMR_PS6_Pos)                           /*!< PORT5 OMR: PS6 Mask                     */
#define PORT5_OMR_PS7_Pos                     7                                                       /*!< PORT5 OMR: PS7 Position                 */
#define PORT5_OMR_PS7_Msk                     (0x01UL << PORT5_OMR_PS7_Pos)                           /*!< PORT5 OMR: PS7 Mask                     */
#define PORT5_OMR_PS8_Pos                     8                                                       /*!< PORT5 OMR: PS8 Position                 */
#define PORT5_OMR_PS8_Msk                     (0x01UL << PORT5_OMR_PS8_Pos)                           /*!< PORT5 OMR: PS8 Mask                     */
#define PORT5_OMR_PS9_Pos                     9                                                       /*!< PORT5 OMR: PS9 Position                 */
#define PORT5_OMR_PS9_Msk                     (0x01UL << PORT5_OMR_PS9_Pos)                           /*!< PORT5 OMR: PS9 Mask                     */
#define PORT5_OMR_PS10_Pos                    10                                                      /*!< PORT5 OMR: PS10 Position                */
#define PORT5_OMR_PS10_Msk                    (0x01UL << PORT5_OMR_PS10_Pos)                          /*!< PORT5 OMR: PS10 Mask                    */
#define PORT5_OMR_PS11_Pos                    11                                                      /*!< PORT5 OMR: PS11 Position                */
#define PORT5_OMR_PS11_Msk                    (0x01UL << PORT5_OMR_PS11_Pos)                          /*!< PORT5 OMR: PS11 Mask                    */
#define PORT5_OMR_PS12_Pos                    12                                                      /*!< PORT5 OMR: PS12 Position                */
#define PORT5_OMR_PS12_Msk                    (0x01UL << PORT5_OMR_PS12_Pos)                          /*!< PORT5 OMR: PS12 Mask                    */
#define PORT5_OMR_PS13_Pos                    13                                                      /*!< PORT5 OMR: PS13 Position                */
#define PORT5_OMR_PS13_Msk                    (0x01UL << PORT5_OMR_PS13_Pos)                          /*!< PORT5 OMR: PS13 Mask                    */
#define PORT5_OMR_PS14_Pos                    14                                                      /*!< PORT5 OMR: PS14 Position                */
#define PORT5_OMR_PS14_Msk                    (0x01UL << PORT5_OMR_PS14_Pos)                          /*!< PORT5 OMR: PS14 Mask                    */
#define PORT5_OMR_PS15_Pos                    15                                                      /*!< PORT5 OMR: PS15 Position                */
#define PORT5_OMR_PS15_Msk                    (0x01UL << PORT5_OMR_PS15_Pos)                          /*!< PORT5 OMR: PS15 Mask                    */
#define PORT5_OMR_PR0_Pos                     16                                                      /*!< PORT5 OMR: PR0 Position                 */
#define PORT5_OMR_PR0_Msk                     (0x01UL << PORT5_OMR_PR0_Pos)                           /*!< PORT5 OMR: PR0 Mask                     */
#define PORT5_OMR_PR1_Pos                     17                                                      /*!< PORT5 OMR: PR1 Position                 */
#define PORT5_OMR_PR1_Msk                     (0x01UL << PORT5_OMR_PR1_Pos)                           /*!< PORT5 OMR: PR1 Mask                     */
#define PORT5_OMR_PR2_Pos                     18                                                      /*!< PORT5 OMR: PR2 Position                 */
#define PORT5_OMR_PR2_Msk                     (0x01UL << PORT5_OMR_PR2_Pos)                           /*!< PORT5 OMR: PR2 Mask                     */
#define PORT5_OMR_PR3_Pos                     19                                                      /*!< PORT5 OMR: PR3 Position                 */
#define PORT5_OMR_PR3_Msk                     (0x01UL << PORT5_OMR_PR3_Pos)                           /*!< PORT5 OMR: PR3 Mask                     */
#define PORT5_OMR_PR4_Pos                     20                                                      /*!< PORT5 OMR: PR4 Position                 */
#define PORT5_OMR_PR4_Msk                     (0x01UL << PORT5_OMR_PR4_Pos)                           /*!< PORT5 OMR: PR4 Mask                     */
#define PORT5_OMR_PR5_Pos                     21                                                      /*!< PORT5 OMR: PR5 Position                 */
#define PORT5_OMR_PR5_Msk                     (0x01UL << PORT5_OMR_PR5_Pos)                           /*!< PORT5 OMR: PR5 Mask                     */
#define PORT5_OMR_PR6_Pos                     22                                                      /*!< PORT5 OMR: PR6 Position                 */
#define PORT5_OMR_PR6_Msk                     (0x01UL << PORT5_OMR_PR6_Pos)                           /*!< PORT5 OMR: PR6 Mask                     */
#define PORT5_OMR_PR7_Pos                     23                                                      /*!< PORT5 OMR: PR7 Position                 */
#define PORT5_OMR_PR7_Msk                     (0x01UL << PORT5_OMR_PR7_Pos)                           /*!< PORT5 OMR: PR7 Mask                     */
#define PORT5_OMR_PR8_Pos                     24                                                      /*!< PORT5 OMR: PR8 Position                 */
#define PORT5_OMR_PR8_Msk                     (0x01UL << PORT5_OMR_PR8_Pos)                           /*!< PORT5 OMR: PR8 Mask                     */
#define PORT5_OMR_PR9_Pos                     25                                                      /*!< PORT5 OMR: PR9 Position                 */
#define PORT5_OMR_PR9_Msk                     (0x01UL << PORT5_OMR_PR9_Pos)                           /*!< PORT5 OMR: PR9 Mask                     */
#define PORT5_OMR_PR10_Pos                    26                                                      /*!< PORT5 OMR: PR10 Position                */
#define PORT5_OMR_PR10_Msk                    (0x01UL << PORT5_OMR_PR10_Pos)                          /*!< PORT5 OMR: PR10 Mask                    */
#define PORT5_OMR_PR11_Pos                    27                                                      /*!< PORT5 OMR: PR11 Position                */
#define PORT5_OMR_PR11_Msk                    (0x01UL << PORT5_OMR_PR11_Pos)                          /*!< PORT5 OMR: PR11 Mask                    */
#define PORT5_OMR_PR12_Pos                    28                                                      /*!< PORT5 OMR: PR12 Position                */
#define PORT5_OMR_PR12_Msk                    (0x01UL << PORT5_OMR_PR12_Pos)                          /*!< PORT5 OMR: PR12 Mask                    */
#define PORT5_OMR_PR13_Pos                    29                                                      /*!< PORT5 OMR: PR13 Position                */
#define PORT5_OMR_PR13_Msk                    (0x01UL << PORT5_OMR_PR13_Pos)                          /*!< PORT5 OMR: PR13 Mask                    */
#define PORT5_OMR_PR14_Pos                    30                                                      /*!< PORT5 OMR: PR14 Position                */
#define PORT5_OMR_PR14_Msk                    (0x01UL << PORT5_OMR_PR14_Pos)                          /*!< PORT5 OMR: PR14 Mask                    */
#define PORT5_OMR_PR15_Pos                    31                                                      /*!< PORT5 OMR: PR15 Position                */
#define PORT5_OMR_PR15_Msk                    (0x01UL << PORT5_OMR_PR15_Pos)                          /*!< PORT5 OMR: PR15 Mask                    */

/* ---------------------------------  PORT5_IOCR0  -------------------------------- */
#define PORT5_IOCR0_PC0_Pos                   3                                                       /*!< PORT5 IOCR0: PC0 Position               */
#define PORT5_IOCR0_PC0_Msk                   (0x1fUL << PORT5_IOCR0_PC0_Pos)                         /*!< PORT5 IOCR0: PC0 Mask                   */
#define PORT5_IOCR0_PC1_Pos                   11                                                      /*!< PORT5 IOCR0: PC1 Position               */
#define PORT5_IOCR0_PC1_Msk                   (0x1fUL << PORT5_IOCR0_PC1_Pos)                         /*!< PORT5 IOCR0: PC1 Mask                   */
#define PORT5_IOCR0_PC2_Pos                   19                                                      /*!< PORT5 IOCR0: PC2 Position               */
#define PORT5_IOCR0_PC2_Msk                   (0x1fUL << PORT5_IOCR0_PC2_Pos)                         /*!< PORT5 IOCR0: PC2 Mask                   */
#define PORT5_IOCR0_PC3_Pos                   27                                                      /*!< PORT5 IOCR0: PC3 Position               */
#define PORT5_IOCR0_PC3_Msk                   (0x1fUL << PORT5_IOCR0_PC3_Pos)                         /*!< PORT5 IOCR0: PC3 Mask                   */

/* ---------------------------------  PORT5_IOCR4  -------------------------------- */
#define PORT5_IOCR4_PC4_Pos                   3                                                       /*!< PORT5 IOCR4: PC4 Position               */
#define PORT5_IOCR4_PC4_Msk                   (0x1fUL << PORT5_IOCR4_PC4_Pos)                         /*!< PORT5 IOCR4: PC4 Mask                   */
#define PORT5_IOCR4_PC5_Pos                   11                                                      /*!< PORT5 IOCR4: PC5 Position               */
#define PORT5_IOCR4_PC5_Msk                   (0x1fUL << PORT5_IOCR4_PC5_Pos)                         /*!< PORT5 IOCR4: PC5 Mask                   */
#define PORT5_IOCR4_PC6_Pos                   19                                                      /*!< PORT5 IOCR4: PC6 Position               */
#define PORT5_IOCR4_PC6_Msk                   (0x1fUL << PORT5_IOCR4_PC6_Pos)                         /*!< PORT5 IOCR4: PC6 Mask                   */
#define PORT5_IOCR4_PC7_Pos                   27                                                      /*!< PORT5 IOCR4: PC7 Position               */
#define PORT5_IOCR4_PC7_Msk                   (0x1fUL << PORT5_IOCR4_PC7_Pos)                         /*!< PORT5 IOCR4: PC7 Mask                   */

/* ---------------------------------  PORT5_IOCR8  -------------------------------- */
#define PORT5_IOCR8_PC8_Pos                   3                                                       /*!< PORT5 IOCR8: PC8 Position               */
#define PORT5_IOCR8_PC8_Msk                   (0x1fUL << PORT5_IOCR8_PC8_Pos)                         /*!< PORT5 IOCR8: PC8 Mask                   */
#define PORT5_IOCR8_PC9_Pos                   11                                                      /*!< PORT5 IOCR8: PC9 Position               */
#define PORT5_IOCR8_PC9_Msk                   (0x1fUL << PORT5_IOCR8_PC9_Pos)                         /*!< PORT5 IOCR8: PC9 Mask                   */
#define PORT5_IOCR8_PC10_Pos                  19                                                      /*!< PORT5 IOCR8: PC10 Position              */
#define PORT5_IOCR8_PC10_Msk                  (0x1fUL << PORT5_IOCR8_PC10_Pos)                        /*!< PORT5 IOCR8: PC10 Mask                  */
#define PORT5_IOCR8_PC11_Pos                  27                                                      /*!< PORT5 IOCR8: PC11 Position              */
#define PORT5_IOCR8_PC11_Msk                  (0x1fUL << PORT5_IOCR8_PC11_Pos)                        /*!< PORT5 IOCR8: PC11 Mask                  */

