FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ---------------------------------  PORT6_PDR0  --------------------------------- */
#define PORT6_PDR0_PD0_Pos                    0                                                       /*!< PORT6 PDR0: PD0 Position                */
#define PORT6_PDR0_PD0_Msk                    (0x07UL << PORT6_PDR0_PD0_Pos)                          /*!< PORT6 PDR0: PD0 Mask                    */
#define PORT6_PDR0_PD1_Pos                    4                                                       /*!< PORT6 PDR0: PD1 Position                */
#define PORT6_PDR0_PD1_Msk                    (0x07UL << PORT6_PDR0_PD1_Pos)                          /*!< PORT6 PDR0: PD1 Mask                    */
#define PORT6_PDR0_PD2_Pos                    8                                                       /*!< PORT6 PDR0: PD2 Position                */
#define PORT6_PDR0_PD2_Msk                    (0x07UL << PORT6_PDR0_PD2_Pos)                          /*!< PORT6 PDR0: PD2 Mask                    */
#define PORT6_PDR0_PD3_Pos                    12                                                      /*!< PORT6 PDR0: PD3 Position                */
#define PORT6_PDR0_PD3_Msk                    (0x07UL << PORT6_PDR0_PD3_Pos)                          /*!< PORT6 PDR0: PD3 Mask                    */
#define PORT6_PDR0_PD4_Pos                    16                                                      /*!< PORT6 PDR0: PD4 Position                */
#define PORT6_PDR0_PD4_Msk                    (0x07UL << PORT6_PDR0_PD4_Pos)                          /*!< PORT6 PDR0: PD4 Mask                    */
#define PORT6_PDR0_PD5_Pos                    20                                                      /*!< PORT6 PDR0: PD5 Position                */
#define PORT6_PDR0_PD5_Msk                    (0x07UL << PORT6_PDR0_PD5_Pos)                          /*!< PORT6 PDR0: PD5 Mask                    */
#define PORT6_PDR0_PD6_Pos                    24                                                      /*!< PORT6 PDR0: PD6 Position                */
#define PORT6_PDR0_PD6_Msk                    (0x07UL << PORT6_PDR0_PD6_Pos)                          /*!< PORT6 PDR0: PD6 Mask                    */
#define PORT6_PDR0_PD7_Pos                    28                                                      /*!< PORT6 PDR0: PD7 Position                */
#define PORT6_PDR0_PD7_Msk                    (0x07UL << PORT6_PDR0_PD7_Pos)                          /*!< PORT6 PDR0: PD7 Mask                    */

/* ---------------------------------  PORT6_PDISC  -------------------------------- */
#define PORT6_PDISC_PDIS0_Pos                 0                                                       /*!< PORT6 PDISC: PDIS0 Position             */
#define PORT6_PDISC_PDIS0_Msk                 (0x01UL << PORT6_PDISC_PDIS0_Pos)                       /*!< PORT6 PDISC: PDIS0 Mask                 */
#define PORT6_PDISC_PDIS1_Pos                 1                                                       /*!< PORT6 PDISC: PDIS1 Position             */
#define PORT6_PDISC_PDIS1_Msk                 (0x01UL << PORT6_PDISC_PDIS1_Pos)                       /*!< PORT6 PDISC: PDIS1 Mask                 */
#define PORT6_PDISC_PDIS2_Pos                 2                                                       /*!< PORT6 PDISC: PDIS2 Position             */
#define PORT6_PDISC_PDIS2_Msk                 (0x01UL << PORT6_PDISC_PDIS2_Pos)                       /*!< PORT6 PDISC: PDIS2 Mask                 */
#define PORT6_PDISC_PDIS3_Pos                 3                                                       /*!< PORT6 PDISC: PDIS3 Position             */
#define PORT6_PDISC_PDIS3_Msk                 (0x01UL << PORT6_PDISC_PDIS3_Pos)                       /*!< PORT6 PDISC: PDIS3 Mask                 */
#define PORT6_PDISC_PDIS4_Pos                 4                                                       /*!< PORT6 PDISC: PDIS4 Position             */
#define PORT6_PDISC_PDIS4_Msk                 (0x01UL << PORT6_PDISC_PDIS4_Pos)                       /*!< PORT6 PDISC: PDIS4 Mask                 */
#define PORT6_PDISC_PDIS5_Pos                 5                                                       /*!< PORT6 PDISC: PDIS5 Position             */
#define PORT6_PDISC_PDIS5_Msk                 (0x01UL << PORT6_PDISC_PDIS5_Pos)                       /*!< PORT6 PDISC: PDIS5 Mask                 */
#define PORT6_PDISC_PDIS6_Pos                 6                                                       /*!< PORT6 PDISC: PDIS6 Position             */
#define PORT6_PDISC_PDIS6_Msk                 (0x01UL << PORT6_PDISC_PDIS6_Pos)                       /*!< PORT6 PDISC: PDIS6 Mask                 */
#define PORT6_PDISC_PDIS7_Pos                 7                                                       /*!< PORT6 PDISC: PDIS7 Position             */
#define PORT6_PDISC_PDIS7_Msk                 (0x01UL << PORT6_PDISC_PDIS7_Pos)                       /*!< PORT6 PDISC: PDIS7 Mask                 */
#define PORT6_PDISC_PDIS8_Pos                 8                                                       /*!< PORT6 PDISC: PDIS8 Position             */
#define PORT6_PDISC_PDIS8_Msk                 (0x01UL << PORT6_PDISC_PDIS8_Pos)                       /*!< PORT6 PDISC: PDIS8 Mask                 */
#define PORT6_PDISC_PDIS9_Pos                 9                                                       /*!< PORT6 PDISC: PDIS9 Position             */
#define PORT6_PDISC_PDIS9_Msk                 (0x01UL << PORT6_PDISC_PDIS9_Pos)                       /*!< PORT6 PDISC: PDIS9 Mask                 */
#define PORT6_PDISC_PDIS10_Pos                10                                                      /*!< PORT6 PDISC: PDIS10 Position            */
#define PORT6_PDISC_PDIS10_Msk                (0x01UL << PORT6_PDISC_PDIS10_Pos)                      /*!< PORT6 PDISC: PDIS10 Mask                */
#define PORT6_PDISC_PDIS11_Pos                11                                                      /*!< PORT6 PDISC: PDIS11 Position            */
#define PORT6_PDISC_PDIS11_Msk                (0x01UL << PORT6_PDISC_PDIS11_Pos)                      /*!< PORT6 PDISC: PDIS11 Mask                */
#define PORT6_PDISC_PDIS12_Pos                12                                                      /*!< PORT6 PDISC: PDIS12 Position            */
#define PORT6_PDISC_PDIS12_Msk                (0x01UL << PORT6_PDISC_PDIS12_Pos)                      /*!< PORT6 PDISC: PDIS12 Mask                */
#define PORT6_PDISC_PDIS13_Pos                13                                                      /*!< PORT6 PDISC: PDIS13 Position            */
#define PORT6_PDISC_PDIS13_Msk                (0x01UL << PORT6_PDISC_PDIS13_Pos)                      /*!< PORT6 PDISC: PDIS13 Mask                */
#define PORT6_PDISC_PDIS14_Pos                14                                                      /*!< PORT6 PDISC: PDIS14 Position            */
#define PORT6_PDISC_PDIS14_Msk                (0x01UL << PORT6_PDISC_PDIS14_Pos)                      /*!< PORT6 PDISC: PDIS14 Mask                */
#define PORT6_PDISC_PDIS15_Pos                15                                                      /*!< PORT6 PDISC: PDIS15 Position            */
#define PORT6_PDISC_PDIS15_Msk                (0x01UL << PORT6_PDISC_PDIS15_Pos)                      /*!< PORT6 PDISC: PDIS15 Mask                */

/* ----------------------------------  PORT6_PPS  --------------------------------- */
#define PORT6_PPS_PPS0_Pos                    0                                                       /*!< PORT6 PPS: PPS0 Position                */
#define PORT6_PPS_PPS0_Msk                    (0x01UL << PORT6_PPS_PPS0_Pos)                          /*!< PORT6 PPS: PPS0 Mask                    */
#define PORT6_PPS_PPS1_Pos                    1                                                       /*!< PORT6 PPS: PPS1 Position                */
#define PORT6_PPS_PPS1_Msk                    (0x01UL << PORT6_PPS_PPS1_Pos)                          /*!< PORT6 PPS: PPS1 Mask                    */
#define PORT6_PPS_PPS2_Pos                    2                                                       /*!< PORT6 PPS: PPS2 Position                */
#define PORT6_PPS_PPS2_Msk                    (0x01UL << PORT6_PPS_PPS2_Pos)                          /*!< PORT6 PPS: PPS2 Mask                    */
#define PORT6_PPS_PPS3_Pos                    3                                                       /*!< PORT6 PPS: PPS3 Position                */
#define PORT6_PPS_PPS3_Msk                    (0x01UL << PORT6_PPS_PPS3_Pos)                          /*!< PORT6 PPS: PPS3 Mask                    */
#define PORT6_PPS_PPS4_Pos                    4                                                       /*!< PORT6 PPS: PPS4 Position                */
#define PORT6_PPS_PPS4_Msk                    (0x01UL << PORT6_PPS_PPS4_Pos)                          /*!< PORT6 PPS: PPS4 Mask                    */
#define PORT6_PPS_PPS5_Pos                    5                                                       /*!< PORT6 PPS: PPS5 Position                */
#define PORT6_PPS_PPS5_Msk                    (0x01UL << PORT6_PPS_PPS5_Pos)                          /*!< PORT6 PPS: PPS5 Mask                    */
#define PORT6_PPS_PPS6_Pos                    6                                                       /*!< PORT6 PPS: PPS6 Position                */
#define PORT6_PPS_PPS6_Msk                    (0x01UL << PORT6_PPS_PPS6_Pos)                          /*!< PORT6 PPS: PPS6 Mask                    */
#define PORT6_PPS_PPS7_Pos                    7                                                       /*!< PORT6 PPS: PPS7 Position                */
#define PORT6_PPS_PPS7_Msk                    (0x01UL << PORT6_PPS_PPS7_Pos)                          /*!< PORT6 PPS: PPS7 Mask                    */
#define PORT6_PPS_PPS8_Pos                    8                                                       /*!< PORT6 PPS: PPS8 Position                */
#define PORT6_PPS_PPS8_Msk                    (0x01UL << PORT6_PPS_PPS8_Pos)                          /*!< PORT6 PPS: PPS8 Mask                    */
#define PORT6_PPS_PPS9_Pos                    9                                                       /*!< PORT6 PPS: PPS9 Position                */
#define PORT6_PPS_PPS9_Msk                    (0x01UL << PORT6_PPS_PPS9_Pos)                          /*!< PORT6 PPS: PPS9 Mask                    */
#define PORT6_PPS_PPS10_Pos                   10                                                      /*!< PORT6 PPS: PPS10 Position               */
#define PORT6_PPS_PPS10_Msk                   (0x01UL << PORT6_PPS_PPS10_Pos)                         /*!< PORT6 PPS: PPS10 Mask                   */
#define PORT6_PPS_PPS11_Pos                   11                                                      /*!< PORT6 PPS: PPS11 Position               */
#define PORT6_PPS_PPS11_Msk                   (0x01UL << PORT6_PPS_PPS11_Pos)                         /*!< PORT6 PPS: PPS11 Mask                   */
#define PORT6_PPS_PPS12_Pos                   12                                                      /*!< PORT6 PPS: PPS12 Position               */
#define PORT6_PPS_PPS12_Msk                   (0x01UL << PORT6_PPS_PPS12_Pos)                         /*!< PORT6 PPS: PPS12 Mask                   */
#define PORT6_PPS_PPS13_Pos                   13                                                      /*!< PORT6 PPS: PPS13 Position               */
#define PORT6_PPS_PPS13_Msk                   (0x01UL << PORT6_PPS_PPS13_Pos)                         /*!< PORT6 PPS: PPS13 Mask                   */
#define PORT6_PPS_PPS14_Pos                   14                                                      /*!< PORT6 PPS: PPS14 Position               */
#define PORT6_PPS_PPS14_Msk                   (0x01UL << PORT6_PPS_PPS14_Pos)                         /*!< PORT6 PPS: PPS14 Mask                   */
#define PORT6_PPS_PPS15_Pos                   15                                                      /*!< PORT6 PPS: PPS15 Position               */
#define PORT6_PPS_PPS15_Msk                   (0x01UL << PORT6_PPS_PPS15_Pos)                         /*!< PORT6 PPS: PPS15 Mask                   */

/* ---------------------------------  PORT6_HWSEL  -------------------------------- */
#define PORT6_HWSEL_HW0_Pos                   0                                                       /*!< PORT6 HWSEL: HW0 Position               */
#define PORT6_HWSEL_HW0_Msk                   (0x03UL << PORT6_HWSEL_HW0_Pos)                         /*!< PORT6 HWSEL: HW0 Mask                   */
#define PORT6_HWSEL_HW1_Pos                   2                                                       /*!< PORT6 HWSEL: HW1 Position               */
#define PORT6_HWSEL_HW1_Msk                   (0x03UL << PORT6_HWSEL_HW1_Pos)                         /*!< PORT6 HWSEL: HW1 Mask                   */
#define PORT6_HWSEL_HW2_Pos                   4                                                       /*!< PORT6 HWSEL: HW2 Position               */
#define PORT6_HWSEL_HW2_Msk                   (0x03UL << PORT6_HWSEL_HW2_Pos)                         /*!< PORT6 HWSEL: HW2 Mask                   */
#define PORT6_HWSEL_HW3_Pos                   6                                                       /*!< PORT6 HWSEL: HW3 Position               */
#define PORT6_HWSEL_HW3_Msk                   (0x03UL << PORT6_HWSEL_HW3_Pos)                         /*!< PORT6 HWSEL: HW3 Mask                   */
#define PORT6_HWSEL_HW4_Pos                   8                                                       /*!< PORT6 HWSEL: HW4 Position               */
#define PORT6_HWSEL_HW4_Msk                   (0x03UL << PORT6_HWSEL_HW4_Pos)                         /*!< PORT6 HWSEL: HW4 Mask                   */
#define PORT6_HWSEL_HW5_Pos                   10                                                      /*!< PORT6 HWSEL: HW5 Position               */
#define PORT6_HWSEL_HW5_Msk                   (0x03UL << PORT6_HWSEL_HW5_Pos)                         /*!< PORT6 HWSEL: HW5 Mask                   */
#define PORT6_HWSEL_HW6_Pos                   12                                                      /*!< PORT6 HWSEL: HW6 Position               */
#define PORT6_HWSEL_HW6_Msk                   (0x03UL << PORT6_HWSEL_HW6_Pos)                         /*!< PORT6 HWSEL: HW6 Mask                   */
#define PORT6_HWSEL_HW7_Pos                   14                                                      /*!< PORT6 HWSEL: HW7 Position               */
#define PORT6_HWSEL_HW7_Msk                   (0x03UL << PORT6_HWSEL_HW7_Pos)                         /*!< PORT6 HWSEL: HW7 Mask                   */
#define PORT6_HWSEL_HW8_Pos                   16                                                      /*!< PORT6 HWSEL: HW8 Position               */
#define PORT6_HWSEL_HW8_Msk                   (0x03UL << PORT6_HWSEL_HW8_Pos)                         /*!< PORT6 HWSEL: HW8 Mask                   */
#define PORT6_HWSEL_HW9_Pos                   18                                                      /*!< PORT6 HWSEL: HW9 Position               */
#define PORT6_HWSEL_HW9_Msk                   (0x03UL << PORT6_HWSEL_HW9_Pos)                         /*!< PORT6 HWSEL: HW9 Mask                   */
#define PORT6_HWSEL_HW10_Pos                  20                                                      /*!< PORT6 HWSEL: HW10 Position              */
#define PORT6_HWSEL_HW10_Msk                  (0x03UL << PORT6_HWSEL_HW10_Pos)                        /*!< PORT6 HWSEL: HW10 Mask                  */
#define PORT6_HWSEL_HW11_Pos                  22                                                      /*!< PORT6 HWSEL: HW11 Position              */
#define PORT6_HWSEL_HW11_Msk                  (0x03UL << PORT6_HWSEL_HW11_Pos)                        /*!< PORT6 HWSEL: HW11 Mask                  */
#define PORT6_HWSEL_HW12_Pos                  24                                                      /*!< PORT6 HWSEL: HW12 Position              */
#define PORT6_HWSEL_HW12_Msk                  (0x03UL << PORT6_HWSEL_HW12_Pos)                        /*!< PORT6 HWSEL: HW12 Mask                  */
#define PORT6_HWSEL_HW13_Pos                  26                                                      /*!< PORT6 HWSEL: HW13 Position              */
#define PORT6_HWSEL_HW13_Msk                  (0x03UL << PORT6_HWSEL_HW13_Pos)                        /*!< PORT6 HWSEL: HW13 Mask                  */
#define PORT6_HWSEL_HW14_Pos                  28                                                      /*!< PORT6 HWSEL: HW14 Position              */
#define PORT6_HWSEL_HW14_Msk                  (0x03UL << PORT6_HWSEL_HW14_Pos)                        /*!< PORT6 HWSEL: HW14 Mask                  */
#define PORT6_HWSEL_HW15_Pos                  30                                                      /*!< PORT6 HWSEL: HW15 Position              */
#define PORT6_HWSEL_HW15_Msk                  (0x03UL << PORT6_HWSEL_HW15_Pos)                        /*!< PORT6 HWSEL: HW15 Mask                  */


/* ================================================================================ */
/* ================         struct 'PORT14' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  PORT14_OUT  --------------------------------- */
#define PORT14_OUT_P0_Pos                     0                                                       /*!< PORT14 OUT: P0 Position                 */
#define PORT14_OUT_P0_Msk                     (0x01UL << PORT14_OUT_P0_Pos)                           /*!< PORT14 OUT: P0 Mask                     */
#define PORT14_OUT_P1_Pos                     1                                                       /*!< PORT14 OUT: P1 Position                 */
#define PORT14_OUT_P1_Msk                     (0x01UL << PORT14_OUT_P1_Pos)                           /*!< PORT14 OUT: P1 Mask                     */
#define PORT14_OUT_P2_Pos                     2                                                       /*!< PORT14 OUT: P2 Position                 */
#define PORT14_OUT_P2_Msk                     (0x01UL << PORT14_OUT_P2_Pos)                           /*!< PORT14 OUT: P2 Mask                     */
#define PORT14_OUT_P3_Pos                     3                                                       /*!< PORT14 OUT: P3 Position                 */
#define PORT14_OUT_P3_Msk                     (0x01UL << PORT14_OUT_P3_Pos)                           /*!< PORT14 OUT: P3 Mask                     */
#define PORT14_OUT_P4_Pos                     4                                                       /*!< PORT14 OUT: P4 Position                 */
#define PORT14_OUT_P4_Msk                     (0x01UL << PORT14_OUT_P4_Pos)                           /*!< PORT14 OUT: P4 Mask                     */
#define PORT14_OUT_P5_Pos                     5                                                       /*!< PORT14 OUT: P5 Position                 */
#define PORT14_OUT_P5_Msk                     (0x01UL << PORT14_OUT_P5_Pos)                           /*!< PORT14 OUT: P5 Mask                     */
#define PORT14_OUT_P6_Pos                     6                                                       /*!< PORT14 OUT: P6 Position                 */
#define PORT14_OUT_P6_Msk                     (0x01UL << PORT14_OUT_P6_Pos)                           /*!< PORT14 OUT: P6 Mask                     */
#define PORT14_OUT_P7_Pos                     7                                                       /*!< PORT14 OUT: P7 Position                 */
#define PORT14_OUT_P7_Msk                     (0x01UL << PORT14_OUT_P7_Pos)                           /*!< PORT14 OUT: P7 Mask                     */
#define PORT14_OUT_P8_Pos                     8                                                       /*!< PORT14 OUT: P8 Position                 */
#define PORT14_OUT_P8_Msk                     (0x01UL << PORT14_OUT_P8_Pos)                           /*!< PORT14 OUT: P8 Mask                     */
#define PORT14_OUT_P9_Pos                     9                                                       /*!< PORT14 OUT: P9 Position                 */
#define PORT14_OUT_P9_Msk                     (0x01UL << PORT14_OUT_P9_Pos)                           /*!< PORT14 OUT: P9 Mask                     */
#define PORT14_OUT_P10_Pos                    10                                                      /*!< PORT14 OUT: P10 Position                */
#define PORT14_OUT_P10_Msk                    (0x01UL << PORT14_OUT_P10_Pos)                          /*!< PORT14 OUT: P10 Mask                    */
#define PORT14_OUT_P11_Pos                    11                                                      /*!< PORT14 OUT: P11 Position                */
#define PORT14_OUT_P11_Msk                    (0x01UL << PORT14_OUT_P11_Pos)                          /*!< PORT14 OUT: P11 Mask                    */
#define PORT14_OUT_P12_Pos                    12                                                      /*!< PORT14 OUT: P12 Position                */
#define PORT14_OUT_P12_Msk                    (0x01UL << PORT14_OUT_P12_Pos)                          /*!< PORT14 OUT: P12 Mask                    */
#define PORT14_OUT_P13_Pos                    13                                                      /*!< PORT14 OUT: P13 Position                */
#define PORT14_OUT_P13_Msk                    (0x01UL << PORT14_OUT_P13_Pos)                          /*!< PORT14 OUT: P13 Mask                    */
#define PORT14_OUT_P14_Pos                    14                                                      /*!< PORT14 OUT: P14 Position                */
#define PORT14_OUT_P14_Msk                    (0x01UL << PORT14_OUT_P14_Pos)                          /*!< PORT14 OUT: P14 Mask                    */
#define PORT14_OUT_P15_Pos                    15                                                      /*!< PORT14 OUT: P15 Position                */
#define PORT14_OUT_P15_Msk                    (0x01UL << PORT14_OUT_P15_Pos)                          /*!< PORT14 OUT: P15 Mask                    */

