FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* --------------------------------  PORT15_IOCR0  -------------------------------- */
#define PORT15_IOCR0_PC0_Pos                  3                                                       /*!< PORT15 IOCR0: PC0 Position              */
#define PORT15_IOCR0_PC0_Msk                  (0x1fUL << PORT15_IOCR0_PC0_Pos)                        /*!< PORT15 IOCR0: PC0 Mask                  */
#define PORT15_IOCR0_PC1_Pos                  11                                                      /*!< PORT15 IOCR0: PC1 Position              */
#define PORT15_IOCR0_PC1_Msk                  (0x1fUL << PORT15_IOCR0_PC1_Pos)                        /*!< PORT15 IOCR0: PC1 Mask                  */
#define PORT15_IOCR0_PC2_Pos                  19                                                      /*!< PORT15 IOCR0: PC2 Position              */
#define PORT15_IOCR0_PC2_Msk                  (0x1fUL << PORT15_IOCR0_PC2_Pos)                        /*!< PORT15 IOCR0: PC2 Mask                  */
#define PORT15_IOCR0_PC3_Pos                  27                                                      /*!< PORT15 IOCR0: PC3 Position              */
#define PORT15_IOCR0_PC3_Msk                  (0x1fUL << PORT15_IOCR0_PC3_Pos)                        /*!< PORT15 IOCR0: PC3 Mask                  */

/* --------------------------------  PORT15_IOCR4  -------------------------------- */
#define PORT15_IOCR4_PC4_Pos                  3                                                       /*!< PORT15 IOCR4: PC4 Position              */
#define PORT15_IOCR4_PC4_Msk                  (0x1fUL << PORT15_IOCR4_PC4_Pos)                        /*!< PORT15 IOCR4: PC4 Mask                  */
#define PORT15_IOCR4_PC5_Pos                  11                                                      /*!< PORT15 IOCR4: PC5 Position              */
#define PORT15_IOCR4_PC5_Msk                  (0x1fUL << PORT15_IOCR4_PC5_Pos)                        /*!< PORT15 IOCR4: PC5 Mask                  */
#define PORT15_IOCR4_PC6_Pos                  19                                                      /*!< PORT15 IOCR4: PC6 Position              */
#define PORT15_IOCR4_PC6_Msk                  (0x1fUL << PORT15_IOCR4_PC6_Pos)                        /*!< PORT15 IOCR4: PC6 Mask                  */
#define PORT15_IOCR4_PC7_Pos                  27                                                      /*!< PORT15 IOCR4: PC7 Position              */
#define PORT15_IOCR4_PC7_Msk                  (0x1fUL << PORT15_IOCR4_PC7_Pos)                        /*!< PORT15 IOCR4: PC7 Mask                  */

/* --------------------------------  PORT15_IOCR8  -------------------------------- */
#define PORT15_IOCR8_PC8_Pos                  3                                                       /*!< PORT15 IOCR8: PC8 Position              */
#define PORT15_IOCR8_PC8_Msk                  (0x1fUL << PORT15_IOCR8_PC8_Pos)                        /*!< PORT15 IOCR8: PC8 Mask                  */
#define PORT15_IOCR8_PC9_Pos                  11                                                      /*!< PORT15 IOCR8: PC9 Position              */
#define PORT15_IOCR8_PC9_Msk                  (0x1fUL << PORT15_IOCR8_PC9_Pos)                        /*!< PORT15 IOCR8: PC9 Mask                  */
#define PORT15_IOCR8_PC10_Pos                 19                                                      /*!< PORT15 IOCR8: PC10 Position             */
#define PORT15_IOCR8_PC10_Msk                 (0x1fUL << PORT15_IOCR8_PC10_Pos)                       /*!< PORT15 IOCR8: PC10 Mask                 */
#define PORT15_IOCR8_PC11_Pos                 27                                                      /*!< PORT15 IOCR8: PC11 Position             */
#define PORT15_IOCR8_PC11_Msk                 (0x1fUL << PORT15_IOCR8_PC11_Pos)                       /*!< PORT15 IOCR8: PC11 Mask                 */

/* --------------------------------  PORT15_IOCR12  ------------------------------- */
#define PORT15_IOCR12_PC12_Pos                3                                                       /*!< PORT15 IOCR12: PC12 Position            */
#define PORT15_IOCR12_PC12_Msk                (0x1fUL << PORT15_IOCR12_PC12_Pos)                      /*!< PORT15 IOCR12: PC12 Mask                */
#define PORT15_IOCR12_PC13_Pos                11                                                      /*!< PORT15 IOCR12: PC13 Position            */
#define PORT15_IOCR12_PC13_Msk                (0x1fUL << PORT15_IOCR12_PC13_Pos)                      /*!< PORT15 IOCR12: PC13 Mask                */
#define PORT15_IOCR12_PC14_Pos                19                                                      /*!< PORT15 IOCR12: PC14 Position            */
#define PORT15_IOCR12_PC14_Msk                (0x1fUL << PORT15_IOCR12_PC14_Pos)                      /*!< PORT15 IOCR12: PC14 Mask                */
#define PORT15_IOCR12_PC15_Pos                27                                                      /*!< PORT15 IOCR12: PC15 Position            */
#define PORT15_IOCR12_PC15_Msk                (0x1fUL << PORT15_IOCR12_PC15_Pos)                      /*!< PORT15 IOCR12: PC15 Mask                */

/* ----------------------------------  PORT15_IN  --------------------------------- */
#define PORT15_IN_P0_Pos                      0                                                       /*!< PORT15 IN: P0 Position                  */
#define PORT15_IN_P0_Msk                      (0x01UL << PORT15_IN_P0_Pos)                            /*!< PORT15 IN: P0 Mask                      */
#define PORT15_IN_P1_Pos                      1                                                       /*!< PORT15 IN: P1 Position                  */
#define PORT15_IN_P1_Msk                      (0x01UL << PORT15_IN_P1_Pos)                            /*!< PORT15 IN: P1 Mask                      */
#define PORT15_IN_P2_Pos                      2                                                       /*!< PORT15 IN: P2 Position                  */
#define PORT15_IN_P2_Msk                      (0x01UL << PORT15_IN_P2_Pos)                            /*!< PORT15 IN: P2 Mask                      */
#define PORT15_IN_P3_Pos                      3                                                       /*!< PORT15 IN: P3 Position                  */
#define PORT15_IN_P3_Msk                      (0x01UL << PORT15_IN_P3_Pos)                            /*!< PORT15 IN: P3 Mask                      */
#define PORT15_IN_P4_Pos                      4                                                       /*!< PORT15 IN: P4 Position                  */
#define PORT15_IN_P4_Msk                      (0x01UL << PORT15_IN_P4_Pos)                            /*!< PORT15 IN: P4 Mask                      */
#define PORT15_IN_P5_Pos                      5                                                       /*!< PORT15 IN: P5 Position                  */
#define PORT15_IN_P5_Msk                      (0x01UL << PORT15_IN_P5_Pos)                            /*!< PORT15 IN: P5 Mask                      */
#define PORT15_IN_P6_Pos                      6                                                       /*!< PORT15 IN: P6 Position                  */
#define PORT15_IN_P6_Msk                      (0x01UL << PORT15_IN_P6_Pos)                            /*!< PORT15 IN: P6 Mask                      */
#define PORT15_IN_P7_Pos                      7                                                       /*!< PORT15 IN: P7 Position                  */
#define PORT15_IN_P7_Msk                      (0x01UL << PORT15_IN_P7_Pos)                            /*!< PORT15 IN: P7 Mask                      */
#define PORT15_IN_P8_Pos                      8                                                       /*!< PORT15 IN: P8 Position                  */
#define PORT15_IN_P8_Msk                      (0x01UL << PORT15_IN_P8_Pos)                            /*!< PORT15 IN: P8 Mask                      */
#define PORT15_IN_P9_Pos                      9                                                       /*!< PORT15 IN: P9 Position                  */
#define PORT15_IN_P9_Msk                      (0x01UL << PORT15_IN_P9_Pos)                            /*!< PORT15 IN: P9 Mask                      */
#define PORT15_IN_P10_Pos                     10                                                      /*!< PORT15 IN: P10 Position                 */
#define PORT15_IN_P10_Msk                     (0x01UL << PORT15_IN_P10_Pos)                           /*!< PORT15 IN: P10 Mask                     */
#define PORT15_IN_P11_Pos                     11                                                      /*!< PORT15 IN: P11 Position                 */
#define PORT15_IN_P11_Msk                     (0x01UL << PORT15_IN_P11_Pos)                           /*!< PORT15 IN: P11 Mask                     */
#define PORT15_IN_P12_Pos                     12                                                      /*!< PORT15 IN: P12 Position                 */
#define PORT15_IN_P12_Msk                     (0x01UL << PORT15_IN_P12_Pos)                           /*!< PORT15 IN: P12 Mask                     */
#define PORT15_IN_P13_Pos                     13                                                      /*!< PORT15 IN: P13 Position                 */
#define PORT15_IN_P13_Msk                     (0x01UL << PORT15_IN_P13_Pos)                           /*!< PORT15 IN: P13 Mask                     */
#define PORT15_IN_P14_Pos                     14                                                      /*!< PORT15 IN: P14 Position                 */
#define PORT15_IN_P14_Msk                     (0x01UL << PORT15_IN_P14_Pos)                           /*!< PORT15 IN: P14 Mask                     */
#define PORT15_IN_P15_Pos                     15                                                      /*!< PORT15 IN: P15 Position                 */
#define PORT15_IN_P15_Msk                     (0x01UL << PORT15_IN_P15_Pos)                           /*!< PORT15 IN: P15 Mask                     */

/* --------------------------------  PORT15_PDISC  -------------------------------- */
#define PORT15_PDISC_PDIS2_Pos                2                                                       /*!< PORT15 PDISC: PDIS2 Position            */
#define PORT15_PDISC_PDIS2_Msk                (0x01UL << PORT15_PDISC_PDIS2_Pos)                      /*!< PORT15 PDISC: PDIS2 Mask                */
#define PORT15_PDISC_PDIS3_Pos                3                                                       /*!< PORT15 PDISC: PDIS3 Position            */
#define PORT15_PDISC_PDIS3_Msk                (0x01UL << PORT15_PDISC_PDIS3_Pos)                      /*!< PORT15 PDISC: PDIS3 Mask                */
#define PORT15_PDISC_PDIS4_Pos                4                                                       /*!< PORT15 PDISC: PDIS4 Position            */
#define PORT15_PDISC_PDIS4_Msk                (0x01UL << PORT15_PDISC_PDIS4_Pos)                      /*!< PORT15 PDISC: PDIS4 Mask                */
#define PORT15_PDISC_PDIS5_Pos                5                                                       /*!< PORT15 PDISC: PDIS5 Position            */
#define PORT15_PDISC_PDIS5_Msk                (0x01UL << PORT15_PDISC_PDIS5_Pos)                      /*!< PORT15 PDISC: PDIS5 Mask                */
#define PORT15_PDISC_PDIS6_Pos                6                                                       /*!< PORT15 PDISC: PDIS6 Position            */
#define PORT15_PDISC_PDIS6_Msk                (0x01UL << PORT15_PDISC_PDIS6_Pos)                      /*!< PORT15 PDISC: PDIS6 Mask                */
#define PORT15_PDISC_PDIS7_Pos                7                                                       /*!< PORT15 PDISC: PDIS7 Position            */
#define PORT15_PDISC_PDIS7_Msk                (0x01UL << PORT15_PDISC_PDIS7_Pos)                      /*!< PORT15 PDISC: PDIS7 Mask                */
#define PORT15_PDISC_PDIS8_Pos                8                                                       /*!< PORT15 PDISC: PDIS8 Position            */
#define PORT15_PDISC_PDIS8_Msk                (0x01UL << PORT15_PDISC_PDIS8_Pos)                      /*!< PORT15 PDISC: PDIS8 Mask                */
#define PORT15_PDISC_PDIS9_Pos                9                                                       /*!< PORT15 PDISC: PDIS9 Position            */
#define PORT15_PDISC_PDIS9_Msk                (0x01UL << PORT15_PDISC_PDIS9_Pos)                      /*!< PORT15 PDISC: PDIS9 Mask                */
#define PORT15_PDISC_PDIS12_Pos               12                                                      /*!< PORT15 PDISC: PDIS12 Position           */
#define PORT15_PDISC_PDIS12_Msk               (0x01UL << PORT15_PDISC_PDIS12_Pos)                     /*!< PORT15 PDISC: PDIS12 Mask               */
#define PORT15_PDISC_PDIS13_Pos               13                                                      /*!< PORT15 PDISC: PDIS13 Position           */
#define PORT15_PDISC_PDIS13_Msk               (0x01UL << PORT15_PDISC_PDIS13_Pos)                     /*!< PORT15 PDISC: PDIS13 Mask               */
#define PORT15_PDISC_PDIS14_Pos               14                                                      /*!< PORT15 PDISC: PDIS14 Position           */
#define PORT15_PDISC_PDIS14_Msk               (0x01UL << PORT15_PDISC_PDIS14_Pos)                     /*!< PORT15 PDISC: PDIS14 Mask               */
#define PORT15_PDISC_PDIS15_Pos               15                                                      /*!< PORT15 PDISC: PDIS15 Position           */
#define PORT15_PDISC_PDIS15_Msk               (0x01UL << PORT15_PDISC_PDIS15_Pos)                     /*!< PORT15 PDISC: PDIS15 Mask               */

