FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ---------------------------------  PORT15_PPS  --------------------------------- */
#define PORT15_PPS_PPS0_Pos                   0                                                       /*!< PORT15 PPS: PPS0 Position               */
#define PORT15_PPS_PPS0_Msk                   (0x01UL << PORT15_PPS_PPS0_Pos)                         /*!< PORT15 PPS: PPS0 Mask                   */
#define PORT15_PPS_PPS1_Pos                   1                                                       /*!< PORT15 PPS: PPS1 Position               */
#define PORT15_PPS_PPS1_Msk                   (0x01UL << PORT15_PPS_PPS1_Pos)                         /*!< PORT15 PPS: PPS1 Mask                   */
#define PORT15_PPS_PPS2_Pos                   2                                                       /*!< PORT15 PPS: PPS2 Position               */
#define PORT15_PPS_PPS2_Msk                   (0x01UL << PORT15_PPS_PPS2_Pos)                         /*!< PORT15 PPS: PPS2 Mask                   */
#define PORT15_PPS_PPS3_Pos                   3                                                       /*!< PORT15 PPS: PPS3 Position               */
#define PORT15_PPS_PPS3_Msk                   (0x01UL << PORT15_PPS_PPS3_Pos)                         /*!< PORT15 PPS: PPS3 Mask                   */
#define PORT15_PPS_PPS4_Pos                   4                                                       /*!< PORT15 PPS: PPS4 Position               */
#define PORT15_PPS_PPS4_Msk                   (0x01UL << PORT15_PPS_PPS4_Pos)                         /*!< PORT15 PPS: PPS4 Mask                   */
#define PORT15_PPS_PPS5_Pos                   5                                                       /*!< PORT15 PPS: PPS5 Position               */
#define PORT15_PPS_PPS5_Msk                   (0x01UL << PORT15_PPS_PPS5_Pos)                         /*!< PORT15 PPS: PPS5 Mask                   */
#define PORT15_PPS_PPS6_Pos                   6                                                       /*!< PORT15 PPS: PPS6 Position               */
#define PORT15_PPS_PPS6_Msk                   (0x01UL << PORT15_PPS_PPS6_Pos)                         /*!< PORT15 PPS: PPS6 Mask                   */
#define PORT15_PPS_PPS7_Pos                   7                                                       /*!< PORT15 PPS: PPS7 Position               */
#define PORT15_PPS_PPS7_Msk                   (0x01UL << PORT15_PPS_PPS7_Pos)                         /*!< PORT15 PPS: PPS7 Mask                   */
#define PORT15_PPS_PPS8_Pos                   8                                                       /*!< PORT15 PPS: PPS8 Position               */
#define PORT15_PPS_PPS8_Msk                   (0x01UL << PORT15_PPS_PPS8_Pos)                         /*!< PORT15 PPS: PPS8 Mask                   */
#define PORT15_PPS_PPS9_Pos                   9                                                       /*!< PORT15 PPS: PPS9 Position               */
#define PORT15_PPS_PPS9_Msk                   (0x01UL << PORT15_PPS_PPS9_Pos)                         /*!< PORT15 PPS: PPS9 Mask                   */
#define PORT15_PPS_PPS10_Pos                  10                                                      /*!< PORT15 PPS: PPS10 Position              */
#define PORT15_PPS_PPS10_Msk                  (0x01UL << PORT15_PPS_PPS10_Pos)                        /*!< PORT15 PPS: PPS10 Mask                  */
#define PORT15_PPS_PPS11_Pos                  11                                                      /*!< PORT15 PPS: PPS11 Position              */
#define PORT15_PPS_PPS11_Msk                  (0x01UL << PORT15_PPS_PPS11_Pos)                        /*!< PORT15 PPS: PPS11 Mask                  */
#define PORT15_PPS_PPS12_Pos                  12                                                      /*!< PORT15 PPS: PPS12 Position              */
#define PORT15_PPS_PPS12_Msk                  (0x01UL << PORT15_PPS_PPS12_Pos)                        /*!< PORT15 PPS: PPS12 Mask                  */
#define PORT15_PPS_PPS13_Pos                  13                                                      /*!< PORT15 PPS: PPS13 Position              */
#define PORT15_PPS_PPS13_Msk                  (0x01UL << PORT15_PPS_PPS13_Pos)                        /*!< PORT15 PPS: PPS13 Mask                  */
#define PORT15_PPS_PPS14_Pos                  14                                                      /*!< PORT15 PPS: PPS14 Position              */
#define PORT15_PPS_PPS14_Msk                  (0x01UL << PORT15_PPS_PPS14_Pos)                        /*!< PORT15 PPS: PPS14 Mask                  */
#define PORT15_PPS_PPS15_Pos                  15                                                      /*!< PORT15 PPS: PPS15 Position              */
#define PORT15_PPS_PPS15_Msk                  (0x01UL << PORT15_PPS_PPS15_Pos)                        /*!< PORT15 PPS: PPS15 Mask                  */

/* --------------------------------  PORT15_HWSEL  -------------------------------- */
#define PORT15_HWSEL_HW0_Pos                  0                                                       /*!< PORT15 HWSEL: HW0 Position              */
#define PORT15_HWSEL_HW0_Msk                  (0x03UL << PORT15_HWSEL_HW0_Pos)                        /*!< PORT15 HWSEL: HW0 Mask                  */
#define PORT15_HWSEL_HW1_Pos                  2                                                       /*!< PORT15 HWSEL: HW1 Position              */
#define PORT15_HWSEL_HW1_Msk                  (0x03UL << PORT15_HWSEL_HW1_Pos)                        /*!< PORT15 HWSEL: HW1 Mask                  */
#define PORT15_HWSEL_HW2_Pos                  4                                                       /*!< PORT15 HWSEL: HW2 Position              */
#define PORT15_HWSEL_HW2_Msk                  (0x03UL << PORT15_HWSEL_HW2_Pos)                        /*!< PORT15 HWSEL: HW2 Mask                  */
#define PORT15_HWSEL_HW3_Pos                  6                                                       /*!< PORT15 HWSEL: HW3 Position              */
#define PORT15_HWSEL_HW3_Msk                  (0x03UL << PORT15_HWSEL_HW3_Pos)                        /*!< PORT15 HWSEL: HW3 Mask                  */
#define PORT15_HWSEL_HW4_Pos                  8                                                       /*!< PORT15 HWSEL: HW4 Position              */
#define PORT15_HWSEL_HW4_Msk                  (0x03UL << PORT15_HWSEL_HW4_Pos)                        /*!< PORT15 HWSEL: HW4 Mask                  */
#define PORT15_HWSEL_HW5_Pos                  10                                                      /*!< PORT15 HWSEL: HW5 Position              */
#define PORT15_HWSEL_HW5_Msk                  (0x03UL << PORT15_HWSEL_HW5_Pos)                        /*!< PORT15 HWSEL: HW5 Mask                  */
#define PORT15_HWSEL_HW6_Pos                  12                                                      /*!< PORT15 HWSEL: HW6 Position              */
#define PORT15_HWSEL_HW6_Msk                  (0x03UL << PORT15_HWSEL_HW6_Pos)                        /*!< PORT15 HWSEL: HW6 Mask                  */
#define PORT15_HWSEL_HW7_Pos                  14                                                      /*!< PORT15 HWSEL: HW7 Position              */
#define PORT15_HWSEL_HW7_Msk                  (0x03UL << PORT15_HWSEL_HW7_Pos)                        /*!< PORT15 HWSEL: HW7 Mask                  */
#define PORT15_HWSEL_HW8_Pos                  16                                                      /*!< PORT15 HWSEL: HW8 Position              */
#define PORT15_HWSEL_HW8_Msk                  (0x03UL << PORT15_HWSEL_HW8_Pos)                        /*!< PORT15 HWSEL: HW8 Mask                  */
#define PORT15_HWSEL_HW9_Pos                  18                                                      /*!< PORT15 HWSEL: HW9 Position              */
#define PORT15_HWSEL_HW9_Msk                  (0x03UL << PORT15_HWSEL_HW9_Pos)                        /*!< PORT15 HWSEL: HW9 Mask                  */
#define PORT15_HWSEL_HW10_Pos                 20                                                      /*!< PORT15 HWSEL: HW10 Position             */
#define PORT15_HWSEL_HW10_Msk                 (0x03UL << PORT15_HWSEL_HW10_Pos)                       /*!< PORT15 HWSEL: HW10 Mask                 */
#define PORT15_HWSEL_HW11_Pos                 22                                                      /*!< PORT15 HWSEL: HW11 Position             */
#define PORT15_HWSEL_HW11_Msk                 (0x03UL << PORT15_HWSEL_HW11_Pos)                       /*!< PORT15 HWSEL: HW11 Mask                 */
#define PORT15_HWSEL_HW12_Pos                 24                                                      /*!< PORT15 HWSEL: HW12 Position             */
#define PORT15_HWSEL_HW12_Msk                 (0x03UL << PORT15_HWSEL_HW12_Pos)                       /*!< PORT15 HWSEL: HW12 Mask                 */
#define PORT15_HWSEL_HW13_Pos                 26                                                      /*!< PORT15 HWSEL: HW13 Position             */
#define PORT15_HWSEL_HW13_Msk                 (0x03UL << PORT15_HWSEL_HW13_Pos)                       /*!< PORT15 HWSEL: HW13 Mask                 */
#define PORT15_HWSEL_HW14_Pos                 28                                                      /*!< PORT15 HWSEL: HW14 Position             */
#define PORT15_HWSEL_HW14_Msk                 (0x03UL << PORT15_HWSEL_HW14_Pos)                       /*!< PORT15 HWSEL: HW14 Mask                 */
#define PORT15_HWSEL_HW15_Pos                 30                                                      /*!< PORT15 HWSEL: HW15 Position             */
#define PORT15_HWSEL_HW15_Msk                 (0x03UL << PORT15_HWSEL_HW15_Pos)                       /*!< PORT15 HWSEL: HW15 Mask                 */

