FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
/* ===== OBSELETE MACROS- DO NOT USE PLEASE ====== */
#define   CCU4_CC4_INS_EV2S_Pos  	(8U)
#define   CCU4_CC4_INS_EV2S_Msk  	(0x0000000FU  << CCU4_CC4_INS_EV2S_Pos)

#define   CCU8_CC8_INS_EV2S_Pos  	(8U)
#define   CCU8_CC8_INS_EV2S_Msk  	(0x0000000FU  << CCU8_CC8_INS_EV2S_Pos)

#define   GPDMA1_SAR_SAR_Pos  	(0U)
#define   GPDMA1_SAR_SAR_Msk  	(0xFFFFFFFFU  << GPDMA1_SAR_SAR_Pos)

#define   GPDMA1_DAR_DAR_Pos  	(0U)
#define   GPDMA1_DAR_DAR_Msk  	(0xFFFFFFFFU  << GPDMA1_DAR_DAR_Pos)

#define   DSD_GLOBRC_CHRUN_Pos  	(0U)
#define   DSD_GLOBRC_CHRUN_Msk  	(0x0000000FU  << DSD_GLOBRC_CHRUN_Pos)

#define   ETH_MAC_CONFIGURATION_LUD_Pos  	(8U)
#define   ETH_MAC_CONFIGURATION_LUD_Msk  	(0x00000001U  << ETH_MAC_CONFIGURATION_LUD_Pos)

#define   ETH_INTERRUPT_MASK_RMIIIM_Pos  	(0U)
#define   ETH_INTERRUPT_MASK_RMIIIM_Msk  	(0x00000001U  << ETH_INTERRUPT_MASK_RMIIIM_Pos)

#define   ETH_INTERRUPT_MASK_LPIIM_Pos  	(10U)
#define   ETH_INTERRUPT_MASK_LPIIM_Msk  	(0x00000001U  << ETH_INTERRUPT_MASK_LPIIM_Pos)

#define   ETH_INTERRUPT_STATUS_RMIIIS_Pos  	(0U)
#define   ETH_INTERRUPT_STATUS_RMIIIS_Msk  	(0x00000001U  << ETH_INTERRUPT_STATUS_RMIIIS_Pos)

#define   ETH_INTERRUPT_STATUS_LPIIS_Pos  	(10U)
#define   ETH_INTERRUPT_STATUS_LPIIS_Msk  	(0x00000001U  << ETH_INTERRUPT_STATUS_LPIIS_Pos)

#define   ETH_TIMESTAMP_CONTROL_ATSFC_Pos  	(24U)
#define   ETH_TIMESTAMP_CONTROL_ATSFC_Msk  	(0x00000001U  << ETH_TIMESTAMP_CONTROL_ATSFC_Pos)

#define   ETH_TIMESTAMP_CONTROL_ATSEN0_Pos  	(25U)
#define   ETH_TIMESTAMP_CONTROL_ATSEN0_Msk  	(0x00000001U  << ETH_TIMESTAMP_CONTROL_ATSEN0_Pos)

#define   ETH_TIMESTAMP_CONTROL_ATSEN1_Pos  	(26U)
#define   ETH_TIMESTAMP_CONTROL_ATSEN1_Msk  	(0x00000001U  << ETH_TIMESTAMP_CONTROL_ATSEN1_Pos)

#define   ETH_TIMESTAMP_CONTROL_ATSEN2_Pos  	(27U)
#define   ETH_TIMESTAMP_CONTROL_ATSEN2_Msk  	(0x00000001U  << ETH_TIMESTAMP_CONTROL_ATSEN2_Pos)

#define   ETH_TIMESTAMP_CONTROL_ATSEN3_Pos  	(28U)
#define   ETH_TIMESTAMP_CONTROL_ATSEN3_Msk  	(0x00000001U  << ETH_TIMESTAMP_CONTROL_ATSEN3_Pos)

#define   ETH_TIMESTAMP_STATUS_AUXTSTRIG_Pos  	(2U)
#define   ETH_TIMESTAMP_STATUS_AUXTSTRIG_Msk  	(0x00000001U  << ETH_TIMESTAMP_STATUS_AUXTSTRIG_Pos)

#define   ETH_TIMESTAMP_STATUS_ATSSTN_Pos  	(16U)
#define   ETH_TIMESTAMP_STATUS_ATSSTN_Msk  	(0x0000000FU  << ETH_TIMESTAMP_STATUS_ATSSTN_Pos)

#define   ETH_TIMESTAMP_STATUS_ATSSTM_Pos  	(24U)
#define   ETH_TIMESTAMP_STATUS_ATSSTM_Msk  	(0x00000001U  << ETH_TIMESTAMP_STATUS_ATSSTM_Pos)

#define   ETH_TIMESTAMP_STATUS_ATSNS_Pos  	(25U)
#define   ETH_TIMESTAMP_STATUS_ATSNS_Msk  	(0x0000001FU  << ETH_TIMESTAMP_STATUS_ATSNS_Pos)

#define   ETH_STATUS_MLI_Pos  	(26U)
#define   ETH_STATUS_MLI_Msk  	(0x00000001U  << ETH_STATUS_MLI_Pos)

#define   ETH_STATUS_ELPII_Pos  	(30U)
#define   ETH_STATUS_ELPII_Msk  	(0x00000001U  << ETH_STATUS_ELPII_Pos)

#define   ETH_OPERATION_MODE_EFC_Pos  	(8U)
#define   ETH_OPERATION_MODE_EFC_Msk  	(0x00000001U  << ETH_OPERATION_MODE_EFC_Pos)

#define   ETH_OPERATION_MODE_RFA_Pos  	(9U)
#define   ETH_OPERATION_MODE_RFA_Msk  	(0x00000003U  << ETH_OPERATION_MODE_RFA_Pos)

#define   ETH_OPERATION_MODE_RFD_Pos  	(11U)
#define   ETH_OPERATION_MODE_RFD_Msk  	(0x00000003U  << ETH_OPERATION_MODE_RFD_Pos)

#define   ETH_OPERATION_MODE_RFD2_Pos  	(22U)
#define   ETH_OPERATION_MODE_RFD2_Msk  	(0x00000001U  << ETH_OPERATION_MODE_RFD2_Pos)

#define   ETH_OPERATION_MODE_RFA2_Pos  	(23U)
#define   ETH_OPERATION_MODE_RFA2_Msk  	(0x00000001U  << ETH_OPERATION_MODE_RFA2_Pos)

#define   LEDTS_LDCMP1_CMP_LDATSCOM_Pos  	(24U)
#define   LEDTS_LDCMP1_CMP_LDATSCOM_Msk  	(0x000000FFU  << LEDTS_LDCMP1_CMP_LDATSCOM_Pos)

#define   PREF_PCON_PBS_Pos  	(16U)
#define   PREF_PCON_PBS_Msk  	(0x00000001U  << PREF_PCON_PBS_Pos)

#define   RTC_ID_ID_Pos  	(0U)
#define   RTC_ID_ID_Msk  	(0xFFFFFFFFU  << RTC_ID_ID_Pos)

#define   SCU_OSC_OSCHPCTRL_GAINSEL_Pos  	(2U)
#define   SCU_OSC_OSCHPCTRL_GAINSEL_Msk  	(0x00000003U  << SCU_OSC_OSCHPCTRL_GAINSEL_Pos)

#define   SCU_GENERAL_ID_ID_Pos  	(0U)
#define   SCU_GENERAL_ID_ID_Msk  	(0xFFFFFFFFU  << SCU_GENERAL_ID_ID_Pos)

#define   SCU_GENERAL_SDMMCDEL_DLYCTRL_Pos  	(2U)
#define   SCU_GENERAL_SDMMCDEL_DLYCTRL_Msk  	(0x00000003U  << SCU_GENERAL_SDMMCDEL_DLYCTRL_Pos)

#define   SCU_GENERAL_MIRRSTS_OSCSITRIM_Pos  	(4U)
#define   SCU_GENERAL_MIRRSTS_OSCSITRIM_Msk  	(0x00000001U  << SCU_GENERAL_MIRRSTS_OSCSITRIM_Pos)

#define   SCU_INTERRUPT_SRSTAT_OSCSITRIM_Pos  	(20U)
#define   SCU_INTERRUPT_SRSTAT_OSCSITRIM_Msk  	(0x00000001U  << SCU_INTERRUPT_SRSTAT_OSCSITRIM_Pos)

#define   SCU_INTERRUPT_SRRAW_OSCSITRIM_Pos  	(20U)
#define   SCU_INTERRUPT_SRRAW_OSCSITRIM_Msk  	(0x00000001U  << SCU_INTERRUPT_SRRAW_OSCSITRIM_Pos)

#define   SCU_INTERRUPT_SRMSK_OSCSITRIM_Pos  	(20U)
#define   SCU_INTERRUPT_SRMSK_OSCSITRIM_Msk  	(0x00000001U  << SCU_INTERRUPT_SRMSK_OSCSITRIM_Pos)

#define   SCU_INTERRUPT_SRCLR_OSCSITRIM_Pos  	(20U)
#define   SCU_INTERRUPT_SRCLR_OSCSITRIM_Msk  	(0x00000001U  << SCU_INTERRUPT_SRCLR_OSCSITRIM_Pos)

#define   SCU_INTERRUPT_SRSET_OSCSITRIM_Pos  	(20U)
#define   SCU_INTERRUPT_SRSET_OSCSITRIM_Msk  	(0x00000001U  << SCU_INTERRUPT_SRSET_OSCSITRIM_Pos)

#define   SCU_POWER_PWRSTAT_HPSS_Pos  	(1U)
#define   SCU_POWER_PWRSTAT_HPSS_Msk  	(0x00000001U  << SCU_POWER_PWRSTAT_HPSS_Pos)

#define   USB_GAHBCFG_NotiAllDmaWrit_Pos  	(22U)
#define   USB_GAHBCFG_NotiAllDmaWrit_Msk  	(0x00000001U  << USB_GAHBCFG_NotiAllDmaWrit_Pos)

#define   USB_GAHBCFG_RemMemSupp_Pos  	(21U)
#define   USB_GAHBCFG_RemMemSupp_Msk  	(0x00000001U  << USB_GAHBCFG_RemMemSupp_Pos)

#define   USB_GUSBCFG_TxEndDela_Pos  	(28U)
#define   USB_GUSBCFG_TxEndDela_Msk  	(0x00000001U  << USB_GUSBCFG_TxEndDela_Pos)

#define   USB_GUSBCFG_FSIntf_Pos  	(5U)
#define   USB_GUSBCFG_FSIntf_Msk  	(0x00000001U  << USB_GUSBCFG_FSIntf_Pos)

#define   USB_GUSBCFG_PHYIf_Pos  	(3U)
#define   USB_GUSBCFG_PHYIf_Msk  	(0x00000001U  << USB_GUSBCFG_PHYIf_Pos)

#define   USB_GINTSTS_DEVICEMODE_ResetDet_Pos  	(23U)
#define   USB_GINTSTS_DEVICEMODE_ResetDet_Msk  	(0x00000001U  << USB_GINTSTS_DEVICEMODE_ResetDet_Pos)

#define   USB_GINTMSK_DEVICEMODE_ResetDetMsk_Pos  	(23U)
#define   USB_GINTMSK_DEVICEMODE_ResetDetMsk_Msk  	(0x00000001U  << USB_GINTMSK_DEVICEMODE_ResetDetMsk_Pos)

