FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4500.h
#define   USB_GINTMSK_DEVICEMODE_FetSuspMsk_Pos  	(22U)
#define   USB_GINTMSK_DEVICEMODE_FetSuspMsk_Msk  	(0x00000001U  << USB_GINTMSK_DEVICEMODE_FetSuspMsk_Pos)

#define   USB_GUID_UserID_Pos  	(0U)
#define   USB_GUID_UserID_Msk  	(0xFFFFFFFFU  << USB_GUID_UserID_Pos)

#define   USB_CH_HCFG_PerSchedEna_Pos  	(26U)
#define   USB_CH_HCFG_PerSchedEna_Msk  	(0x00000001U  << USB_CH_HCFG_PerSchedEna_Pos)

#define   USB_CH_HCFG_FrListEn_Pos  	(24U)
#define   USB_CH_HCFG_FrListEn_Msk  	(0x00000003U  << USB_CH_HCFG_FrListEn_Pos)

#define   USB_CH_HCFG_DescDMA_Pos  	(23U)
#define   USB_CH_HCFG_DescDMA_Msk  	(0x00000001U  << USB_CH_HCFG_DescDMA_Pos)

#define   USB_CH_HCFG_ResValid_Pos  	(8U)
#define   USB_CH_HCFG_ResValid_Msk  	(0x000000FFU  << USB_CH_HCFG_ResValid_Pos)

#define   USB_CH_HCFG_Ena32KHzS_Pos  	(7U)
#define   USB_CH_HCFG_Ena32KHzS_Msk  	(0x00000001U  << USB_CH_HCFG_Ena32KHzS_Pos)

#define   USB_CH_HCFG_FSLSSupp_Pos  	(2U)
#define   USB_CH_HCFG_FSLSSupp_Msk  	(0x00000001U  << USB_CH_HCFG_FSLSSupp_Pos)

#define   USB_CH_HCFG_FSLSPclkSel_Pos  	(0U)
#define   USB_CH_HCFG_FSLSPclkSel_Msk  	(0x00000003U  << USB_CH_HCFG_FSLSPclkSel_Pos)

#define   USB_DCFG_ResValid_Pos  	(26U)
#define   USB_DCFG_ResValid_Msk  	(0x0000003FU  << USB_DCFG_ResValid_Pos)

#define   USB_DCFG_EPMisCnt_Pos  	(18U)
#define   USB_DCFG_EPMisCnt_Msk  	(0x0000001FU  << USB_DCFG_EPMisCnt_Pos)

#define   USB_DCFG_Ena32KHzS_Pos  	(3U)
#define   USB_DCFG_Ena32KHzS_Msk  	(0x00000001U  << USB_DCFG_Ena32KHzS_Pos)

#define   USB_DCTL_PWROnPrgDone_Pos  	(11U)
#define   USB_DCTL_PWROnPrgDone_Msk  	(0x00000001U  << USB_DCTL_PWROnPrgDone_Pos)

#define   USB_PCGCCTL_ResetAfterSusp_Pos  	(8U)
#define   USB_PCGCCTL_ResetAfterSusp_Msk  	(0x00000001U  << USB_PCGCCTL_ResetAfterSusp_Pos)

#define   USB_PCGCCTL_L1_Suspended_Pos  	(7U)
#define   USB_PCGCCTL_L1_Suspended_Msk  	(0x00000001U  << USB_PCGCCTL_L1_Suspended_Pos)

#define   USB_PCGCCTL_PhySleep_Pos  	(6U)
#define   USB_PCGCCTL_PhySleep_Msk  	(0x00000001U  << USB_PCGCCTL_PhySleep_Pos)

#define   USB_PCGCCTL_Enbl_L1Gating_Pos  	(5U)
#define   USB_PCGCCTL_Enbl_L1Gating_Msk  	(0x00000001U  << USB_PCGCCTL_Enbl_L1Gating_Pos)

#define   USB_PCGCCTL_RstPdwnModule_Pos  	(3U)
#define   USB_PCGCCTL_RstPdwnModule_Msk  	(0x00000001U  << USB_PCGCCTL_RstPdwnModule_Pos)

#define   USB_PCGCCTL_PwrClmp_Pos  	(2U)
#define   USB_PCGCCTL_PwrClmp_Msk  	(0x00000001U  << USB_PCGCCTL_PwrClmp_Pos)

#define   USB_EP_DIEPCTL0_NextEp_Pos  	(11U)
#define   USB_EP_DIEPCTL0_NextEp_Msk  	(0x0000000FU  << USB_EP_DIEPCTL0_NextEp_Pos)

#define   USB_EP_DIEPINT0_NYETIntrpt_Pos  	(14U)
#define   USB_EP_DIEPINT0_NYETIntrpt_Msk  	(0x00000001U  << USB_EP_DIEPINT0_NYETIntrpt_Pos)

#define   USB_EP_DIEPINT0_NAKIntrpt_Pos  	(13U)
#define   USB_EP_DIEPINT0_NAKIntrpt_Msk  	(0x00000001U  << USB_EP_DIEPINT0_NAKIntrpt_Pos)

#define   USB_EP_DIEPINT0_BbleErrIntrpt_Pos  	(12U)
#define   USB_EP_DIEPINT0_BbleErrIntrpt_Msk  	(0x00000001U  << USB_EP_DIEPINT0_BbleErrIntrpt_Pos)

#define   USB_EP_DIEPINT0_PktDrpSts_Pos  	(11U)
#define   USB_EP_DIEPINT0_PktDrpSts_Msk  	(0x00000001U  << USB_EP_DIEPINT0_PktDrpSts_Pos)

#define   USB_EP_DIEPINT0_TxfifoUndrn_Pos  	(8U)
#define   USB_EP_DIEPINT0_TxfifoUndrn_Msk  	(0x00000001U  << USB_EP_DIEPINT0_TxfifoUndrn_Pos)

#define   USB_EP_DIEPINT0_INTknEPMis_Pos  	(5U)
#define   USB_EP_DIEPINT0_INTknEPMis_Msk  	(0x00000001U  << USB_EP_DIEPINT0_INTknEPMis_Pos)

#define   USB_EP_DOEPINT0_OutPktErr_Pos  	(8U)
#define   USB_EP_DOEPINT0_OutPktErr_Msk  	(0x00000001U  << USB_EP_DOEPINT0_OutPktErr_Pos)

#define   USB_EP_DIEPCTL_INTBULK_NextEp_Pos  	(11U)
#define   USB_EP_DIEPCTL_INTBULK_NextEp_Msk  	(0x0000000FU  << USB_EP_DIEPCTL_INTBULK_NextEp_Pos)

#define   USB_EP_DIEPCTL_ISOCONT_NextEp_Pos  	(11U)
#define   USB_EP_DIEPCTL_ISOCONT_NextEp_Msk  	(0x0000000FU  << USB_EP_DIEPCTL_ISOCONT_NextEp_Pos)

#define   USB_EP_DIEPINT_NYETIntrpt_Pos  	(14U)
#define   USB_EP_DIEPINT_NYETIntrpt_Msk  	(0x00000001U  << USB_EP_DIEPINT_NYETIntrpt_Pos)

#define   USB_EP_DIEPINT_NAKIntrpt_Pos  	(13U)
#define   USB_EP_DIEPINT_NAKIntrpt_Msk  	(0x00000001U  << USB_EP_DIEPINT_NAKIntrpt_Pos)

#define   USB_EP_DIEPINT_BbleErrIntrpt_Pos  	(12U)
#define   USB_EP_DIEPINT_BbleErrIntrpt_Msk  	(0x00000001U  << USB_EP_DIEPINT_BbleErrIntrpt_Pos)

#define   USB_EP_DIEPINT_PktDrpSts_Pos  	(11U)
#define   USB_EP_DIEPINT_PktDrpSts_Msk  	(0x00000001U  << USB_EP_DIEPINT_PktDrpSts_Pos)

#define   USB_EP_DIEPINT_TxfifoUndrn_Pos  	(8U)
#define   USB_EP_DIEPINT_TxfifoUndrn_Msk  	(0x00000001U  << USB_EP_DIEPINT_TxfifoUndrn_Pos)

#define   USB_EP_DOEPCTL_INTBULK_NextEp_Pos  	(11U)
#define   USB_EP_DOEPCTL_INTBULK_NextEp_Msk  	(0x0000000FU  << USB_EP_DOEPCTL_INTBULK_NextEp_Pos)

#define   USB_EP_DOEPCTL_ISOCONT_NextEp_Pos  	(11U)
#define   USB_EP_DOEPCTL_ISOCONT_NextEp_Msk  	(0x0000000FU  << USB_EP_DOEPCTL_ISOCONT_NextEp_Pos)

#define   USB_EP_DOEPINT_OutPktErr_Pos  	(8U)
#define   USB_EP_DOEPINT_OutPktErr_Msk  	(0x00000001U  << USB_EP_DOEPINT_OutPktErr_Pos)

#define   USB_CH_HCCHAR_LSpdDev_Pos  	(17U)
#define   USB_CH_HCCHAR_LSpdDev_Msk  	(0x00000001U  << USB_CH_HCCHAR_LSpdDev_Pos)

#define   USB_CH_HCTSIZ_SCATGATHER_DoPng_Pos  	(31U)
#define   USB_CH_HCTSIZ_SCATGATHER_DoPng_Msk  	(0x00000001U  << USB_CH_HCTSIZ_SCATGATHER_DoPng_Pos)

#define   USB_CH_HCTSIZ_BUFFERMODE_DoPng_Pos  	(31U)
#define   USB_CH_HCTSIZ_BUFFERMODE_DoPng_Msk  	(0x00000001U  << USB_CH_HCTSIZ_BUFFERMODE_DoPng_Pos)

#define   VADC_BRSSEL_CHSELG_Pos  	(0U)
#define   VADC_BRSSEL_CHSELG_Msk  	(0xFFFFFFFFU  << VADC_BRSSEL_CHSELG_Pos)


/* ===== OBSELETE - DO NOT USE ANY OF ABOVE ====== */


/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define PPB_BASE                        0xE000E000UL
#define DLR_BASE                        0x50004900UL
#define ERU0_BASE                       0x50004800UL
#define ERU1_BASE                       0x40044000UL
#define GPDMA0_BASE                     0x500142C0UL
#define GPDMA0_CH0_BASE                 0x50014000UL
#define GPDMA0_CH1_BASE                 0x50014058UL
#define GPDMA0_CH2_BASE                 0x500140B0UL
#define GPDMA0_CH3_BASE                 0x50014108UL
#define GPDMA0_CH4_BASE                 0x50014160UL
#define GPDMA0_CH5_BASE                 0x500141B8UL
#define GPDMA0_CH6_BASE                 0x50014210UL
#define GPDMA0_CH7_BASE                 0x50014268UL
#define GPDMA1_BASE                     0x500182C0UL
#define GPDMA1_CH0_BASE                 0x50018000UL
#define GPDMA1_CH1_BASE                 0x50018058UL
#define GPDMA1_CH2_BASE                 0x500180B0UL
#define GPDMA1_CH3_BASE                 0x50018108UL
#define FCE_BASE                        0x50020000UL
#define FCE_KE0_BASE                    0x50020020UL
#define FCE_KE1_BASE                    0x50020040UL
#define FCE_KE2_BASE                    0x50020060UL
#define FCE_KE3_BASE                    0x50020080UL
#define PBA0_BASE                       0x40000000UL
#define PBA1_BASE                       0x48000000UL
#define FLASH0_BASE                     0x58001000UL
#define PREF_BASE                       0x58004000UL
#define PMU0_BASE                       0x58000508UL
#define WDT_BASE                        0x50008000UL
#define RTC_BASE                        0x50004A00UL
#define SCU_CLK_BASE                    0x50004600UL
#define SCU_OSC_BASE                    0x50004700UL
#define SCU_PLL_BASE                    0x50004710UL
#define SCU_GENERAL_BASE                0x50004000UL
#define SCU_INTERRUPT_BASE              0x50004074UL
#define SCU_PARITY_BASE                 0x5000413CUL
#define SCU_TRAP_BASE                   0x50004160UL
#define SCU_HIBERNATE_BASE              0x50004300UL
#define SCU_POWER_BASE                  0x50004200UL
#define SCU_RESET_BASE                  0x50004400UL
#define LEDTS0_BASE                     0x48010000UL
#define SDMMC_BASE                      0x4801C000UL
#define EBU_BASE                        0x58008000UL
#define ETH0_CON_BASE                   0x50004040UL
#define ETH0_BASE                       0x5000C000UL
#define USB0_BASE                       0x50040000UL
#define USB_EP_BASE                   0x50040900UL
#define USB0_EP1_BASE                   0x50040920UL
#define USB0_EP2_BASE                   0x50040940UL
#define USB0_EP3_BASE                   0x50040960UL
#define USB0_EP4_BASE                   0x50040980UL
#define USB0_EP5_BASE                   0x500409A0UL
#define USB0_EP6_BASE                   0x500409C0UL
#define USB0_CH0_BASE                   0x50040500UL
#define USB0_CH1_BASE                   0x50040520UL
#define USB0_CH2_BASE                   0x50040540UL
#define USB0_CH3_BASE                   0x50040560UL
#define USB0_CH4_BASE                   0x50040580UL
#define USB0_CH5_BASE                   0x500405A0UL
#define USB0_CH6_BASE                   0x500405C0UL
#define USB0_CH7_BASE                   0x500405E0UL
#define USB0_CH8_BASE                   0x50040600UL
#define USB0_CH9_BASE                   0x50040620UL
#define USB0_CH10_BASE                  0x50040640UL
#define USB0_CH11_BASE                  0x50040660UL
#define USB0_CH12_BASE                  0x50040680UL
#define USB0_CH13_BASE                  0x500406A0UL
#define USIC0_BASE                      0x40030008UL
#define USIC1_BASE                      0x48020008UL
#define USIC2_BASE                      0x48024008UL
#define USIC0_CH0_BASE                  0x40030000UL
#define USIC0_CH1_BASE                  0x40030200UL
#define USIC1_CH0_BASE                  0x48020000UL
#define USIC1_CH1_BASE                  0x48020200UL
#define USIC2_CH0_BASE                  0x48024000UL
#define USIC2_CH1_BASE                  0x48024200UL
#define CAN_BASE                        0x48014000UL
#define CAN_NODE0_BASE                  0x48014200UL
#define CAN_NODE1_BASE                  0x48014300UL
#define CAN_NODE2_BASE                  0x48014400UL
#define CAN_MO0_BASE                    0x48015000UL
#define CAN_MO1_BASE                    0x48015020UL
#define CAN_MO2_BASE                    0x48015040UL
#define CAN_MO3_BASE                    0x48015060UL
#define CAN_MO4_BASE                    0x48015080UL
#define CAN_MO5_BASE                    0x480150A0UL
#define CAN_MO6_BASE                    0x480150C0UL
#define CAN_MO7_BASE                    0x480150E0UL
#define CAN_MO8_BASE                    0x48015100UL
#define CAN_MO9_BASE                    0x48015120UL
#define CAN_MO10_BASE                   0x48015140UL
#define CAN_MO11_BASE                   0x48015160UL
#define CAN_MO12_BASE                   0x48015180UL
#define CAN_MO13_BASE                   0x480151A0UL
#define CAN_MO14_BASE                   0x480151C0UL
#define CAN_MO15_BASE                   0x480151E0UL
#define CAN_MO16_BASE                   0x48015200UL
#define CAN_MO17_BASE                   0x48015220UL
#define CAN_MO18_BASE                   0x48015240UL
#define CAN_MO19_BASE                   0x48015260UL
#define CAN_MO20_BASE                   0x48015280UL
#define CAN_MO21_BASE                   0x480152A0UL
#define CAN_MO22_BASE                   0x480152C0UL
#define CAN_MO23_BASE                   0x480152E0UL
#define CAN_MO24_BASE                   0x48015300UL
#define CAN_MO25_BASE                   0x48015320UL
#define CAN_MO26_BASE                   0x48015340UL
#define CAN_MO27_BASE                   0x48015360UL
#define CAN_MO28_BASE                   0x48015380UL
#define CAN_MO29_BASE                   0x480153A0UL
#define CAN_MO30_BASE                   0x480153C0UL
#define CAN_MO31_BASE                   0x480153E0UL
#define CAN_MO32_BASE                   0x48015400UL
#define CAN_MO33_BASE                   0x48015420UL
#define CAN_MO34_BASE                   0x48015440UL
#define CAN_MO35_BASE                   0x48015460UL
#define CAN_MO36_BASE                   0x48015480UL
#define CAN_MO37_BASE                   0x480154A0UL
#define CAN_MO38_BASE                   0x480154C0UL
#define CAN_MO39_BASE                   0x480154E0UL
#define CAN_MO40_BASE                   0x48015500UL
#define CAN_MO41_BASE                   0x48015520UL
#define CAN_MO42_BASE                   0x48015540UL
#define CAN_MO43_BASE                   0x48015560UL
#define CAN_MO44_BASE                   0x48015580UL
#define CAN_MO45_BASE                   0x480155A0UL
#define CAN_MO46_BASE                   0x480155C0UL
#define CAN_MO47_BASE                   0x480155E0UL
#define CAN_MO48_BASE                   0x48015600UL
#define CAN_MO49_BASE                   0x48015620UL
#define CAN_MO50_BASE                   0x48015640UL
#define CAN_MO51_BASE                   0x48015660UL
#define CAN_MO52_BASE                   0x48015680UL
#define CAN_MO53_BASE                   0x480156A0UL
#define CAN_MO54_BASE                   0x480156C0UL
#define CAN_MO55_BASE                   0x480156E0UL
#define CAN_MO56_BASE                   0x48015700UL
#define CAN_MO57_BASE                   0x48015720UL
#define CAN_MO58_BASE                   0x48015740UL
#define CAN_MO59_BASE                   0x48015760UL
#define CAN_MO60_BASE                   0x48015780UL
#define CAN_MO61_BASE                   0x480157A0UL
#define CAN_MO62_BASE                   0x480157C0UL
#define CAN_MO63_BASE                   0x480157E0UL
#define VADC_BASE                       0x40004000UL
#define VADC_G0_BASE                    0x40004400UL
#define VADC_G1_BASE                    0x40004800UL
#define VADC_G2_BASE                    0x40004C00UL
#define VADC_G3_BASE                    0x40005000UL
#define DSD_BASE                        0x40008000UL
#define DSD_CH0_BASE                    0x40008100UL
#define DSD_CH1_BASE                    0x40008200UL
#define DSD_CH2_BASE                    0x40008300UL
#define DSD_CH3_BASE                    0x40008400UL
#define DAC_BASE                        0x48018000UL
#define CCU40_BASE                      0x4000C000UL
#define CCU41_BASE                      0x40010000UL
#define CCU42_BASE                      0x40014000UL
#define CCU43_BASE                      0x48004000UL
#define CCU40_CC40_BASE                 0x4000C100UL
#define CCU40_CC41_BASE                 0x4000C200UL
#define CCU40_CC42_BASE                 0x4000C300UL
#define CCU40_CC43_BASE                 0x4000C400UL
#define CCU41_CC40_BASE                 0x40010100UL
#define CCU41_CC41_BASE                 0x40010200UL
#define CCU41_CC42_BASE                 0x40010300UL
#define CCU41_CC43_BASE                 0x40010400UL
#define CCU42_CC40_BASE                 0x40014100UL
#define CCU42_CC41_BASE                 0x40014200UL
#define CCU42_CC42_BASE                 0x40014300UL
#define CCU42_CC43_BASE                 0x40014400UL
#define CCU43_CC40_BASE                 0x48004100UL
#define CCU43_CC41_BASE                 0x48004200UL
#define CCU43_CC42_BASE                 0x48004300UL
#define CCU43_CC43_BASE                 0x48004400UL
#define CCU80_BASE                      0x40020000UL
#define CCU81_BASE                      0x40024000UL
#define CCU80_CC80_BASE                 0x40020100UL
#define CCU80_CC81_BASE                 0x40020200UL
#define CCU80_CC82_BASE                 0x40020300UL
#define CCU80_CC83_BASE                 0x40020400UL
#define CCU81_CC80_BASE                 0x40024100UL
#define CCU81_CC81_BASE                 0x40024200UL
#define CCU81_CC82_BASE                 0x40024300UL
#define CCU81_CC83_BASE                 0x40024400UL
#define POSIF0_BASE                     0x40028000UL
#define POSIF1_BASE                     0x4002C000UL
#define PORT0_BASE                      0x48028000UL
#define PORT1_BASE                      0x48028100UL
#define PORT2_BASE                      0x48028200UL
#define PORT3_BASE                      0x48028300UL
#define PORT4_BASE                      0x48028400UL
#define PORT5_BASE                      0x48028500UL
#define PORT6_BASE                      0x48028600UL
#define PORT14_BASE                     0x48028E00UL
#define PORT15_BASE                     0x48028F00UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

